MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC472JG8AE/mcu.h
#define ACMP_CTL_ACMPIE_Pos              (1)                                               /*!< ACMP_T::CTL: ACMPIE Position              */
#define ACMP_CTL_ACMPIE_Msk              (0x1ul << ACMP_CTL_ACMPIE_Pos)                    /*!< ACMP_T::CTL: ACMPIE Mask                  */

#define ACMP_CTL_HYSEN_Pos               (2)                                               /*!< ACMP_T::CTL: HYSEN Position               */
#define ACMP_CTL_HYSEN_Msk               (0x1ul << ACMP_CTL_HYSEN_Pos)                     /*!< ACMP_T::CTL: HYSEN Mask                   */

#define ACMP_CTL_ACMPOINV_Pos            (3)                                               /*!< ACMP_T::CTL: ACMPOINV Position            */
#define ACMP_CTL_ACMPOINV_Msk            (0x1ul << ACMP_CTL_ACMPOINV_Pos)                  /*!< ACMP_T::CTL: ACMPOINV Mask                */

#define ACMP_CTL_NEGSEL_Pos              (4)                                               /*!< ACMP_T::CTL: NEGSEL Position              */
#define ACMP_CTL_NEGSEL_Msk              (0x1ul << ACMP_CTL_NEGSEL_Pos)                    /*!< ACMP_T::CTL: NEGSEL Mask                  */

#define ACMP_CTL_POSSEL_Pos              (5)                                               /*!< ACMP_T::CTL: POSSEL Position              */
#define ACMP_CTL_POSSEL_Msk              (0x7ul << ACMP_CTL_POSSEL_Pos)                    /*!< ACMP_T::CTL: POSSEL Mask                  */

#define ACMP_STATUS_ACMPIF0_Pos          (0)                                               /*!< ACMP_T::STATUS: ACMPIF0 Position          */
#define ACMP_STATUS_ACMPIF0_Msk          (0x1ul << ACMP_STATUS_ACMPIF0_Pos)                /*!< ACMP_T::STATUS: ACMPIF0 Mask              */

#define ACMP_STATUS_ACMPIF1_Pos          (1)                                               /*!< ACMP_T::STATUS: ACMPIF1 Position          */
#define ACMP_STATUS_ACMPIF1_Msk          (0x1ul << ACMP_STATUS_ACMPIF1_Pos)                /*!< ACMP_T::STATUS: ACMPIF1 Mask              */

#define ACMP_STATUS_ACMPIF2_Pos          (2)                                               /*!< ACMP_T::STATUS: ACMPIF2 Position          */
#define ACMP_STATUS_ACMPIF2_Msk          (0x1ul << ACMP_STATUS_ACMPIF2_Pos)                /*!< ACMP_T::STATUS: ACMPIF2 Mask              */

#define ACMP_STATUS_ACMPO0_Pos           (3)                                               /*!< ACMP_T::STATUS: ACMPO0 Position           */
#define ACMP_STATUS_ACMPO0_Msk           (0x1ul << ACMP_STATUS_ACMPO0_Pos)                 /*!< ACMP_T::STATUS: ACMPO0 Mask               */

#define ACMP_STATUS_ACMPO1_Pos           (4)                                               /*!< ACMP_T::STATUS: ACMPO1 Position           */
#define ACMP_STATUS_ACMPO1_Msk           (0x1ul << ACMP_STATUS_ACMPO1_Pos)                 /*!< ACMP_T::STATUS: ACMPO1 Mask               */

#define ACMP_STATUS_ACMPO2_Pos           (5)                                               /*!< ACMP_T::STATUS: ACMPO2 Position           */
#define ACMP_STATUS_ACMPO2_Msk           (0x1ul << ACMP_STATUS_ACMPO2_Pos)                 /*!< ACMP_T::STATUS: ACMPO2 Mask               */

#define ACMP_VREF_CRVCTL_Pos             (0)                                               /*!< ACMP_T::VREF: CRVCTL Position             */
#define ACMP_VREF_CRVCTL_Msk             (0xful << ACMP_VREF_CRVCTL_Pos)                   /*!< ACMP_T::VREF: CRVCTL Mask                 */

#define ACMP_VREF_CRVSSEL_Pos            (6)                                               /*!< ACMP_T::VREF: CRVSSEL Position            */
#define ACMP_VREF_CRVSSEL_Msk            (0x1ul << ACMP_VREF_CRVSSEL_Pos)                  /*!< ACMP_T::VREF: CRVSSEL Mask                */

#define ACMP_VREF_IREFSEL_Pos            (7)                                               /*!< ACMP_T::VREF: IREFSEL Position            */
#define ACMP_VREF_IREFSEL_Msk            (0x1ul << ACMP_VREF_IREFSEL_Pos)                  /*!< ACMP_T::VREF: IREFSEL Mask                */

/**@}*/ /* ACMP_CONST */
/**@}*/ /* end of ACMP register group */


/*---------------------- Analog to Digital Converter -------------------------*/
/**
    @addtogroup ADC Analog to Digital Converter(ADC)
    Memory Mapped Structure for ADC Controller
@{ */

typedef struct {


    /**
     * DAT
     * ===================================================================================================
     * Offset: 0x00~0x34 ADC Data Register 0~13
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |RESULT    |A/D Conversion Result
     * |        |          |This field contains conversion result of ADC.
     * |        |          |When DMOF (ADC_CTL[31]) bit is set to 0, 12-bit ADC conversion result with unsigned format will be filled in RESULT[11:0] and zero will be filled in RESULT[15:12].
     * |        |          |When DMOF (ADC_CTL[31]) bit set to 1, 12-bit ADC conversion result with 2'complement format will be filled in RESULT[11:0] and signed bits to will be filled in RESULT[15:12].
     * |[16]    |OV        |Overrun Flag (Read Only)
     * |        |          |0 = Data in RESULT (ADC_DATx[15:0]) is recent conversion result.
     * |        |          |1 = Data in RESULT (ADC_DATx[15:0]) is overwrite.
     * |        |          |If converted data in RESULT[15:0] has not been read before new conversion result is loaded to this register, OV is set to 1 and previous conversion result is gone.
     * |        |          |It is cleared by hardware after ADC_DAT register is read.
     * |[17]    |VALID     |Valid Flag (Read Only)
     * |        |          |0 = Data in RESULT (ADC_DATx[15:0]) bits is not valid.
     * |        |          |1 = Data in RESULT (ADC_DATx[15:0]) bits is valid.
     * |        |          |This bit is set to 1 when corresponding channel analog input conversion is completed and cleared by hardware after ADC_DAT register is read.
    */
    __I  uint32_t DAT[14];

    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE0[2];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * CTL
     * ===================================================================================================
     * Offset: 0x40  ADC Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ADCEN     |ADC Enable Control
     * |        |          |0 = ADC analog circuit Disabled.
     * |        |          |1 = ADC analog circuit Enabled.
     * |        |          |Before disabling ADC clock, this bit should be cleared to 0 by software.
     * |[1]     |ADCIEN    |ADC Interrupt Enable Control
     * |        |          |0 = ADC interrupt function Disabled.
     * |        |          |1 = ADC interrupt function Enabled.
     * |        |          |A/D conversion end interrupt request is generated if ADCIEN (ADC_CTL[1]) bit is set to 1.
     * |[2:3]   |OPMODE    |ADC Operation Mode
     * |        |          |00 = Single conversion.
     * |        |          |01 = Reserved.
     * |        |          |10 = Single-cycle scan.
     * |        |          |11 = Continuous scan.
     * |        |          |When changing the operation mode, software should disable SWTRG (ADC_CTL[11]) bit firstly.
     * |[4:5]   |HWTRGSEL  |External Hardware Trigger Source
     * |        |          |00 = A/D conversion is started by external pin (STADC).
     * |        |          |01 = Reserved.
     * |        |          |10 = Reserved.
     * |        |          |11 = PWM0 or PWM1 trigger condition is matched.
     * |        |          |Software should disable HWTRGCOND (ADC_CTL[8]) and SWTRG (ADC_CTL[11]) before changing HWTRGSEL (ADC_CTL[5:4]).
     * |        |          |In hardware trigger mode, the SWTRG (ADC_CTL[11]) bit is set by hardware trigger source.
     * |[6:7]   |HWTRGCOND |External Pin Trigger Conditions
     * |        |          |These two bits decide external pin (STADC) trigger event.
     * |        |          |The signal must be kept at stable state at least 8 system clocks for level trigger and 4 system clocks at high and low state for edge trigger.
     * |        |          |00 = Low level.
     * |        |          |01 = High level.
     * |        |          |10 = Falling edge.
     * |        |          |11 = Rising edge.
     * |[8]     |HWTRGEN   |External Hardware Trigger Enable Control
     * |        |          |Enable or disable hardware triggering of A/D conversion.
     * |        |          |The hardware trigger source include external pin (STADC) or PWM trigger which is controlled by HWTRGSEL (ADC_CTL[5:4]) register.
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |        |          |ADC hardware trigger function is only supported in single-cycle scan mode.
     * |[9]     |PDMAEN    |PDMA Transfer Enable Control
     * |        |          |0 = PDMA data transfer Disabled.
     * |        |          |1 = PDMA data transfer in ADC_DATx Enabled.
     * |        |          |When A/D conversion is completed, the converted data is loaded into ADC_DATx, software can enable this bit to generate a PDMA data transfer request.
     * |        |          |When PDMAEN (ADC_CTL[9]) is set to 1, software must set ADCIEN (ADC_CTL[1]) bit to 0 to disable interrupt.
     * |[10]    |DIFFEN    |Differential Input Mode Enable Control
     * |        |          |0 = Single-end analog input mode.
     * |        |          |1 = Differential analog input mode.
     * |        |          |The A/D analog input ADC0_CH0/ADC0_CH1 consists of a differential pair.
     * |        |          |So as ADC0_CH2/ADC0_CH3, ADC0_CH4/ADC0_CH5, ADC0_CH6/ADC0_CH7, ADC0_CH8/ADC0_CH9 and ADC0_CH10/ADC0_CH11.
     * |        |          |The even channel defines as plus analog input voltage (Vplus) and the odd channel defines as minus analog input voltage (Vminus).
     * |        |          |Differential input voltage (Vdiff) = Vplus - Vminus, where Vplus
     * |        |          |is the analog input; Vminus is the inverted analog input.
     * |        |          |In differential input mode, only the even number of the two corresponding channels needs to be enabled in ADCHER (ADC_CHEN[11:0]).
     * |        |          |The conversion result will be placed to the corresponding data register of the enabled channel.
     * |[11]    |SWTRG     |A/D Conversion Start
     * |        |          |0 = Conversion stopped and A/D converter enter idle state.
     * |        |          |1 = Conversion start.
     * |        |          |The SWTRG (ADC_CTL[11]) bit can be set to 1 from two sources: software and hardware trigger.
     * |        |          |The SWTRG (ADC_CTL[11]) bit will be cleared to 0 by hardware automatically at the ends of single mode and single-cycle scan mode.
     * |        |          |In continuous scan mode, A/D conversion is continuously performed until software write 0 to this bit or chip reset.
     * |[16:23] |PWMTRGDLY |PWM Trigger Delay Time
     * |        |          |Setting this field will delay ADC start conversion time after PWM trigger comes.
     * |        |          |PWM trigger delay time is 4 * system clock * PWMTRGDLY (ADC_CTL[23:16])
     * |[31]    |DMOF      |ADC Differential Input Mode Output Format
     * |        |          |0 = A/D conversion result will be filled in RESULT (ADC_DATx[15:0]) registers with unsigned format.
     * |        |          |1 = A/D conversion result will be filled in RESULT (ADC_DATx[15:0]) registers with 2'complement format.
    */
    __IO uint32_t CTL;

    /**
     * CHEN
     * ===================================================================================================
     * Offset: 0x44  ADC Channel Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:11]  |CHEN      |Analog Input Channel Enable Control
     * |        |          |Set CHEN (ADC_CHEN[11:0]) to enable the corresponding analog input channel (ADC0_CH1 ~ ADC0_CH11).
     * |        |          |If DIFFEN bit is set to 1, only the even number channels need to be enabled.
     * |        |          |0 = ADC input channel Disabled.
     * |        |          |1 = ADC input channel Enabled.
     * |[16]    |ADTSEN    |Internal Temperature Sensor Selection
     * |        |          |0 = Internal temperature sensor is not selected to be the analog input source of ADC.
     * |        |          |1 = Internal temperature sensor is selected to be the analog input source of ADC.
     * |        |          |ADC can only work at Single mode when software selects the temperature sensor voltage as the analog input source of ADC
     * |[17]    |ADBGEN    |Internal Band-Gap Selection
     * |        |          |0 = Internal band-gap is not selected to be the analog input source of ADC.
     * |        |          |1 = Internal band-gap is selected to be the analog input source of ADC.
     * |        |          |ADC can only work at Single mode when software selects the band-gap voltage as the analog input source of ADC
    */
    __IO uint32_t CHEN;

    /**
     * CMP
     * ===================================================================================================
     * Offset: 0x48  ADC Compare Register 0/1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ADCMPEN   |Compare Enable Control
     * |        |          |0 = Compare function Disabled.
     * |        |          |1 = Compare function Enabled.
     * |        |          |Set this bit to 1 to enable ADC controller to compare CMPDAT (ADC_CMPx[27:16]) with the conversion result of the channel specified by CMPCH (ADC_CMPx[6:3]) when the conversion data of the specified channel is loaded into ADC_DATx register.
     * |[1]     |ADCMPIE   |Compare Interrupt Enable Control
     * |        |          |0 = Compare function interrupt Disabled.
     * |        |          |1 = Compare function interrupt Enabled.
     * |        |          |If the compare function is enabled and the compare condition matches the setting of CMPCOND (ADC_CMPx[2]) and CMPMCNT(ADC_CMPx[11:8]), ADCMPFx (ADC_STATUS0[2:1]) bit will be asserted, in the meanwhile, if ADCMPIE (ADC_CMPx[1])is set to 1, a compare interrupt request is generated.
     * |[2]     |CMPCOND   |Compare Condition
     * |        |          |0 = Set the compare condition as that when a 12-bit A/D conversion result is less than the 12-bit CMPDAT (ADC_CMPx[27:16]), the internal match counter will increase one.
     * |        |          |1 = Set the compare condition as that when a 12-bit A/D conversion result is greater or equal to the 12-bit CMPDAT (ADC_CMPx[27:16]), the internal match counter will increase one.
     * |        |          |Note: When the internal counter reaches the value to CMPMCNT (ADC_CMPx[11:8]) + 1, the ADCMPFx (ADC_STATUS0[2:1]) bit will be set.
     * |[3:6]   |CMPCH     |Compare Channel Selection
     * |        |          |0000 = Channel 0 conversion result is selected to be compared.
     * |        |          |0001 = Channel 1 conversion result is selected to be compared.
     * |        |          |0010 = Channel 2 conversion result is selected to be compared.
     * |        |          |0011 = Channel 3 conversion result is selected to be compared.
     * |        |          |0100 = Channel 4 conversion result is selected to be compared.
     * |        |          |0101 = Channel 5 conversion result is selected to be compared.
     * |        |          |0110 = Channel 6 conversion result is selected to be compared.
     * |        |          |0111 = Channel 7 conversion result is selected to be compared.
     * |        |          |1000 = Channel 8 conversion result is selected to be compared.
     * |        |          |1001 = Channel 9 conversion result is selected to be compared.
     * |        |          |1010 = Channel 10 conversion result is selected to be compared.
     * |        |          |1011 = Channel 11 conversion result is selected to be compared.
     * |        |          |1100 = band-gap voltage result is selected to be compared.
     * |        |          |1101 = temperature sensor conversion result is selected to be compared.
     * |        |          |Others = reserved.
     * |[8:11]  |CMPMCNT   |Compare Match Count
     * |        |          |When the specified ADC channel analog conversion result matches the compare condition defined by CMPCOND (ADC_CMPx[2]), the internal match counter will increase 1.
     * |        |          |When the internal counter reaches the value to CMPMCNT (ADC_CMPx[11:8]) + 1, the ADCMPFx (ADC_STATUS0[2:1]) bit will be set.
     * |[16:27] |CMPDAT    |Compared Data
     * |        |          |When DMOF (ADC_CTL[31]) bit is set to 0, ADC comparator compares CMPDAT (ADC_CTL[27:16]) with conversion result with unsigned format.
     * |        |          |CMPDAT (ADC_CTL[27:16]) should be filled in unsigned format.
     * |        |          |When DMOF (ADC_CTL[31]) bit is set to 1, ADC comparator compares CMPDAT (ADC_CTL[27:16]) with conversion result with 2'complement format.
     * |        |          |CMPDAT (ADC_CTL[27:16]) should be filled in 2'complement format.
    */
    __IO uint32_t CMP[2];

    /**
     * STATUS0
     * ===================================================================================================
     * Offset: 0x50  ADC Status Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ADIF      |ADC Interrupt Flag
     * |        |          |A status flag that indicates the end of A/D conversion.
     * |        |          |ADIF (ADC_STATUS0[0]) is set to 1 at these two conditions:
     * |        |          |1. When A/D conversion ends in Single mode
     * |        |          |2. When A/D conversion ends on all specified channels in Scan mode
     * |        |          |Note: This flag can be cleared by writing 1 to it.
     * |[1]     |ADCMPF0   |Compare Flag
     * |        |          |When the selected channel A/D conversion result meets setting condition in ADCMPR0 then this bit is set to 1.
     * |        |          |And it is cleared by writing 1 to self.
     * |        |          |0 = Conversion result in ADC_DATx does not meet ADCMPR0 setting.
     * |        |          |1 = Conversion result in ADC_DATx meets ADCMPR0 setting.
     * |[2]     |ADCMPF1   |Compare Flag
     * |        |          |When the selected channel A/D conversion result meets setting condition in ADCMPR1 then this bit is set to 1.
     * |        |          |And it is cleared by writing 1 to self.
     * |        |          |0 = Conversion result in ADC_DATx does not meet ADCMPR1 setting.
     * |        |          |1 = Conversion result in ADC_DATx meets ADCMPR1 setting.
     * |[3]     |BUSY      |BUSY/IDLE (Read Only)
     * |        |          |0 = ADC is in idle state.
     * |        |          |1 = ADC is doing conversion.
     * |        |          |This bit is mirror of as SWTRG (ADC_CTL[11]) bit.
     * |[4:7]   |CHANNEL   |Current Conversion Channel (Read Only)
     * |        |          |This field reflects the current conversion channel when BUSY (ADC_STATUS0[3]) = 1.
     * |        |          |When BUSY (ADC_STATUS0[3]) = 0, it shows the number of the next converted channel.
    */
    __IO uint32_t STATUS0;

    /**
     * STATUS1
     * ===================================================================================================
     * Offset: 0x54  ADC Status Register 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:13]  |VALID     |Data Valid Flag (Read Only)
     * |        |          |It is a mirror of VALID (ADC_DATx[17]) bit.
     * |[16:29] |OV        |Overrun Flag (Read Only)
     * |        |          |It is a mirror to OV (ADC_DATx[16]) bit.
    */
    __I  uint32_t STATUS1;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE1[2];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * CURDAT
     * ===================================================================================================
     * Offset: 0x60  ADC PDMA Current Transfer Data Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:17]  |CURDAT    |ADC PDMA Current Transfer Data Bit (Read Only)
     * |        |          |When PDMA transferring, read this register can monitor current PDMA transfer data.
    */
    __I  uint32_t CURDAT;

} ADC_T;

/**
    @addtogroup ADC_CONST ADC Bit Field Definition
    Constant Definitions for ADC Controller
@{ */

#define ADC_DAT0_RESULT_Pos              (0)                                               /*!< ADC_T::DAT: RESULT Position              */
#define ADC_DAT0_RESULT_Msk              (0xfffful << ADC_DAT0_RESULT_Pos)                 /*!< ADC_T::DAT: RESULT Mask                  */

