MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC472JG8AE/mcu.h
    /**
     * STATUS
     * ===================================================================================================
     * Offset: 0x50  Clock Status Monitor Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |HXTSTB    |4~24 MHz External High-Speed Crystal Clock(HXT) Source Stable Flag
     * |        |          |0 = HXT clock is not stable or disabled.
     * |        |          |1 = HXT clock is stable.
     * |        |          |Note: This bit is read only.
     * |[1]     |LXTSTB    |32.768 KHz External Low-Speed Crystal Clock(LXT) Source Stable Flag
     * |        |          |0 = LXT clock is not stable or disabled.
     * |        |          |1 = LXT clock is stabled.
     * |        |          |Note: This is read only.
     * |[2]     |PLLSTB    |Internal PLL Clock Source Stable Flag
     * |        |          |0 = Internal PLL clock is not stable or disabled.
     * |        |          |1 = Internal PLL clock is stable.
     * |        |          |Note: This bit is read only.
     * |[3]     |LIRCSTB   |10 KHz Internal Low-Speed Oscillator Clock (LIRC)Source Stable Flag
     * |        |          |0 = LIRC clock is not stable or disabled.
     * |        |          |1 = LIRC clock is stable.
     * |        |          |Note: This bit is read only.
     * |[4]     |HIRCSTB   |22.1184 MHz Internal High-Speed Oscillator Clock (HIRC) Clock Source Stable Flag
     * |        |          |0 = HIRC clock is not stable or disabled.
     * |        |          |1 = HIRC clock is stable.
     * |        |          |Note: This bit is read only.
     * |[5]     |PLL2STB   |Internal PLL2 Clock Source Stable Flag
     * |        |          |0 = Internal PLL2 clock is not stable or disabled.
     * |        |          |1 = Internal PLL2 clock is stable.
     * |        |          |Note: This bit is read only.
     * |[7]     |CLKSFAIL  |Clock Switching Fail Flag
     * |        |          |0 = Clock switching success.
     * |        |          |1 = Clock switching failure.
     * |        |          |Note1: This bit is up2025-06-10d when software switches system clock source.
     * |        |          |If switch target clock is stable, this bit will be set to 0.
     * |        |          |If switch target clock is not stable, this bit will be set to 1.
     * |        |          |Note2: Write 1 to clear the bit to 0.
    */
    __IO uint32_t STATUS;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE2[3];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * CLKOCTL
     * ===================================================================================================
     * Offset: 0x60  Frequency Divider Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |FSEL      |Divider Output Frequency Selection
     * |        |          |The formula of output frequency is:
     * |        |          |Fout = Fin/2(N+1).
     * |        |          |Fin is the input clock frequency.
     * |        |          |Fout is the frequency of divider output clock.
     * |        |          |N is the 4-bit value of FSEL[3:0].
     * |[4]     |CLKOEN    |Clock Output Enable Control
     * |        |          |0 = Clock Output disabled.
     * |        |          |1 = Clock Output enabled.
     * |[5]     |DIV1EN    |Frequency Divider 1 Enable Control
     * |        |          |0 = Divider output frequency is dependent on FSEL value when FDIVEN is enabled.
     * |        |          |1 = Divider output frequency is input clock frequency.
    */
    __IO uint32_t CLKOCTL;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE3[3];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * CLKDCTL
     * ===================================================================================================
     * Offset: 0x70  Clock Fail Detector Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |SYSFDEN   |System Clock Detector Enable Control
     * |        |          |0 = system clock fail interrupt disabled.
     * |        |          |1 = system clock fail interrupt enabled.
     * |[1]     |SYSFIEN   |System Clock Detector Interrupt Enable Control
     * |        |          |0 = system clock fail interrupt disabled.
     * |        |          |1 = system clock fail interrupt enabled.
     * |[2]     |SYSFIF    |System Clock Detect Fail Flag
     * |        |          |0 = System clock normal.
     * |        |          |1 = System clock abnormal (write " 1" to clear).
     * |[8]     |IRCDEN    |Internal RC Clock Detector Enable Control
     * |        |          |0 = IRC clock fail interrupt disabled.
     * |        |          |1 = IRC clock fail interrupt enabled.
     * |[9]     |IRCFIEN   |Internal RC Clock Detector Interrupt Enable Control
     * |        |          |0 = IRC clock fail interrupt disabled.
     * |        |          |1 = IRC clock fail interrupt enabled.
     * |[10]    |IRCFIF    |Internal RC Clock Fail Flag
     * |        |          |0 = IRC clock normal.
     * |        |          |1 = IRC abnormal (write "1" to clear) .
    */
    __IO uint32_t CLKDCTL;

} CLK_T;

/**
    @addtogroup CLK_CONST CLK Bit Field Definition
    Constant Definitions for CLK Controller
@{ */

#define CLK_PWRCTL_HXTEN_Pos             (0)                                               /*!< CLK_T::PWRCTL: HXTEN Position             */
#define CLK_PWRCTL_HXTEN_Msk             (0x1ul << CLK_PWRCTL_HXTEN_Pos)                   /*!< CLK_T::PWRCTL: HXTEN Mask                 */

#define CLK_PWRCTL_LXTEN_Pos             (1)                                               /*!< CLK_T::PWRCTL: LXTEN Position             */
#define CLK_PWRCTL_LXTEN_Msk             (0x1ul << CLK_PWRCTL_LXTEN_Pos)                   /*!< CLK_T::PWRCTL: LXTEN Mask                 */

#define CLK_PWRCTL_HIRCEN_Pos            (2)                                               /*!< CLK_T::PWRCTL: HIRCEN Position            */
#define CLK_PWRCTL_HIRCEN_Msk            (0x1ul << CLK_PWRCTL_HIRCEN_Pos)                  /*!< CLK_T::PWRCTL: HIRCEN Mask                */

#define CLK_PWRCTL_LIRCEN_Pos            (3)                                               /*!< CLK_T::PWRCTL: LIRCEN Position            */
#define CLK_PWRCTL_LIRCEN_Msk            (0x1ul << CLK_PWRCTL_LIRCEN_Pos)                  /*!< CLK_T::PWRCTL: LIRCEN Mask                */

#define CLK_PWRCTL_PDWKDLY_Pos           (4)                                               /*!< CLK_T::PWRCTL: PDWKDLY Position           */
#define CLK_PWRCTL_PDWKDLY_Msk           (0x1ul << CLK_PWRCTL_PDWKDLY_Pos)                 /*!< CLK_T::PWRCTL: PDWKDLY Mask               */

#define CLK_PWRCTL_PDWKIEN_Pos           (5)                                               /*!< CLK_T::PWRCTL: PDWKIEN Position           */
#define CLK_PWRCTL_PDWKIEN_Msk           (0x1ul << CLK_PWRCTL_PDWKIEN_Pos)                 /*!< CLK_T::PWRCTL: PDWKIEN Mask               */

#define CLK_PWRCTL_PDWKIF_Pos            (6)                                               /*!< CLK_T::PWRCTL: PDWKIF Position            */
#define CLK_PWRCTL_PDWKIF_Msk            (0x1ul << CLK_PWRCTL_PDWKIF_Pos)                  /*!< CLK_T::PWRCTL: PDWKIF Mask                */

#define CLK_PWRCTL_PDEN_Pos              (7)                                               /*!< CLK_T::PWRCTL: PDEN Position              */
#define CLK_PWRCTL_PDEN_Msk              (0x1ul << CLK_PWRCTL_PDEN_Pos)                    /*!< CLK_T::PWRCTL: PDEN Mask                  */

#define CLK_PWRCTL_PDWTCPU_Pos           (8)                                               /*!< CLK_T::PWRCTL: PDWTCPU Position           */
#define CLK_PWRCTL_PDWTCPU_Msk           (0x1ul << CLK_PWRCTL_PDWTCPU_Pos)                 /*!< CLK_T::PWRCTL: PDWTCPU Mask               */

#define CLK_PWRCTL_DBPDEN_Pos            (9)                                               /*!< CLK_T::PWRCTL: DBPDEN Position            */
#define CLK_PWRCTL_DBPDEN_Msk            (0x1ul << CLK_PWRCTL_DBPDEN_Pos)                  /*!< CLK_T::PWRCTL: DBPDEN Mask                */

#define CLK_AHBCLK_PDMACKEN_Pos          (1)                                               /*!< CLK_T::AHBCLK: PDMACKEN Position          */
#define CLK_AHBCLK_PDMACKEN_Msk          (0x1ul << CLK_AHBCLK_PDMACKEN_Pos)                /*!< CLK_T::AHBCLK: PDMACKEN Mask              */

#define CLK_AHBCLK_ISPCKEN_Pos           (2)                                               /*!< CLK_T::AHBCLK: ISPCKEN Position           */
#define CLK_AHBCLK_ISPCKEN_Msk           (0x1ul << CLK_AHBCLK_ISPCKEN_Pos)                 /*!< CLK_T::AHBCLK: ISPCKEN Mask               */

#define CLK_AHBCLK_EBICKEN_Pos           (3)                                               /*!< CLK_T::AHBCLK: EBICKEN Position           */
#define CLK_AHBCLK_EBICKEN_Msk           (0x1ul << CLK_AHBCLK_EBICKEN_Pos)                 /*!< CLK_T::AHBCLK: EBICKEN Mask               */

