MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC472JG8AE/mcu.h
/*---------------------- Cryptographic Accelerator -------------------------*/
/**
    @addtogroup CRPT Cryptographic Accelerator(CRPT)
    Memory Mapped Structure for CRPT Controller
@{ */

typedef struct {
    /**
     * INTEN
     * ===================================================================================================
     * Offset: 0x00  Crypto Interrupt Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |AESIEN    |AES Interrupt Enable Control
     * |        |          |0 = AES interrupt Disabled.
     * |        |          |1 = AES interrupt Enabled.
     * |        |          |In DMA mode, an interrupt will be triggered when amount of data set in AES_DMA_CNT is fed into the AES engine.
     * |        |          |In Non-DMA mode, an interrupt will be triggered when the AES engine finishes the operation.
     * |[1]     |AESERRIEN |AES Error Flag Enable Control
     * |        |          |0 = AES error interrupt flag Disabled.
     * |        |          |1 = AES error interrupt flag Enabled.
     * |[8]     |TDESIEN   |TDES/DES Interrupt Enable Control
     * |        |          |0 = TDES/DES interrupt Disabled.
     * |        |          |1 = TDES/DES interrupt Enabled.
     * |        |          |In DMA mode, an interrupt will be triggered when amount of data set in TDES_DMA_CNT is fed into the TDES engine.
     * |        |          |In Non-DMA mode, an interrupt will be triggered when the TDES engine finishes the operation.
     * |[9]     |TDESERRIEN|TDES/DES Error Flag Enable Control
     * |        |          |0 = TDES/DES error interrupt flag Disabled.
     * |        |          |1 = TDES/DES error interrupt flag Enabled.
     * |[16]    |PRNGIEN   |PRNG Interrupt Enable Control
     * |        |          |0 = PRNG interrupt Disabled.
     * |        |          |1 = PRNG interrupt Enabled.
     * |[24]    |SHAIEN    |SHA Interrupt Enable Control
     * |        |          |0 = SHA interrupt Disabled.
     * |        |          |1 = SHA interrupt Enabled.
     * |        |          |In DMA mode, an interrupt will be triggered when amount of data set in SHA _DMA_CNT is fed into the SHA engine.
     * |        |          |In Non-DMA mode, an interrupt will be triggered when the SHA engine finishes the operation.
     * |[25]    |SHAERRIEN |SHA Error Interrupt Enable Control
     * |        |          |0 = SHA error interrupt flag Disabled.
     * |        |          |1 = SHA error interrupt flag Enabled.
    */
    __IO uint32_t INTEN;

    /**
     * INTSTS
     * ===================================================================================================
     * Offset: 0x04  Crypto Interrupt Flag
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |AESIF     |AES Finish Interrupt Flag
     * |        |          |This bit is cleared by writing 1, and it has no effect by writing 0.
     * |        |          |0 = No AES interrupt.
     * |        |          |1 = AES encryption/decryption done interrupt.
     * |[1]     |AESERRIF  |AES Error Flag
     * |        |          |This bit is cleared by writing 1, and it has no effect by writing 0.
     * |        |          |0 = No AES error.
     * |        |          |1 = AES encryption/decryption done interrupt.
     * |[8]     |TDESIF    |TDES/DES Finish Interrupt Flag
     * |        |          |This bit is cleared by writing 1, and it has no effect by writing 0.
     * |        |          |0 = No TDES/DES interrupt.
     * |        |          |1 = TDES/DES encryption/decryption done interrupt.
     * |[9]     |TDESERRIF |TDES/DES Error Flag
     * |        |          |This bit includes the operating and setting error.
     * |        |          |The detailed flag is shown in the TDES _FLAG register.
     * |        |          |This includes operating and setting error.
     * |        |          |This bit is cleared by writing 1, and it has no effect by writing 0.
     * |        |          |0 = No TDES/DES error.
     * |        |          |1 = TDES/DES encryption/decryption error interrupt.
     * |[16]    |PRNGIF    |PRNG Finish Interrupt Flag
     * |        |          |This bit is cleared by writing 1, and it has no effect by writing 0.
     * |        |          |0 = No PRNG interrupt.
     * |        |          |1 = PRNG key generation done interrupt.
     * |[24]    |SHAIF     |SHA Finish Interrupt Flag
     * |        |          |This bit is cleared by writing 1, and it has no effect by writing 0.
     * |        |          |0 = No SHA interrupt.
     * |        |          |1 = SHA operation done interrupt.
     * |[25]    |SHAERRIF  |SHA Error Flag
     * |        |          |This register includes operating and setting error. The detail flag is shown in SHA _FLAG register.
     * |        |          |This bit is cleared by writing 1, and it has no effect by writing 0.
     * |        |          |0 = No SHA error.
     * |        |          |1 = SHA error interrupt.
    */
    __IO uint32_t INTSTS;

    /**
     * PRNG_CTL
     * ===================================================================================================
     * Offset: 0x08  PRNG Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |START     |Start PRNG Engine
     * |        |          |0 = Stop PRNG engine.
     * |        |          |1 = Generate new key and store the new key to register CRPT_PRNG_KEYx , which will be cleared when the new key is generated.
     * |[1]     |SEEDRLD   |Reload New Seed For PRNG Engine
     * |        |          |0 = Generating key based on the current seed.
     * |        |          |1 = Reload new seed.
     * |[2:3]   |KEYSZ     |PRNG Generate Key Size
     * |        |          |00 = 64 bits.
     * |        |          |01 = 128 bits.
     * |        |          |10 = 192 bits.
     * |        |          |11 = 256 bits.
     * |[8]     |BUSY      |PRNG Busy (Read Only)
     * |        |          |0 = PRNG engine is idle.
     * |        |          |1 = Indicate that the PRNG engine is generating CRPT_PRNG_KEYx.
    */
    __IO uint32_t PRNG_CTL;

    /**
     * PRNG_SEED
     * ===================================================================================================
     * Offset: 0x0C  Seed for PRNG
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |CRPT_PRNG_SEED|Seed For PRNG (Write Only)
     * |        |          |The bits store the seed for PRNG engine.
    */
    __O  uint32_t PRNG_SEED;

    /**
     * PRNG_KEY0
     * ===================================================================================================
     * Offset: 0x10  PRNG Generated Key0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |KEYx      |Store PRNG Generated Key (Read Only)
     * |        |          |The bits store the key that is generated by PRNG.
    */
    __I  uint32_t PRNG_KEY0;

    /**
     * PRNG_KEY1
     * ===================================================================================================
     * Offset: 0x14  PRNG Generated Key1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |KEYx      |Store PRNG Generated Key (Read Only)
     * |        |          |The bits store the key that is generated by PRNG.
    */
    __I  uint32_t PRNG_KEY1;

    /**
     * PRNG_KEY2
     * ===================================================================================================
     * Offset: 0x18  PRNG Generated Key2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |KEYx      |Store PRNG Generated Key (Read Only)
     * |        |          |The bits store the key that is generated by PRNG.
    */
    __I  uint32_t PRNG_KEY2;

    /**
     * PRNG_KEY3
     * ===================================================================================================
     * Offset: 0x1C  PRNG Generated Key3
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |KEYx      |Store PRNG Generated Key (Read Only)
     * |        |          |The bits store the key that is generated by PRNG.
    */
    __I  uint32_t PRNG_KEY3;

    /**
     * PRNG_KEY4
     * ===================================================================================================
     * Offset: 0x20  PRNG Generated Key4
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |KEYx      |Store PRNG Generated Key (Read Only)
     * |        |          |The bits store the key that is generated by PRNG.
    */
    __I  uint32_t PRNG_KEY4;

    /**
     * PRNG_KEY5
     * ===================================================================================================
     * Offset: 0x24  PRNG Generated Key5
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |KEYx      |Store PRNG Generated Key (Read Only)
     * |        |          |The bits store the key that is generated by PRNG.
    */
    __I  uint32_t PRNG_KEY5;

    /**
     * PRNG_KEY6
     * ===================================================================================================
     * Offset: 0x28  PRNG Generated Key6
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |KEYx      |Store PRNG Generated Key (Read Only)
     * |        |          |The bits store the key that is generated by PRNG.
    */
    __I  uint32_t PRNG_KEY6;

    /**
     * PRNG_KEY7
     * ===================================================================================================
     * Offset: 0x2C  PRNG Generated Key7
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |KEYx      |Store PRNG Generated Key (Read Only)
     * |        |          |The bits store the key that is generated by PRNG.
    */
    __I  uint32_t PRNG_KEY7;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE0[8];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * AES_FDBCK0
     * ===================================================================================================
     * Offset: 0x50  AES Engine Output Feedback Data after Cryptographic Operation
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |FDBCK     |AES Feedback Information
     * |        |          |The feedback value is 128 bits in size.
     * |        |          |The AES engine uses the data from AES_FEEEDBACK as the data inputted to AES_IV for the next block in DMA cascade mode.
     * |        |          |The AES engine outputs feedback information for IV in the next block's operation.
     * |        |          |Software can use this feedback information to implement more than four DMA channels.
     * |        |          |Software can store that feedback value temporarily.
     * |        |          |After switching back, fill the stored feedback value to this register in the same channel operation, and then continue the operation with the original setting.
    */
    __I  uint32_t AES_FDBCK0;

    /**
     * AES_FDBCK1
     * ===================================================================================================
     * Offset: 0x54  AES Engine Output Feedback Data after Cryptographic Operation
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |FDBCK     |AES Feedback Information
     * |        |          |The feedback value is 128 bits in size.
     * |        |          |The AES engine uses the data from AES_FEEEDBACK as the data inputted to AES_IV for the next block in DMA cascade mode.
     * |        |          |The AES engine outputs feedback information for IV in the next block's operation.
     * |        |          |Software can use this feedback information to implement more than four DMA channels.
     * |        |          |Software can store that feedback value temporarily.
     * |        |          |After switching back, fill the stored feedback value to this register in the same channel operation, and then continue the operation with the original setting.
    */
    __I  uint32_t AES_FDBCK1;

    /**
     * AES_FDBCK2
     * ===================================================================================================
     * Offset: 0x58  AES Engine Output Feedback Data after Cryptographic Operation
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |FDBCK     |AES Feedback Information
     * |        |          |The feedback value is 128 bits in size.
     * |        |          |The AES engine uses the data from AES_FEEEDBACK as the data inputted to AES_IV for the next block in DMA cascade mode.
     * |        |          |The AES engine outputs feedback information for IV in the next block's operation.
     * |        |          |Software can use this feedback information to implement more than four DMA channels.
     * |        |          |Software can store that feedback value temporarily.
     * |        |          |After switching back, fill the stored feedback value to this register in the same channel operation, and then continue the operation with the original setting.
    */
    __I  uint32_t AES_FDBCK2;

    /**
     * AES_FDBCK3
     * ===================================================================================================
     * Offset: 0x5C  AES Engine Output Feedback Data after Cryptographic Operation
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |FDBCK     |AES Feedback Information
     * |        |          |The feedback value is 128 bits in size.
     * |        |          |The AES engine uses the data from AES_FEEEDBACK as the data inputted to AES_IV for the next block in DMA cascade mode.
     * |        |          |The AES engine outputs feedback information for IV in the next block's operation.
     * |        |          |Software can use this feedback information to implement more than four DMA channels.
     * |        |          |Software can store that feedback value temporarily.
     * |        |          |After switching back, fill the stored feedback value to this register in the same channel operation, and then continue the operation with the original setting.
    */
    __I  uint32_t AES_FDBCK3;

    /**
     * TDES_FDBCKH
     * ===================================================================================================
     * Offset: 0x60  TDES/DES Engine Output Feedback High Word Data after Cryptographic Operation
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |FDBCK     |TDES/DES Feedback
     * |        |          |The feedback value is 64 bits in size.
     * |        |          |The TDES/DES engine uses the data from CRPT_TDES_FEEEDBACK as the data inputted to CRPT_TDES_IV for the next block in DMA cascade mode.
     * |        |          |The feedback register is for CBC, CFB, and OFB mode.
     * |        |          |TDES/DES engine outputs feedback information for IV in the next block's operation.
     * |        |          |Software can use this feedback information to implement more than four DMA channels.
     * |        |          |Software can store that feedback value temporarily.
     * |        |          |After switching back, fill the stored feedback value to this register in the same channel operation.
     * |        |          |Then can continue the operation with the original setting.
    */
    __I  uint32_t TDES_FDBCKH;

    /**
     * TDES_FDBCKL
     * ===================================================================================================
     * Offset: 0x64  TDES/DES Engine Output Feedback Low Word Data after Cryptographic Operation
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |FDBCK     |TDES/DES Feedback
     * |        |          |The feedback value is 64 bits in size.
     * |        |          |The TDES/DES engine uses the data from CRPT_TDES_FEEEDBACK as the data inputted to CRPT_TDES_IV for the next block in DMA cascade mode.
     * |        |          |The feedback register is for CBC, CFB, and OFB mode.
     * |        |          |TDES/DES engine outputs feedback information for IV in the next block's operation.
     * |        |          |Software can use this feedback information to implement more than four DMA channels.
     * |        |          |Software can store that feedback value temporarily.
     * |        |          |After switching back, fill the stored feedback value to this register in the same channel operation.
     * |        |          |Then can continue the operation with the original setting.
    */
    __I  uint32_t TDES_FDBCKL;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE1[38];
    /// @endcond //HIDDEN_SYMBOLS


