MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC472JG8AE/mcu.h
#define CRPT_AES0_CNT_CNT_Pos            (0)                                               /*!< CRPT_T::AES0_CNT: CNT Position            */
#define CRPT_AES0_CNT_CNT_Msk            (0xfffffffful << CRPT_AES0_CNT_CNT_Pos)           /*!< CRPT_T::AES0_CNT: CNT Mask                */

#define CRPT_AES1_KEY0_KEY_Pos           (0)                                               /*!< CRPT_T::AES1_KEY0: KEY Position           */
#define CRPT_AES1_KEY0_KEY_Msk           (0xfffffffful << CRPT_AES1_KEY0_KEY_Pos)          /*!< CRPT_T::AES1_KEY0: KEY Mask               */

#define CRPT_AES1_KEY1_KEY_Pos           (0)                                               /*!< CRPT_T::AES1_KEY1: KEY Position           */
#define CRPT_AES1_KEY1_KEY_Msk           (0xfffffffful << CRPT_AES1_KEY1_KEY_Pos)          /*!< CRPT_T::AES1_KEY1: KEY Mask               */

#define CRPT_AES1_KEY2_KEY_Pos           (0)                                               /*!< CRPT_T::AES1_KEY2: KEY Position           */
#define CRPT_AES1_KEY2_KEY_Msk           (0xfffffffful << CRPT_AES1_KEY2_KEY_Pos)          /*!< CRPT_T::AES1_KEY2: KEY Mask               */

#define CRPT_AES1_KEY3_KEY_Pos           (0)                                               /*!< CRPT_T::AES1_KEY3: KEY Position           */
#define CRPT_AES1_KEY3_KEY_Msk           (0xfffffffful << CRPT_AES1_KEY3_KEY_Pos)          /*!< CRPT_T::AES1_KEY3: KEY Mask               */

#define CRPT_AES1_KEY4_KEY_Pos           (0)                                               /*!< CRPT_T::AES1_KEY4: KEY Position           */
#define CRPT_AES1_KEY4_KEY_Msk           (0xfffffffful << CRPT_AES1_KEY4_KEY_Pos)          /*!< CRPT_T::AES1_KEY4: KEY Mask               */

#define CRPT_AES1_KEY5_KEY_Pos           (0)                                               /*!< CRPT_T::AES1_KEY5: KEY Position           */
#define CRPT_AES1_KEY5_KEY_Msk           (0xfffffffful << CRPT_AES1_KEY5_KEY_Pos)          /*!< CRPT_T::AES1_KEY5: KEY Mask               */

#define CRPT_AES1_KEY6_KEY_Pos           (0)                                               /*!< CRPT_T::AES1_KEY6: KEY Position           */
#define CRPT_AES1_KEY6_KEY_Msk           (0xfffffffful << CRPT_AES1_KEY6_KEY_Pos)          /*!< CRPT_T::AES1_KEY6: KEY Mask               */

#define CRPT_AES1_KEY7_KEY_Pos           (0)                                               /*!< CRPT_T::AES1_KEY7: KEY Position           */
#define CRPT_AES1_KEY7_KEY_Msk           (0xfffffffful << CRPT_AES1_KEY7_KEY_Pos)          /*!< CRPT_T::AES1_KEY7: KEY Mask               */

#define CRPT_AES1_IV0_IV_Pos             (0)                                               /*!< CRPT_T::AES1_IV0: IV Position             */
#define CRPT_AES1_IV0_IV_Msk             (0xfffffffful << CRPT_AES1_IV0_IV_Pos)            /*!< CRPT_T::AES1_IV0: IV Mask                 */

#define CRPT_AES1_IV1_IV_Pos             (0)                                               /*!< CRPT_T::AES1_IV1: IV Position             */
#define CRPT_AES1_IV1_IV_Msk             (0xfffffffful << CRPT_AES1_IV1_IV_Pos)            /*!< CRPT_T::AES1_IV1: IV Mask                 */

#define CRPT_AES1_IV2_IV_Pos             (0)                                               /*!< CRPT_T::AES1_IV2: IV Position             */
#define CRPT_AES1_IV2_IV_Msk             (0xfffffffful << CRPT_AES1_IV2_IV_Pos)            /*!< CRPT_T::AES1_IV2: IV Mask                 */

#define CRPT_AES1_IV3_IV_Pos             (0)                                               /*!< CRPT_T::AES1_IV3: IV Position             */
#define CRPT_AES1_IV3_IV_Msk             (0xfffffffful << CRPT_AES1_IV3_IV_Pos)            /*!< CRPT_T::AES1_IV3: IV Mask                 */

#define CRPT_AES1_SADDR_SADDR_Pos        (0)                                               /*!< CRPT_T::AES1_SADDR: SADDR Position        */
#define CRPT_AES1_SADDR_SADDR_Msk        (0xfffffffful << CRPT_AES1_SADDR_SADDR_Pos)       /*!< CRPT_T::AES1_SADDR: SADDR Mask            */

#define CRPT_AES1_DADDR_DADDR_Pos        (0)                                               /*!< CRPT_T::AES1_DADDR: DADDR Position        */
#define CRPT_AES1_DADDR_DADDR_Msk        (0xfffffffful << CRPT_AES1_DADDR_DADDR_Pos)       /*!< CRPT_T::AES1_DADDR: DADDR Mask            */

#define CRPT_AES1_CNT_CNT_Pos            (0)                                               /*!< CRPT_T::AES1_CNT: CNT Position            */
#define CRPT_AES1_CNT_CNT_Msk            (0xfffffffful << CRPT_AES1_CNT_CNT_Pos)           /*!< CRPT_T::AES1_CNT: CNT Mask                */

#define CRPT_AES2_KEY0_KEY_Pos           (0)                                               /*!< CRPT_T::AES2_KEY0: KEY Position           */
#define CRPT_AES2_KEY0_KEY_Msk           (0xfffffffful << CRPT_AES2_KEY0_KEY_Pos)          /*!< CRPT_T::AES2_KEY0: KEY Mask               */

#define CRPT_AES2_KEY1_KEY_Pos           (0)                                               /*!< CRPT_T::AES2_KEY1: KEY Position           */
#define CRPT_AES2_KEY1_KEY_Msk           (0xfffffffful << CRPT_AES2_KEY1_KEY_Pos)          /*!< CRPT_T::AES2_KEY1: KEY Mask               */

#define CRPT_AES2_KEY2_KEY_Pos           (0)                                               /*!< CRPT_T::AES2_KEY2: KEY Position           */
#define CRPT_AES2_KEY2_KEY_Msk           (0xfffffffful << CRPT_AES2_KEY2_KEY_Pos)          /*!< CRPT_T::AES2_KEY2: KEY Mask               */

#define CRPT_AES2_KEY3_KEY_Pos           (0)                                               /*!< CRPT_T::AES2_KEY3: KEY Position           */
#define CRPT_AES2_KEY3_KEY_Msk           (0xfffffffful << CRPT_AES2_KEY3_KEY_Pos)          /*!< CRPT_T::AES2_KEY3: KEY Mask               */

#define CRPT_AES2_KEY4_KEY_Pos           (0)                                               /*!< CRPT_T::AES2_KEY4: KEY Position           */
#define CRPT_AES2_KEY4_KEY_Msk           (0xfffffffful << CRPT_AES2_KEY4_KEY_Pos)          /*!< CRPT_T::AES2_KEY4: KEY Mask               */

#define CRPT_AES2_KEY5_KEY_Pos           (0)                                               /*!< CRPT_T::AES2_KEY5: KEY Position           */
#define CRPT_AES2_KEY5_KEY_Msk           (0xfffffffful << CRPT_AES2_KEY5_KEY_Pos)          /*!< CRPT_T::AES2_KEY5: KEY Mask               */

#define CRPT_AES2_KEY6_KEY_Pos           (0)                                               /*!< CRPT_T::AES2_KEY6: KEY Position           */
#define CRPT_AES2_KEY6_KEY_Msk           (0xfffffffful << CRPT_AES2_KEY6_KEY_Pos)          /*!< CRPT_T::AES2_KEY6: KEY Mask               */

