MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC472JG8AE/mcu.h
#define CRPT_TDES_STS_BUSERR_Pos         (20)                                              /*!< CRPT_T::TDES_STS: BUSERR Position         */
#define CRPT_TDES_STS_BUSERR_Msk         (0x1ul << CRPT_TDES_STS_BUSERR_Pos)               /*!< CRPT_T::TDES_STS: BUSERR Mask             */

#define CRPT_TDES0_KEY1H_KEY_Pos         (0)                                               /*!< CRPT_T::TDES0_KEY1H: KEY Position         */
#define CRPT_TDES0_KEY1H_KEY_Msk         (0xfffffffful << CRPT_TDES0_KEY1H_KEY_Pos)        /*!< CRPT_T::TDES0_KEY1H: KEY Mask             */

#define CRPT_TDES0_KEY1L_KEY_Pos         (0)                                               /*!< CRPT_T::TDES0_KEY1L: KEY Position         */
#define CRPT_TDES0_KEY1L_KEY_Msk         (0xfffffffful << CRPT_TDES0_KEY1L_KEY_Pos)        /*!< CRPT_T::TDES0_KEY1L: KEY Mask             */

#define CRPT_TDES0_KEY2H_KEY_Pos         (0)                                               /*!< CRPT_T::TDES0_KEY2H: KEY Position         */
#define CRPT_TDES0_KEY2H_KEY_Msk         (0xfffffffful << CRPT_TDES0_KEY2H_KEY_Pos)        /*!< CRPT_T::TDES0_KEY2H: KEY Mask             */

#define CRPT_TDES0_KEY2L_KEY_Pos         (0)                                               /*!< CRPT_T::TDES0_KEY2L: KEY Position         */
#define CRPT_TDES0_KEY2L_KEY_Msk         (0xfffffffful << CRPT_TDES0_KEY2L_KEY_Pos)        /*!< CRPT_T::TDES0_KEY2L: KEY Mask             */

#define CRPT_TDES0_KEY3H_KEY_Pos         (0)                                               /*!< CRPT_T::TDES0_KEY3H: KEY Position         */
#define CRPT_TDES0_KEY3H_KEY_Msk         (0xfffffffful << CRPT_TDES0_KEY3H_KEY_Pos)        /*!< CRPT_T::TDES0_KEY3H: KEY Mask             */

#define CRPT_TDES0_KEY3L_KEY_Pos         (0)                                               /*!< CRPT_T::TDES0_KEY3L: KEY Position         */
#define CRPT_TDES0_KEY3L_KEY_Msk         (0xfffffffful << CRPT_TDES0_KEY3L_KEY_Pos)        /*!< CRPT_T::TDES0_KEY3L: KEY Mask             */

#define CRPT_TDES0_IVH_IV_Pos            (0)                                               /*!< CRPT_T::TDES0_IVH: IV Position            */
#define CRPT_TDES0_IVH_IV_Msk            (0xfffffffful << CRPT_TDES0_IVH_IV_Pos)           /*!< CRPT_T::TDES0_IVH: IV Mask                */

#define CRPT_TDES0_IVL_IV_Pos            (0)                                               /*!< CRPT_T::TDES0_IVL: IV Position            */
#define CRPT_TDES0_IVL_IV_Msk            (0xfffffffful << CRPT_TDES0_IVL_IV_Pos)           /*!< CRPT_T::TDES0_IVL: IV Mask                */

#define CRPT_TDES0_SADDR_SADDR_Pos       (0)                                               /*!< CRPT_T::TDES0_SADDR: SADDR Position       */
#define CRPT_TDES0_SADDR_SADDR_Msk       (0xfffffffful << CRPT_TDES0_SADDR_SADDR_Pos)      /*!< CRPT_T::TDES0_SADDR: SADDR Mask           */

#define CRPT_TDES0_DADDR_DADDR_Pos       (0)                                               /*!< CRPT_T::TDES0_DADDR: DADDR Position       */
#define CRPT_TDES0_DADDR_DADDR_Msk       (0xfffffffful << CRPT_TDES0_DADDR_DADDR_Pos)      /*!< CRPT_T::TDES0_DADDR: DADDR Mask           */

#define CRPT_TDES0_CNT_CNT_Pos           (0)                                               /*!< CRPT_T::TDES0_CNT: CNT Position           */
#define CRPT_TDES0_CNT_CNT_Msk           (0xfffffffful << CRPT_TDES0_CNT_CNT_Pos)          /*!< CRPT_T::TDES0_CNT: CNT Mask               */

#define CRPT_TDES_DATIN_DATIN_Pos        (0)                                               /*!< CRPT_T::TDES_DATIN: DATIN Position        */
#define CRPT_TDES_DATIN_DATIN_Msk        (0xfffffffful << CRPT_TDES_DATIN_DATIN_Pos)       /*!< CRPT_T::TDES_DATIN: DATIN Mask            */

#define CRPT_TDES_DATOUT_DATOUT_Pos      (0)                                               /*!< CRPT_T::TDES_DATOUT: DATOUT Position      */
#define CRPT_TDES_DATOUT_DATOUT_Msk      (0xfffffffful << CRPT_TDES_DATOUT_DATOUT_Pos)     /*!< CRPT_T::TDES_DATOUT: DATOUT Mask          */

#define CRPT_TDES1_KEY1H_KEY_Pos         (0)                                               /*!< CRPT_T::TDES1_KEY1H: KEY Position         */
#define CRPT_TDES1_KEY1H_KEY_Msk         (0xfffffffful << CRPT_TDES1_KEY1H_KEY_Pos)        /*!< CRPT_T::TDES1_KEY1H: KEY Mask             */

#define CRPT_TDES1_KEY1L_KEYL_Pos        (0)                                               /*!< CRPT_T::TDES1_KEY1L: KEY Position         */
#define CRPT_TDES1_KEY1L_KEY_Msk         (0xfffffffful << CRPT_TDES1_KEY1L_KEY_Pos)        /*!< CRPT_T::TDES1_KEY1L: KEY Mask             */

#define CRPT_TDES1_KEY2H_KEY_Pos         (0)                                               /*!< CRPT_T::TDES1_KEY2H: KEY Position         */
#define CRPT_TDES1_KEY2H_KEY_Msk         (0xfffffffful << CRPT_TDES1_KEY2H_KEY_Pos)        /*!< CRPT_T::TDES1_KEY2H: KEY Mask             */

#define CRPT_TDES1_KEY2L_KEY_Pos         (0)                                               /*!< CRPT_T::TDES1_KEY2L: KEY Position         */
#define CRPT_TDES1_KEY2L_KEY_Msk         (0xfffffffful << CRPT_TDES1_KEY2L_KEY_Pos)        /*!< CRPT_T::TDES1_KEY2L: KEY Mask             */

#define CRPT_TDES1_KEY3H_KEY_Pos         (0)                                               /*!< CRPT_T::TDES1_KEY3H: KEY Position         */
#define CRPT_TDES1_KEY3H_KEY_Msk         (0xfffffffful << CRPT_TDES1_KEY3H_KEY_Pos)        /*!< CRPT_T::TDES1_KEY3H: KEY Mask             */

#define CRPT_TDES1_KEY3L_KEY_Pos         (0)                                               /*!< CRPT_T::TDES1_KEY3L: KEY Position         */
#define CRPT_TDES1_KEY3L_KEY_Msk         (0xfffffffful << CRPT_TDES1_KEY3L_KEY_Pos)        /*!< CRPT_T::TDES1_KEY3L: KEY Mask             */

#define CRPT_TDES1_IVH_IV_Pos            (0)                                               /*!< CRPT_T::TDES1_IVH: IV Position            */
#define CRPT_TDES1_IVH_IV_Msk            (0xfffffffful << CRPT_TDES1_IVH_IV_Pos)           /*!< CRPT_T::TDES1_IVH: IV Mask                */

#define CRPT_TDES1_IVL_IV_Pos            (0)                                               /*!< CRPT_T::TDES1_IVL: IV Position            */
#define CRPT_TDES1_IVL_IV_Msk            (0xfffffffful << CRPT_TDES1_IVL_IV_Pos)           /*!< CRPT_T::TDES1_IVL: IV Mask                */

#define CRPT_TDES1_SADDR_SADDR_Pos       (0)                                               /*!< CRPT_T::TDES1_SADDR: SADDR Position       */
#define CRPT_TDES1_SADDR_SADDR_Msk       (0xfffffffful << CRPT_TDES1_SADDR_SADDR_Pos)      /*!< CRPT_T::TDES1_SADDR: SADDR Mask           */

