MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC472JG8AE/mcu.h
#define CRPT_SHA_CTL_OPMODE_Pos          (8)                                               /*!< CRPT_T::SHA_CTL: OPMODE Position          */
#define CRPT_SHA_CTL_OPMODE_Msk          (0x7ul << CRPT_SHA_CTL_OPMODE_Pos)                /*!< CRPT_T::SHA_CTL: OPMODE Mask              */

#define CRPT_SHA_CTL_OUTSWAP_Pos         (22)                                              /*!< CRPT_T::SHA_CTL: OUTSWAP Position         */
#define CRPT_SHA_CTL_OUTSWAP_Msk         (0x1ul << CRPT_SHA_CTL_OUTSWAP_Pos)               /*!< CRPT_T::SHA_CTL: OUTSWAP Mask             */

#define CRPT_SHA_CTL_INSWAP_Pos          (23)                                              /*!< CRPT_T::SHA_CTL: INSWAP Position          */
#define CRPT_SHA_CTL_INSWAP_Msk          (0x1ul << CRPT_SHA_CTL_INSWAP_Pos)                /*!< CRPT_T::SHA_CTL: INSWAP Mask              */

#define CRPT_SHA_STS_BUSY_Pos            (0)                                               /*!< CRPT_T::SHA_STS: BUSY Position            */
#define CRPT_SHA_STS_BUSY_Msk            (0x1ul << CRPT_SHA_STS_BUSY_Pos)                  /*!< CRPT_T::SHA_STS: BUSY Mask                */

#define CRPT_SHA_STS_DMABUSY_Pos         (1)                                               /*!< CRPT_T::SHA_STS: DMABUSY Position         */
#define CRPT_SHA_STS_DMABUSY_Msk         (0x1ul << CRPT_SHA_STS_DMABUSY_Pos)               /*!< CRPT_T::SHA_STS: DMABUSY Mask             */

#define CRPT_SHA_STS_DMAERR_Pos          (8)                                               /*!< CRPT_T::SHA_STS: DMAERR Position          */
#define CRPT_SHA_STS_DMAERR_Msk          (0x1ul << CRPT_SHA_STS_DMAERR_Pos)                /*!< CRPT_T::SHA_STS: DMAERR Mask              */

#define CRPT_SHA_STS_DATINREQ_Pos        (16)                                              /*!< CRPT_T::SHA_STS: DATINREQ Position        */
#define CRPT_SHA_STS_DATINREQ_Msk        (0x1ul << CRPT_SHA_STS_DATINREQ_Pos)              /*!< CRPT_T::SHA_STS: DATINREQ Mask            */

#define CRPT_SHA_DGST0_DGST_Pos          (0)                                               /*!< CRPT_T::SHA_DGST0: DGST Position          */
#define CRPT_SHA_DGST0_DGST_Msk          (0xfffffffful << CRPT_SHA_DGST0_DGST_Pos)         /*!< CRPT_T::SHA_DGST0: DGST Mask              */

#define CRPT_SHA_DGST1_DGST_Pos          (0)                                               /*!< CRPT_T::SHA_DGST1: DGST Position          */
#define CRPT_SHA_DGST1_DGST_Msk          (0xfffffffful << CRPT_SHA_DGST1_DGST_Pos)         /*!< CRPT_T::SHA_DGST1: DGST Mask              */

#define CRPT_SHA_DGST2_DGST_Pos          (0)                                               /*!< CRPT_T::SHA_DGST2: DGST Position          */
#define CRPT_SHA_DGST2_DGST_Msk          (0xfffffffful << CRPT_SHA_DGST2_DGST_Pos)         /*!< CRPT_T::SHA_DGST2: DGST Mask              */

#define CRPT_SHA_DGST3_DGST_Pos          (0)                                               /*!< CRPT_T::SHA_DGST3: DGST Position          */
#define CRPT_SHA_DGST3_DGST_Msk          (0xfffffffful << CRPT_SHA_DGST3_DGST_Pos)         /*!< CRPT_T::SHA_DGST3: DGST Mask              */

#define CRPT_SHA_DGST4_DGST_Pos          (0)                                               /*!< CRPT_T::SHA_DGST4: DGST Position          */
#define CRPT_SHA_DGST4_DGST_Msk          (0xfffffffful << CRPT_SHA_DGST4_DGST_Pos)         /*!< CRPT_T::SHA_DGST4: DGST Mask              */

#define CRPT_SHA_DGST5_DGST_Pos          (0)                                               /*!< CRPT_T::SHA_DGST5: DGST Position          */
#define CRPT_SHA_DGST5_DGST_Msk          (0xfffffffful << CRPT_SHA_DGST5_DGST_Pos)         /*!< CRPT_T::SHA_DGST5: DGST Mask              */

#define CRPT_SHA_DGST6_DGST_Pos          (0)                                               /*!< CRPT_T::SHA_DGST6: DGST Position          */
#define CRPT_SHA_DGST6_DGST_Msk          (0xfffffffful << CRPT_SHA_DGST6_DGST_Pos)         /*!< CRPT_T::SHA_DGST6: DGST Mask              */

#define CRPT_SHA_DGST7_DGST_Pos          (0)                                               /*!< CRPT_T::SHA_DGST7: DGST Position          */
#define CRPT_SHA_DGST7_DGST_Msk          (0xfffffffful << CRPT_SHA_DGST7_DGST_Pos)         /*!< CRPT_T::SHA_DGST7: DGST Mask              */

#define CRPT_SHA_KEYCNT_KEYCNT_Pos       (0)                                               /*!< CRPT_T::SHA_KEYCNT: KEYCNT Position       */
#define CRPT_SHA_KEYCNT_KEYCNT_Msk       (0xfffffffful << CRPT_SHA_KEYCNT_KEYCNT_Pos)      /*!< CRPT_T::SHA_KEYCNT: KEYCNT Mask           */

#define CRPT_SHA_SADDR_SADDR_Pos         (0)                                               /*!< CRPT_T::SHA_SADDR: SADDR Position         */
#define CRPT_SHA_SADDR_SADDR_Msk         (0xfffffffful << CRPT_SHA_SADDR_SADDR_Pos)        /*!< CRPT_T::SHA_SADDR: SADDR Mask             */

#define CRPT_SHA_DMACNT_DMACNT_Pos       (0)                                               /*!< CRPT_T::SHA_DMACNT: DMACNT Position       */
#define CRPT_SHA_DMACNT_DMACNT_Msk       (0xfffffffful << CRPT_SHA_DMACNT_DMACNT_Pos)      /*!< CRPT_T::SHA_DMACNT: DMACNT Mask           */

#define CRPT_SHA_DATIN_DATIN_Pos         (0)                                               /*!< CRPT_T::SHA_DATIN: DATIN Position         */
#define CRPT_SHA_DATIN_DATIN_Msk         (0xfffffffful << CRPT_SHA_DATIN_DATIN_Pos)        /*!< CRPT_T::SHA_DATIN: DATIN Mask             */

/**@}*/ /* CRPT_CONST */
/**@}*/ /* end of CRPT register group */


/*---------------------- Enhanced Analog to Digital Converter -------------------------*/
/**
    @addtogroup EADC Enhanced Analog to Digital Converter(EADC)
    Memory Mapped Structure for EADC Controller
@{ */

typedef struct {


    /**
     * AD0DAT0
     * ===================================================================================================
     * Offset: 0x00  A/D Data Register 0 for SAMPLE00
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:11]  |RESULT    |A/D Conversion Result
     * |        |          |This field contains 12 bits conversion result.
     * |[16]    |OV        |Overrun Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is recent conversion result.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is overwrite.
     * |        |          |If converted data in RESULT (EADC_ADnDATx[11:0]) has not been read before new conversion result is loaded to this register, OV (EADC_ADnDATx[16]) is set to 1.
     * |        |          |It is cleared by hardware after EADC_ADnDATx register is read.
     * |[17]    |VALID     |Valid Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is not valid.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is completed and cleared by hardware after EADC_ADnDATx register is read.
    */
    __I  uint32_t AD0DAT0;

    /**
     * AD0DAT1
     * ===================================================================================================
     * Offset: 0x04  A/D Data Register 1 for SAMPLE01
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:11]  |RESULT    |A/D Conversion Result
     * |        |          |This field contains 12 bits conversion result.
     * |[16]    |OV        |Overrun Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is recent conversion result.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is overwrite.
     * |        |          |If converted data in RESULT (EADC_ADnDATx[11:0]) has not been read before new conversion result is loaded to this register, OV (EADC_ADnDATx[16]) is set to 1.
     * |        |          |It is cleared by hardware after EADC_ADnDATx register is read.
     * |[17]    |VALID     |Valid Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is not valid.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is completed and cleared by hardware after EADC_ADnDATx register is read.
    */
    __I  uint32_t AD0DAT1;

    /**
     * AD0DAT2
     * ===================================================================================================
     * Offset: 0x08  A/D Data Register 2 for SAMPLE02
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:11]  |RESULT    |A/D Conversion Result
     * |        |          |This field contains 12 bits conversion result.
     * |[16]    |OV        |Overrun Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is recent conversion result.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is overwrite.
     * |        |          |If converted data in RESULT (EADC_ADnDATx[11:0]) has not been read before new conversion result is loaded to this register, OV (EADC_ADnDATx[16]) is set to 1.
     * |        |          |It is cleared by hardware after EADC_ADnDATx register is read.
     * |[17]    |VALID     |Valid Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is not valid.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is completed and cleared by hardware after EADC_ADnDATx register is read.
    */
    __I  uint32_t AD0DAT2;

    /**
     * AD0DAT3
     * ===================================================================================================
     * Offset: 0x0C  A/D Data Register 3 for SAMPLE03
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:11]  |RESULT    |A/D Conversion Result
     * |        |          |This field contains 12 bits conversion result.
     * |[16]    |OV        |Overrun Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is recent conversion result.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is overwrite.
     * |        |          |If converted data in RESULT (EADC_ADnDATx[11:0]) has not been read before new conversion result is loaded to this register, OV (EADC_ADnDATx[16]) is set to 1.
     * |        |          |It is cleared by hardware after EADC_ADnDATx register is read.
     * |[17]    |VALID     |Valid Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is not valid.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is completed and cleared by hardware after EADC_ADnDATx register is read.
    */
    __I  uint32_t AD0DAT3;

    /**
     * AD0DAT4
     * ===================================================================================================
     * Offset: 0x10  A/D Data Register 4 for SAMPLE04
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:11]  |RESULT    |A/D Conversion Result
     * |        |          |This field contains 12 bits conversion result.
     * |[16]    |OV        |Overrun Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is recent conversion result.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is overwrite.
     * |        |          |If converted data in RESULT (EADC_ADnDATx[11:0]) has not been read before new conversion result is loaded to this register, OV (EADC_ADnDATx[16]) is set to 1.
     * |        |          |It is cleared by hardware after EADC_ADnDATx register is read.
     * |[17]    |VALID     |Valid Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is not valid.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is completed and cleared by hardware after EADC_ADnDATx register is read.
    */
    __I  uint32_t AD0DAT4;

    /**
     * AD0DAT5
     * ===================================================================================================
     * Offset: 0x14  A/D Data Register 5 for SAMPLE05
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:11]  |RESULT    |A/D Conversion Result
     * |        |          |This field contains 12 bits conversion result.
     * |[16]    |OV        |Overrun Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is recent conversion result.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is overwrite.
     * |        |          |If converted data in RESULT (EADC_ADnDATx[11:0]) has not been read before new conversion result is loaded to this register, OV (EADC_ADnDATx[16]) is set to 1.
     * |        |          |It is cleared by hardware after EADC_ADnDATx register is read.
     * |[17]    |VALID     |Valid Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is not valid.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is completed and cleared by hardware after EADC_ADnDATx register is read.
    */
    __I  uint32_t AD0DAT5;

    /**
     * AD0DAT6
     * ===================================================================================================
     * Offset: 0x18  A/D Data Register 6 for SAMPLE06
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:11]  |RESULT    |A/D Conversion Result
     * |        |          |This field contains 12 bits conversion result.
     * |[16]    |OV        |Overrun Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is recent conversion result.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is overwrite.
     * |        |          |If converted data in RESULT (EADC_ADnDATx[11:0]) has not been read before new conversion result is loaded to this register, OV (EADC_ADnDATx[16]) is set to 1.
     * |        |          |It is cleared by hardware after EADC_ADnDATx register is read.
     * |[17]    |VALID     |Valid Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is not valid.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is completed and cleared by hardware after EADC_ADnDATx register is read.
    */
    __I  uint32_t AD0DAT6;

    /**
     * AD0DAT7
     * ===================================================================================================
     * Offset: 0x1C  A/D Data Register 7 for SAMPLE07
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:11]  |RESULT    |A/D Conversion Result
     * |        |          |This field contains 12 bits conversion result.
     * |[16]    |OV        |Overrun Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is recent conversion result.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is overwrite.
     * |        |          |If converted data in RESULT (EADC_ADnDATx[11:0]) has not been read before new conversion result is loaded to this register, OV (EADC_ADnDATx[16]) is set to 1.
     * |        |          |It is cleared by hardware after EADC_ADnDATx register is read.
     * |[17]    |VALID     |Valid Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is not valid.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is completed and cleared by hardware after EADC_ADnDATx register is read.
    */
    __I  uint32_t AD0DAT7;

    /**
     * AD1DAT0
     * ===================================================================================================
     * Offset: 0x20  A/D Data Register 8 for SAMPLE10
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:11]  |RESULT    |A/D Conversion Result
     * |        |          |This field contains 12 bits conversion result.
     * |[16]    |OV        |Overrun Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is recent conversion result.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is overwrite.
     * |        |          |If converted data in RESULT (EADC_ADnDATx[11:0]) has not been read before new conversion result is loaded to this register, OV (EADC_ADnDATx[16]) is set to 1.
     * |        |          |It is cleared by hardware after EADC_ADnDATx register is read.
     * |[17]    |VALID     |Valid Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is not valid.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is completed and cleared by hardware after EADC_ADnDATx register is read.
    */
    __I  uint32_t AD1DAT0;

    /**
     * AD1DAT1
     * ===================================================================================================
     * Offset: 0x24  A/D Data Register 9 for SAMPLE11
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:11]  |RESULT    |A/D Conversion Result
     * |        |          |This field contains 12 bits conversion result.
     * |[16]    |OV        |Overrun Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is recent conversion result.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is overwrite.
     * |        |          |If converted data in RESULT (EADC_ADnDATx[11:0]) has not been read before new conversion result is loaded to this register, OV (EADC_ADnDATx[16]) is set to 1.
     * |        |          |It is cleared by hardware after EADC_ADnDATx register is read.
     * |[17]    |VALID     |Valid Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is not valid.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is completed and cleared by hardware after EADC_ADnDATx register is read.
    */
    __I  uint32_t AD1DAT1;

    /**
     * AD1DAT2
     * ===================================================================================================
     * Offset: 0x28  A/D Data Register 10 for SAMPLE12
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:11]  |RESULT    |A/D Conversion Result
     * |        |          |This field contains 12 bits conversion result.
     * |[16]    |OV        |Overrun Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is recent conversion result.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is overwrite.
     * |        |          |If converted data in RESULT (EADC_ADnDATx[11:0]) has not been read before new conversion result is loaded to this register, OV (EADC_ADnDATx[16]) is set to 1.
     * |        |          |It is cleared by hardware after EADC_ADnDATx register is read.
     * |[17]    |VALID     |Valid Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is not valid.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is completed and cleared by hardware after EADC_ADnDATx register is read.
    */
    __I  uint32_t AD1DAT2;

    /**
     * AD1DAT3
     * ===================================================================================================
     * Offset: 0x2C  A/D Data Register 11 for SAMPLE13
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:11]  |RESULT    |A/D Conversion Result
     * |        |          |This field contains 12 bits conversion result.
     * |[16]    |OV        |Overrun Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is recent conversion result.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is overwrite.
     * |        |          |If converted data in RESULT (EADC_ADnDATx[11:0]) has not been read before new conversion result is loaded to this register, OV (EADC_ADnDATx[16]) is set to 1.
     * |        |          |It is cleared by hardware after EADC_ADnDATx register is read.
     * |[17]    |VALID     |Valid Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is not valid.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is completed and cleared by hardware after EADC_ADnDATx register is read.
    */
    __I  uint32_t AD1DAT3;

    /**
     * AD1DAT4
     * ===================================================================================================
     * Offset: 0x30  A/D Data Register 12 for SAMPLE14
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:11]  |RESULT    |A/D Conversion Result
     * |        |          |This field contains 12 bits conversion result.
     * |[16]    |OV        |Overrun Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is recent conversion result.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is overwrite.
     * |        |          |If converted data in RESULT (EADC_ADnDATx[11:0]) has not been read before new conversion result is loaded to this register, OV (EADC_ADnDATx[16]) is set to 1.
     * |        |          |It is cleared by hardware after EADC_ADnDATx register is read.
     * |[17]    |VALID     |Valid Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is not valid.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is completed and cleared by hardware after EADC_ADnDATx register is read.
    */
    __I  uint32_t AD1DAT4;

