MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC472JG8AE/mcu.h
    /**
     * STATUS1
     * ===================================================================================================
     * Offset: 0xB4  A/D Status Register 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ADIF0     |A/D ADINT0 Interrupt Flag
     * |        |          |0 = No ADINT0 interrupt pulse received.
     * |        |          |1 = ADINT0 interrupt pulse has been received.
     * |        |          |Note1: This bit is cleared by writing 1 to it.
     * |        |          |Note2:This bit indicates whether an A/D conversion of specific SAMPLE has been completed
     * |[1]     |ADIF1     |A/D ADINT1 Interrupt Flag
     * |        |          |0 = No ADINT1 interrupt pulse received.
     * |        |          |1 = ADINT1 interrupt pulse has been received.
     * |        |          |Note1: This bit is cleared by writing 1 to it.
     * |        |          |Note2:This bit indicates whether an A/D conversion of specific SAMPLE has been completed
     * |[2]     |ADIF2     |A/D ADINT2 Interrupt Flag
     * |        |          |0 = no ADINT2 interrupt pulse received.
     * |        |          |1 = ADINT2 interrupt pulse has been received.
     * |        |          |Note1: This bit is cleared by writing 1 to it.
     * |        |          |Note2:This bit indicates whether an A/D conversion of specific SAMPLE has been completed
     * |[3]     |ADIF3     |A/D ADINT3 Interrupt Flag
     * |        |          |0 = No ADINT3 interrupt pulse received.
     * |        |          |1 = ADINT3 interrupt pulse has been received.
     * |        |          |Note1: This bit is cleared by writing 1 to it.
     * |        |          |Note2:This bit indicates whether an A/D conversion of specific SAMPLE has been completed
     * |[4]     |ADCMPO0   |ADC Compare 0 Output Status
     * |        |          |The 12 bits compare0 data CMPDAT EADC_CMP0 [27:16]) is used to compare with conversion result of specified SAMPLE.
     * |        |          |Software can use it to monitor the external analog input pin voltage status.
     * |        |          |0 = Conversion result in ADDR less than CMPDAT (EADC_CMP0 [27:16]) setting.
     * |        |          |1 = Conversion result in ADDR great than or equal CMPDAT (EADC_CMP0 [27:16]) setting.
     * |[5]     |ADCMPO1   |ADC Compare 1 Output Status
     * |        |          |The 12 bits compare1 data CMPDAT (EADC_CMP1 [27:16]) is used to compare with conversion result of specified SAMPLE.
     * |        |          |Software can use it to monitor the external analog input pin voltage status.
     * |        |          |0 = Conversion result in ADDR less than CMPDAT EADC_CMP1 [27:16]) setting.
     * |        |          |1 = Conversion result in ADDR great than or equal CMPDAT (EADC_CMP1 [27:16]) setting.
     * |[6]     |ADCMPF0   |ADC Compare 0 Flag
     * |        |          |When the specific SAMPLE A/D conversion result meets setting condition in EADC_CMP0 then this bit is set to 1.
     * |        |          |0 = Conversion result in ADDR does not meet EADC_CMP0 setting.
     * |        |          |1 = Conversion result in ADDR meets EADC_CMP0 setting.
     * |        |          |Note: This bit is cleared by writing 1 to it.
     * |[7]     |ADCMPF1   |ADC Compare 1 Flag
     * |        |          |When the specific SAMPLE A/D conversion result meets setting condition in EADC_CMP1 then this bit is set to 1.
     * |        |          |0 = Conversion result in ADDR does not meet EADC_CMP1 setting.
     * |        |          |1 = Conversion result in ADDR meets EADC_CMP1 setting.
     * |        |          |Note: This bit is cleared by writing 1 to it.
     * |[8]     |BUSY0     |Busy/Idle (Read Only)
     * |        |          |0 = A/D converter 0 (ADC0) is in idle state.
     * |        |          |1 = A/D converter 0 (ADC0) is doing conversion.
     * |[12:15] |CHANNEL0  |Current Conversion Channel (Read Only)
     * |        |          |This filed reflects ADC0 current conversion channel when BUSY0 (EADC_STATUS1 [8]) = 1.
     * |        |          |When BUSY0 (EADC_STATUS1 [8]) = 0, it shows the last converted channel.
     * |        |          |0000 = ADC0_CH0.
     * |        |          |0001 = ADC0_CH1.
     * |        |          |0010 = ADC0_CH2.
     * |        |          |0011 = ADC0_CH3.
     * |        |          |0100 = ADC0_CH4.
     * |        |          |0100 = ADC0_CH5.
     * |        |          |0110 = ADC0_CH6.
     * |        |          |0111 = ADC0_CH7.
     * |        |          |1000 = VBG.
     * |        |          |1001 = VTEMP.
     * |        |          |1010 = AVSS.
     * |        |          |1011 = OPA0_O.
     * |        |          |Other = reserved.
     * |[16]    |BUSY1     |Busy/Idle
     * |        |          |0 = A/D converter 1 (ADC1) is in idle state.
     * |        |          |1 = A/D converter 1 (ADC1) is doing conversion.
     * |[20:23] |CHANNEL1  |Current Conversion Channel (Read Only)
     * |        |          |This filed reflects ADC1 current conversion channel when BUSY1 (EADC_STATUS1 [16]) = 1.
     * |        |          |When BUSY1 (EADC_STATUS1 [16]) = 0, it shows the last converted channel.
     * |        |          |0000 = ADC1_CH0.
     * |        |          |0001 = ADC1_CH1.
     * |        |          |0010 = ADC1_CH2.
     * |        |          |0011 = ADC1_CH3.
     * |        |          |0100 = ADC1_CH4.
     * |        |          |0101 = ADC1_CH5.
     * |        |          |0110 = ADC1_CH6.
     * |        |          |0111 = ADC1_CH7.
     * |        |          |1000 = OPA1_O.
     * |        |          |Other = reversed.
     * |[24]    |ADOVIF    |All A/D Interrupt Flag Overrun Bits Check
     * |        |          |0 = None of ADINT interrupt flag ADFOVx (ADIFOVR [15:0]) is overwritten to 1.
     * |        |          |1 = Any one of ADINT interrupt flag ADFOVx (ADIFOVR [15:0]) is overwritten to 1.
     * |        |          |Note: This bit will keep 1 when any ADFOVx (ADIFOVR [15:0]) Flag is equal to 1.
     * |[25]    |STOVF     |For All A/D SAMPLE Start Of Conversion Overrun Flags Check
     * |        |          |0 = None of SAMPLE event overrun flag SPOVFx (ADSPOVFR [15:0]) is set to 1.
     * |        |          |1 = Any one of SAMPLE event overrun flag SPOVFx (ADSPOVFR [15:0]) is set to 1.
     * |        |          |Note: This bit will keep 1 when any SPOVFx (ADSPOVFR [15:0]) Flag is equal to 1.
     * |[26]    |AVALID    |For All SAMPLE A/D Result Data Register ADDR Data Valid Flag Check
     * |        |          |0 = None of SAMPLE data register valid flag VALIDx (EADC_ADnDATx[17]) is set to 1.
     * |        |          |1 = Any one of SAMPLE data register valid flag VALIDx (EADC_ADnDATx[17]) is set to 1.
     * |        |          |Note: This bit will keep 1 when any VALIDx (EADC_ADnDATx[17]) Flag is equal to 1.
     * |[27]    |AOV       |For All SAMPLE A/D Result Data Register Overrun Flags Check
     * |        |          |0 = None of SAMPLE data register overrun flag OVx (EADC_ADnDATx[16]) is set to 1.
     * |        |          |1 = Any one of SAMPLE data register overrun flag OVx (EADC_ADnDATx[16]) is set to 1.
     * |        |          |Note: This bit will keep 1 when any OVx (EADC_ADnDATx[16]) Flag is equal to 1.
    */
    __IO uint32_t STATUS1;

    /**
     * EXTSMPT
     * ===================================================================================================
     * Offset: 0xB8  A/D Timing Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |EXTSMPT0  |ADC0 Extend Sampling Time
     * |        |          |When A/D converting at high conversion rate, the sampling time of analog input voltage may not enough if input channel loading is heavy, SW can extend A/D sampling time after trigger source is coming to get enough sampling time.
     * |        |          |The range of start delay time is from 0~255 ADC clock.
     * |[16:23] |EXTSMPT1  |ADC1 Extend Sampling Time
     * |        |          |When A/D converting at high conversion rate, the sampling time of analog input voltage may not enough if input channel loading is heavy, SW can extend A/D sampling time after trigger source is coming to get enough sampling time.
     * |        |          |The range of start delay time is from 0~255 ADC clock.
    */
    __IO uint32_t EXTSMPT;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE2[17];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * AD0DDAT0
     * ===================================================================================================
     * Offset: 0x100  A/D double Data Register 0 for SAMPLE00
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:11]  |RESULT    |A/D Conversion Result
     * |        |          |This field contains 12 bits conversion result.
     * |[16]    |VALID     |Valid Flag
     * |        |          |0 = Double buffer data in RESULT (EADC_ADnDATx[11:0]) bits is not valid.
     * |        |          |1 = Double buffer data in RESULT (EADC_ADnDATx[11:0]) bits is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is completed and cleared by hardware after EADC_ADnDATx register is read.
    */
    __I  uint32_t AD0DDAT0;

    /**
     * AD0DDAT1
     * ===================================================================================================
     * Offset: 0x104  A/D double Data Register 1 for SAMPLE01
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:11]  |RESULT    |A/D Conversion Result
     * |        |          |This field contains 12 bits conversion result.
     * |[16]    |VALID     |Valid Flag
     * |        |          |0 = Double buffer data in RESULT (EADC_ADnDATx[11:0]) bits is not valid.
     * |        |          |1 = Double buffer data in RESULT (EADC_ADnDATx[11:0]) bits is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is completed and cleared by hardware after EADC_ADnDATx register is read.
    */
    __I  uint32_t AD0DDAT1;

    /**
     * AD0DDAT2
     * ===================================================================================================
     * Offset: 0x108  A/D double Data Register 2 for SAMPLE02
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:11]  |RESULT    |A/D Conversion Result
     * |        |          |This field contains 12 bits conversion result.
     * |[16]    |VALID     |Valid Flag
     * |        |          |0 = Double buffer data in RESULT (EADC_ADnDATx[11:0]) bits is not valid.
     * |        |          |1 = Double buffer data in RESULT (EADC_ADnDATx[11:0]) bits is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is completed and cleared by hardware after EADC_ADnDATx register is read.
    */
    __I  uint32_t AD0DDAT2;

    /**
     * AD0DDAT3
     * ===================================================================================================
     * Offset: 0x10C  A/D double Data Register 3 for SAMPLE03
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:11]  |RESULT    |A/D Conversion Result
     * |        |          |This field contains 12 bits conversion result.
     * |[16]    |VALID     |Valid Flag
     * |        |          |0 = Double buffer data in RESULT (EADC_ADnDATx[11:0]) bits is not valid.
     * |        |          |1 = Double buffer data in RESULT (EADC_ADnDATx[11:0]) bits is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is completed and cleared by hardware after EADC_ADnDATx register is read.
    */
    __I  uint32_t AD0DDAT3;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE3[4];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * AD1DDAT0
     * ===================================================================================================
     * Offset: 0x120  A/D double Data Register 0 for SAMPLE10
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:11]  |RESULT    |A/D Conversion Result
     * |        |          |This field contains 12 bits conversion result.
     * |[16]    |VALID     |Valid Flag
     * |        |          |0 = Double buffer data in RESULT (EADC_ADnDATx[11:0]) bits is not valid.
     * |        |          |1 = Double buffer data in RESULT (EADC_ADnDATx[11:0]) bits is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is completed and cleared by hardware after EADC_ADnDATx register is read.
    */
    __I  uint32_t AD1DDAT0;

    /**
     * AD1DDAT1
     * ===================================================================================================
     * Offset: 0x124  A/D double Data Register 1 for SAMPLE11
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:11]  |RESULT    |A/D Conversion Result
     * |        |          |This field contains 12 bits conversion result.
     * |[16]    |VALID     |Valid Flag
     * |        |          |0 = Double buffer data in RESULT (EADC_ADnDATx[11:0]) bits is not valid.
     * |        |          |1 = Double buffer data in RESULT (EADC_ADnDATx[11:0]) bits is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is completed and cleared by hardware after EADC_ADnDATx register is read.
    */
    __I  uint32_t AD1DDAT1;

    /**
     * AD1DDAT2
     * ===================================================================================================
     * Offset: 0x128  A/D double Data Register 2 for SAMPLE12
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:11]  |RESULT    |A/D Conversion Result
     * |        |          |This field contains 12 bits conversion result.
     * |[16]    |VALID     |Valid Flag
     * |        |          |0 = Double buffer data in RESULT (EADC_ADnDATx[11:0]) bits is not valid.
     * |        |          |1 = Double buffer data in RESULT (EADC_ADnDATx[11:0]) bits is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is completed and cleared by hardware after EADC_ADnDATx register is read.
    */
    __I  uint32_t AD1DDAT2;

    /**
     * AD1DDAT3
     * ===================================================================================================
     * Offset: 0x12C  A/D double Data Register 3 for SAMPLE13
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:11]  |RESULT    |A/D Conversion Result
     * |        |          |This field contains 12 bits conversion result.
     * |[16]    |VALID     |Valid Flag
     * |        |          |0 = Double buffer data in RESULT (EADC_ADnDATx[11:0]) bits is not valid.
     * |        |          |1 = Double buffer data in RESULT (EADC_ADnDATx[11:0]) bits is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is completed and cleared by hardware after EADC_ADnDATx register is read.
    */
    __I  uint32_t AD1DDAT3;

    /**
     * DBMEN
     * ===================================================================================================
     * Offset: 0x130  A/D Double Buffer Mode select
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |AD0DBM0   |Double Buffer Mode For SAMPLE00
     * |        |          |0 = SAMPLE00 has one sample result register. (default).
     * |        |          |1 =SAMPLE00 has two sample result registers.
     * |[1]     |AD0DBM1   |Double Buffer Mode For SAMPLE01
     * |        |          |0 = SAMPLE01 has one sample result register. (default).
     * |        |          |1 = SAMPLE01 has two sample result registers.
     * |[2]     |AD0DBM2   |Double Buffer Mode For SAMPLE02
     * |        |          |0 = SAMPLE02 has one sample result register. (default).
     * |        |          |1 =SAMPLE02 has two sample result registers.
     * |[3]     |AD0DBM3   |Double Buffer Mode For SAMPLE03
     * |        |          |0 = SAMPLE03 has one sample result register. (default).
     * |        |          |1 =SAMPLE03 has two sample result registers.
     * |[8]     |AD1DBM0   |Double Buffer Mode For SAMPLE10
     * |        |          |0 = SAMPLE10 has one sample result register. (default)
     * |        |          |1 =SAMPLE10 has two sample result registers.
     * |[9]     |AD1DBM1   |Double Buffer Mode For SAMPLE11
     * |        |          |0 = SAMPLE11 has one sample result register. (default).
     * |        |          |1 =SAMPLE11 has two sample result registers.
     * |[10]    |AD1DBM2   |Double Buffer Mode For SAMPLE12
     * |        |          |0 = SAMPLE12 has one sample result register. (default).
     * |        |          |1 =SAMPLE12 has two sample result registers.
     * |[11]    |AD1DBM3   |Double Buffer Mode For SAMPLE13
     * |        |          |0 = SAMPLE13 has one sample result register. (default)
     * |        |          |1 =SAMPLE13 has two sample result registers.
    */
    __IO uint32_t DBMEN;

    /**
     * INTSRC0
     * ===================================================================================================
     * Offset: 0x134  A/D Interrupt 0 Source Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |AD0SPIE0  |SAMPLE00 Interrupt Mask Enable Control
     * |        |          |0 = SAMPLE00 interrupt mask Disabled.
     * |        |          |1 = SAMPLE00 interrupt mask Enabled.
     * |[1]     |AD0SPIE1  |SAMPLE01 Interrupt Mask Enable Control
     * |        |          |0 = SAMPLE01 interrupt mask Disabled.
     * |        |          |1 = SAMPLE01 interrupt mask Enabled.
     * |[2]     |AD0SPIE2  |SAMPLE02 Interrupt Mask Enable Control
     * |        |          |0 = SAMPLE02 interrupt mask Disabled.
     * |        |          |1 = SAMPLE02 interrupt mask Enabled.
     * |[3]     |AD0SPIE3  |SAMPLE03 Interrupt Mask Enable Control
     * |        |          |0 = SAMPLE03 interrupt mask Disabled.
     * |        |          |1 = SAMPLE03 interrupt mask Enabled.
     * |[4]     |AD0SPIE4  |SAMPLE04 Interrupt Mask Enable Control
     * |        |          |0 = SAMPLE04 interrupt mask Disabled.
     * |        |          |1 = SAMPLE04 interrupt mask Enabled.
     * |[5]     |AD0SPIE5  |SAMPLE05 Interrupt Mask Enable Control
     * |        |          |0 = SAMPLE05 interrupt mask Disabled.
     * |        |          |1 = SAMPLE05 interrupt mask Enabled.
     * |[6]     |AD0SPIE6  |SAMPLE06 Interrupt Mask Enable Control
     * |        |          |0 = SAMPLE06 interrupt mask Disabled.
     * |        |          |1 = SAMPLE06 interrupt mask Enabled.
     * |[7]     |AD0SPIE7  |SAMPLE07 Interrupt Mask Enable Control
     * |        |          |0 = SAMPLE07 interrupt mask Disabled.
     * |        |          |1 = SAMPLE07 interrupt mask Enabled.
     * |[8]     |AD1SPIE0  |SAMPLE10 Interrupt Mask Enable Control
     * |        |          |0 = SAMPLE10 interrupt mask Disabled.
     * |        |          |1 = SAMPLE10 interrupt mask Enabled.
     * |[9]     |AD1SPIE1  |SAMPLE11 Interrupt Mask Enable Control
     * |        |          |0 = SAMPLE11 interrupt mask Disabled.
     * |        |          |1 = SAMPLE11 interrupt mask Enabled.
     * |[10]    |AD1SPIE2  |SAMPLE12 Interrupt Mask Enable Control
     * |        |          |0 = SAMPLE12 interrupt mask Disabled.
     * |        |          |1 = SAMPLE12 interrupt mask Enabled.
     * |[11]    |AD1SPIE3  |SAMPLE13 Interrupt Mask Enable Control
     * |        |          |0 = SAMPLE13 interrupt mask Disabled.
     * |        |          |1 = SAMPLE13 interrupt mask Enabled.
     * |[12]    |AD1SPIE4  |SAMPLE14 Interrupt Mask Enable Control
     * |        |          |0 = SAMPLE14 interrupt mask Disabled.
     * |        |          |1 = SAMPLE14 interrupt mask Enabled.
     * |[13]    |AD1SPIE5  |SAMPLE15 Interrupt Mask Enable Control
     * |        |          |0 = SAMPLE15 interrupt mask Disabled.
     * |        |          |1 = SAMPLE15 interrupt mask Enabled.
     * |[14]    |AD1SPIE6  |SAMPLE16 Interrupt Mask Enable Control
     * |        |          |0 = SAMPLE16 interrupt mask Disabled.
     * |        |          |1 = SAMPLE16 interrupt mask Enabled.
     * |[15]    |AD1SPIE7  |SAMPLE17 Interrupt Mask Enable Control
     * |        |          |0 = SAMPLE17 interrupt mask Disabled.
     * |        |          |1 = SAMPLE17 interrupt mask Enabled.
    */
    __IO uint32_t INTSRC[4];

