MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC472JG8AE/mcu.h
#define EADC_AD1SPCTL2_TRGSEL_Pos        (4)                                               /*!< EADC_T::AD1SPCTL2: TRGSEL Position        */
#define EADC_AD1SPCTL2_TRGSEL_Msk        (0xful << EADC_AD1SPCTL2_TRGSEL_Pos)              /*!< EADC_T::AD1SPCTL2: TRGSEL Mask            */

#define EADC_AD1SPCTL2_TRGDLYCNT_Pos     (8)                                               /*!< EADC_T::AD1SPCTL2: TRGDLYCNT Position     */
#define EADC_AD1SPCTL2_TRGDLYCNT_Msk     (0xfful << EADC_AD1SPCTL2_TRGDLYCNT_Pos)          /*!< EADC_T::AD1SPCTL2: TRGDLYCNT Mask         */

#define EADC_AD1SPCTL2_TRGDLYDIV_Pos     (16)                                              /*!< EADC_T::AD1SPCTL2: TRGDLYDIV Position     */
#define EADC_AD1SPCTL2_TRGDLYDIV_Msk     (0x3ul << EADC_AD1SPCTL2_TRGDLYDIV_Pos)           /*!< EADC_T::AD1SPCTL2: TRGDLYDIV Mask         */

#define EADC_AD1SPCTL2_EXTREN_Pos        (20)                                              /*!< EADC_T::AD1SPCTL2: EXTREN Position        */
#define EADC_AD1SPCTL2_EXTREN_Msk        (0x1ul << EADC_AD1SPCTL2_EXTREN_Pos)              /*!< EADC_T::AD1SPCTL2: EXTREN Mask            */

#define EADC_AD1SPCTL2_EXTFEN_Pos        (21)                                              /*!< EADC_T::AD1SPCTL2: EXTFEN Position        */
#define EADC_AD1SPCTL2_EXTFEN_Msk        (0x1ul << EADC_AD1SPCTL2_EXTFEN_Pos)              /*!< EADC_T::AD1SPCTL2: EXTFEN Mask            */

#define EADC_AD1SPCTL3_CHSEL_Pos         (0)                                               /*!< EADC_T::AD1SPCTL3: CHSEL Position         */
#define EADC_AD1SPCTL3_CHSEL_Msk         (0xful << EADC_AD1SPCTL3_CHSEL_Pos)               /*!< EADC_T::AD1SPCTL3: CHSEL Mask             */

#define EADC_AD1SPCTL3_TRGSEL_Pos        (4)                                               /*!< EADC_T::AD1SPCTL3: TRGSEL Position        */
#define EADC_AD1SPCTL3_TRGSEL_Msk        (0xful << EADC_AD1SPCTL3_TRGSEL_Pos)              /*!< EADC_T::AD1SPCTL3: TRGSEL Mask            */

#define EADC_AD1SPCTL3_TRGDLYCNT_Pos     (8)                                               /*!< EADC_T::AD1SPCTL3: TRGDLYCNT Position     */
#define EADC_AD1SPCTL3_TRGDLYCNT_Msk     (0xfful << EADC_AD1SPCTL3_TRGDLYCNT_Pos)          /*!< EADC_T::AD1SPCTL3: TRGDLYCNT Mask         */

#define EADC_AD1SPCTL3_TRGDLYDIV_Pos     (16)                                              /*!< EADC_T::AD1SPCTL3: TRGDLYDIV Position     */
#define EADC_AD1SPCTL3_TRGDLYDIV_Msk     (0x3ul << EADC_AD1SPCTL3_TRGDLYDIV_Pos)           /*!< EADC_T::AD1SPCTL3: TRGDLYDIV Mask         */

#define EADC_AD1SPCTL3_EXTREN_Pos        (20)                                              /*!< EADC_T::AD1SPCTL3: EXTREN Position        */
#define EADC_AD1SPCTL3_EXTREN_Msk        (0x1ul << EADC_AD1SPCTL3_EXTREN_Pos)              /*!< EADC_T::AD1SPCTL3: EXTREN Mask            */

#define EADC_AD1SPCTL3_EXTFEN_Pos        (21)                                              /*!< EADC_T::AD1SPCTL3: EXTFEN Position        */
#define EADC_AD1SPCTL3_EXTFEN_Msk        (0x1ul << EADC_AD1SPCTL3_EXTFEN_Pos)              /*!< EADC_T::AD1SPCTL3: EXTFEN Mask            */

#define EADC_AD1SPCTL4_CHSEL_Pos         (0)                                               /*!< EADC_T::AD1SPCTL4: CHSEL Position         */
#define EADC_AD1SPCTL4_CHSEL_Msk         (0xful << EADC_AD1SPCTL4_CHSEL_Pos)               /*!< EADC_T::AD1SPCTL4: CHSEL Mask             */

#define EADC_AD1SPCTL4_TRGSEL_Pos        (4)                                               /*!< EADC_T::AD1SPCTL4: TRGSEL Position        */
#define EADC_AD1SPCTL4_TRGSEL_Msk        (0x7ul << EADC_AD1SPCTL4_TRGSEL_Pos)              /*!< EADC_T::AD1SPCTL4: TRGSEL Mask            */

#define EADC_AD1SPCTL4_EXTREN_Pos        (20)                                              /*!< EADC_T::AD1SPCTL4: EXTREN Position        */
#define EADC_AD1SPCTL4_EXTREN_Msk        (0x1ul << EADC_AD1SPCTL4_EXTREN_Pos)              /*!< EADC_T::AD1SPCTL4: EXTREN Mask            */

#define EADC_AD1SPCTL4_EXTFEN_Pos        (21)                                              /*!< EADC_T::AD1SPCTL4: EXTFEN Position        */
#define EADC_AD1SPCTL4_EXTFEN_Msk        (0x1ul << EADC_AD1SPCTL4_EXTFEN_Pos)              /*!< EADC_T::AD1SPCTL4: EXTFEN Mask            */

#define EADC_AD1SPCTL5_CHSEL_Pos         (0)                                               /*!< EADC_T::AD1SPCTL5: CHSEL Position         */
#define EADC_AD1SPCTL5_CHSEL_Msk         (0xful << EADC_AD1SPCTL5_CHSEL_Pos)               /*!< EADC_T::AD1SPCTL5: CHSEL Mask             */

#define EADC_AD1SPCTL5_TRGSEL_Pos        (4)                                               /*!< EADC_T::AD1SPCTL5: TRGSEL Position        */
#define EADC_AD1SPCTL5_TRGSEL_Msk        (0x7ul << EADC_AD1SPCTL5_TRGSEL_Pos)              /*!< EADC_T::AD1SPCTL5: TRGSEL Mask            */

#define EADC_AD1SPCTL5_EXTREN_Pos        (20)                                              /*!< EADC_T::AD1SPCTL5: EXTREN Position        */
#define EADC_AD1SPCTL5_EXTREN_Msk        (0x1ul << EADC_AD1SPCTL5_EXTREN_Pos)              /*!< EADC_T::AD1SPCTL5: EXTREN Mask            */

#define EADC_AD1SPCTL5_EXTFEN_Pos        (21)                                              /*!< EADC_T::AD1SPCTL5: EXTFEN Position        */
#define EADC_AD1SPCTL5_EXTFEN_Msk        (0x1ul << EADC_AD1SPCTL5_EXTFEN_Pos)              /*!< EADC_T::AD1SPCTL5: EXTFEN Mask            */

#define EADC_AD1SPCTL6_CHSEL_Pos         (0)                                               /*!< EADC_T::AD1SPCTL6: CHSEL Position         */
#define EADC_AD1SPCTL6_CHSEL_Msk         (0xful << EADC_AD1SPCTL6_CHSEL_Pos)               /*!< EADC_T::AD1SPCTL6: CHSEL Mask             */

#define EADC_AD1SPCTL6_TRGSEL_Pos        (4)                                               /*!< EADC_T::AD1SPCTL6: TRGSEL Position        */
#define EADC_AD1SPCTL6_TRGSEL_Msk        (0x7ul << EADC_AD1SPCTL6_TRGSEL_Pos)              /*!< EADC_T::AD1SPCTL6: TRGSEL Mask            */

#define EADC_AD1SPCTL6_EXTREN_Pos        (20)                                              /*!< EADC_T::AD1SPCTL6: EXTREN Position        */
#define EADC_AD1SPCTL6_EXTREN_Msk        (0x1ul << EADC_AD1SPCTL6_EXTREN_Pos)              /*!< EADC_T::AD1SPCTL6: EXTREN Mask            */

#define EADC_AD1SPCTL6_EXTFEN_Pos        (21)                                              /*!< EADC_T::AD1SPCTL6: EXTFEN Position        */
#define EADC_AD1SPCTL6_EXTFEN_Msk        (0x1ul << EADC_AD1SPCTL6_EXTFEN_Pos)              /*!< EADC_T::AD1SPCTL6: EXTFEN Mask            */

