MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC472JG8AE/mcu.h
#define EADC_AD1TRGEN3_EPWM02REN_Pos     (4)                                               /*!< EADC_T::AD1TRGEN3: EPWM02REN Position     */
#define EADC_AD1TRGEN3_EPWM02REN_Msk     (0x1ul << EADC_AD1TRGEN3_EPWM02REN_Pos)           /*!< EADC_T::AD1TRGEN3: EPWM02REN Mask         */

#define EADC_AD1TRGEN3_EPWM02FEN_Pos     (5)                                               /*!< EADC_T::AD1TRGEN3: EPWM02FEN Position     */
#define EADC_AD1TRGEN3_EPWM02FEN_Msk     (0x1ul << EADC_AD1TRGEN3_EPWM02FEN_Pos)           /*!< EADC_T::AD1TRGEN3: EPWM02FEN Mask         */

#define EADC_AD1TRGEN3_EPWM02PEN_Pos     (6)                                               /*!< EADC_T::AD1TRGEN3: EPWM02PEN Position     */
#define EADC_AD1TRGEN3_EPWM02PEN_Msk     (0x1ul << EADC_AD1TRGEN3_EPWM02PEN_Pos)           /*!< EADC_T::AD1TRGEN3: EPWM02PEN Mask         */

#define EADC_AD1TRGEN3_EPWM02CEN_Pos     (7)                                               /*!< EADC_T::AD1TRGEN3: EPWM02CEN Position     */
#define EADC_AD1TRGEN3_EPWM02CEN_Msk     (0x1ul << EADC_AD1TRGEN3_EPWM02CEN_Pos)           /*!< EADC_T::AD1TRGEN3: EPWM02CEN Mask         */

#define EADC_AD1TRGEN3_EPWM04REN_Pos     (8)                                               /*!< EADC_T::AD1TRGEN3: EPWM04REN Position     */
#define EADC_AD1TRGEN3_EPWM04REN_Msk     (0x1ul << EADC_AD1TRGEN3_EPWM04REN_Pos)           /*!< EADC_T::AD1TRGEN3: EPWM04REN Mask         */

#define EADC_AD1TRGEN3_EPWM04FEN_Pos     (9)                                               /*!< EADC_T::AD1TRGEN3: EPWM04FEN Position     */
#define EADC_AD1TRGEN3_EPWM04FEN_Msk     (0x1ul << EADC_AD1TRGEN3_EPWM04FEN_Pos)           /*!< EADC_T::AD1TRGEN3: EPWM04FEN Mask         */

#define EADC_AD1TRGEN3_EPWM04PEN_Pos     (10)                                              /*!< EADC_T::AD1TRGEN3: EPWM04PEN Position     */
#define EADC_AD1TRGEN3_EPWM04PEN_Msk     (0x1ul << EADC_AD1TRGEN3_EPWM04PEN_Pos)           /*!< EADC_T::AD1TRGEN3: EPWM04PEN Mask         */

#define EADC_AD1TRGEN3_EPWM04CEN_Pos     (11)                                              /*!< EADC_T::AD1TRGEN3: EPWM04CEN Position     */
#define EADC_AD1TRGEN3_EPWM04CEN_Msk     (0x1ul << EADC_AD1TRGEN3_EPWM04CEN_Pos)           /*!< EADC_T::AD1TRGEN3: EPWM04CEN Mask         */

#define EADC_AD1TRGEN3_EPWM10REN_Pos     (12)                                              /*!< EADC_T::AD1TRGEN3: EPWM10REN Position     */
#define EADC_AD1TRGEN3_EPWM10REN_Msk     (0x1ul << EADC_AD1TRGEN3_EPWM10REN_Pos)           /*!< EADC_T::AD1TRGEN3: EPWM10REN Mask         */

#define EADC_AD1TRGEN3_EPWM10FEN_Pos     (13)                                              /*!< EADC_T::AD1TRGEN3: EPWM10FEN Position     */
#define EADC_AD1TRGEN3_EPWM10FEN_Msk     (0x1ul << EADC_AD1TRGEN3_EPWM10FEN_Pos)           /*!< EADC_T::AD1TRGEN3: EPWM10FEN Mask         */

#define EADC_AD1TRGEN3_EPWM10PEN_Pos     (14)                                              /*!< EADC_T::AD1TRGEN3: EPWM10PEN Position     */
#define EADC_AD1TRGEN3_EPWM10PEN_Msk     (0x1ul << EADC_AD1TRGEN3_EPWM10PEN_Pos)           /*!< EADC_T::AD1TRGEN3: EPWM10PEN Mask         */

#define EADC_AD1TRGEN3_EPWM10CEN_Pos     (15)                                              /*!< EADC_T::AD1TRGEN3: EPWM10CEN Position     */
#define EADC_AD1TRGEN3_EPWM10CEN_Msk     (0x1ul << EADC_AD1TRGEN3_EPWM10CEN_Pos)           /*!< EADC_T::AD1TRGEN3: EPWM10CEN Mask         */

#define EADC_AD1TRGEN3_EPWM12REN_Pos     (16)                                              /*!< EADC_T::AD1TRGEN3: EPWM12REN Position     */
#define EADC_AD1TRGEN3_EPWM12REN_Msk     (0x1ul << EADC_AD1TRGEN3_EPWM12REN_Pos)           /*!< EADC_T::AD1TRGEN3: EPWM12REN Mask         */

#define EADC_AD1TRGEN3_EPWM120FEN_Pos    (17)                                              /*!< EADC_T::AD1TRGEN3: EPWM120FEN Position    */
#define EADC_AD1TRGEN3_EPWM120FEN_Msk    (0x1ul << EADC_AD1TRGEN3_EPWM120FEN_Pos)          /*!< EADC_T::AD1TRGEN3: EPWM120FEN Mask        */

#define EADC_AD1TRGEN3_EPWM12PEN_Pos     (18)                                              /*!< EADC_T::AD1TRGEN3: EPWM12PEN Position     */
#define EADC_AD1TRGEN3_EPWM12PEN_Msk     (0x1ul << EADC_AD1TRGEN3_EPWM12PEN_Pos)           /*!< EADC_T::AD1TRGEN3: EPWM12PEN Mask         */

#define EADC_AD1TRGEN3_EPWM12CEN_Pos     (19)                                              /*!< EADC_T::AD1TRGEN3: EPWM12CEN Position     */
#define EADC_AD1TRGEN3_EPWM12CEN_Msk     (0x1ul << EADC_AD1TRGEN3_EPWM12CEN_Pos)           /*!< EADC_T::AD1TRGEN3: EPWM12CEN Mask         */

#define EADC_AD1TRGEN3_EPWM14REN_Pos     (20)                                              /*!< EADC_T::AD1TRGEN3: EPWM14REN Position     */
#define EADC_AD1TRGEN3_EPWM14REN_Msk     (0x1ul << EADC_AD1TRGEN3_EPWM14REN_Pos)           /*!< EADC_T::AD1TRGEN3: EPWM14REN Mask         */

#define EADC_AD1TRGEN3_EPWM14FEN_Pos     (21)                                              /*!< EADC_T::AD1TRGEN3: EPWM14FEN Position     */
#define EADC_AD1TRGEN3_EPWM14FEN_Msk     (0x1ul << EADC_AD1TRGEN3_EPWM14FEN_Pos)           /*!< EADC_T::AD1TRGEN3: EPWM14FEN Mask         */

#define EADC_AD1TRGEN3_EPWM14PEN_Pos     (22)                                              /*!< EADC_T::AD1TRGEN3: EPWM14PEN Position     */
#define EADC_AD1TRGEN3_EPWM14PEN_Msk     (0x1ul << EADC_AD1TRGEN3_EPWM14PEN_Pos)           /*!< EADC_T::AD1TRGEN3: EPWM14PEN Mask         */

#define EADC_AD1TRGEN3_EPWM14CEN_Pos     (23)                                              /*!< EADC_T::AD1TRGEN3: EPWM14CEN Position     */
#define EADC_AD1TRGEN3_EPWM14CEN_Msk     (0x1ul << EADC_AD1TRGEN3_EPWM14CEN_Pos)           /*!< EADC_T::AD1TRGEN3: EPWM14CEN Mask         */

#define EADC_AD1TRGEN3_PWM00REN_Pos      (24)                                              /*!< EADC_T::AD1TRGEN3: PWM00REN Position      */
#define EADC_AD1TRGEN3_PWM00REN_Msk      (0x1ul << EADC_AD1TRGEN3_PWM00REN_Pos)            /*!< EADC_T::AD1TRGEN3: PWM00REN Mask          */

#define EADC_AD1TRGEN3_PWM00FEN_Pos      (25)                                              /*!< EADC_T::AD1TRGEN3: PWM00FEN Position      */
#define EADC_AD1TRGEN3_PWM00FEN_Msk      (0x1ul << EADC_AD1TRGEN3_PWM00FEN_Pos)            /*!< EADC_T::AD1TRGEN3: PWM00FEN Mask          */

#define EADC_AD1TRGEN3_PWM00PEN_Pos      (26)                                              /*!< EADC_T::AD1TRGEN3: PWM00PEN Position      */
#define EADC_AD1TRGEN3_PWM00PEN_Msk      (0x1ul << EADC_AD1TRGEN3_PWM00PEN_Pos)            /*!< EADC_T::AD1TRGEN3: PWM00PEN Mask          */

#define EADC_AD1TRGEN3_PWM00CEN_Pos      (27)                                              /*!< EADC_T::AD1TRGEN3: PWM00CEN Position      */
#define EADC_AD1TRGEN3_PWM00CEN_Msk      (0x1ul << EADC_AD1TRGEN3_PWM00CEN_Pos)            /*!< EADC_T::AD1TRGEN3: PWM00CEN Mask          */

#define EADC_AD1TRGEN3_PWM01REN_Pos      (28)                                              /*!< EADC_T::AD1TRGEN3: PWM01REN Position      */
#define EADC_AD1TRGEN3_PWM01REN_Msk      (0x1ul << EADC_AD1TRGEN3_PWM01REN_Pos)            /*!< EADC_T::AD1TRGEN3: PWM01REN Mask          */

#define EADC_AD1TRGEN3_PWM01FEN_Pos      (29)                                              /*!< EADC_T::AD1TRGEN3: PWM01FEN Position      */
#define EADC_AD1TRGEN3_PWM01FEN_Msk      (0x1ul << EADC_AD1TRGEN3_PWM01FEN_Pos)            /*!< EADC_T::AD1TRGEN3: PWM01FEN Mask          */

#define EADC_AD1TRGEN3_PWM01PEN_Pos      (30)                                              /*!< EADC_T::AD1TRGEN3: PWM01PEN Position      */
#define EADC_AD1TRGEN3_PWM01PEN_Msk      (0x1ul << EADC_AD1TRGEN3_PWM01PEN_Pos)            /*!< EADC_T::AD1TRGEN3: PWM01PEN Mask          */

