MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC472JG8AE/mcu.h
} EBI_T;

/**
    @addtogroup EBI_CONST EBI Bit Field Definition
    Constant Definitions for EBI Controller
@{ */

#define EBI_CTL_MCLKDIV_Pos              (8)                                               /*!< EBI_T::CTL: MCLKDIV Position              */
#define EBI_CTL_MCLKDIV_Msk              (0x7ul << EBI_CTL_MCLKDIV_Pos)                    /*!< EBI_T::CTL: MCLKDIV Mask                  */

#define EBI_CTL_CRYPTOEN_Pos             (24)                                              /*!< EBI_T::CTL: CRYPTOEN Position             */
#define EBI_CTL_CRYPTOEN_Msk             (0xful << EBI_CTL_CRYPTOEN_Pos)                   /*!< EBI_T::CTL: CRYPTOEN Mask                 */

#define EBI_CTL_CSPOLINV_Pos             (28)                                              /*!< EBI_T::CTL: CSPOLINV Position             */
#define EBI_CTL_CSPOLINV_Msk             (0xful << EBI_CTL_CSPOLINV_Pos)                   /*!< EBI_T::CTL: CSPOLINV Mask                 */

#define EBI_TCTL_TALE_Pos                (0)                                               /*!< EBI_T::TCTL: TALE Position                */
#define EBI_TCTL_TALE_Msk                (0x7ul << EBI_TCTL_TALE_Pos)                      /*!< EBI_T::TCTL: TALE Mask                    */

#define EBI_TCTL_TACC_Pos                (3)                                               /*!< EBI_T::TCTL: TACC Position                */
#define EBI_TCTL_TACC_Msk                (0x1ful << EBI_TCTL_TACC_Pos)                     /*!< EBI_T::TCTL: TACC Mask                    */

#define EBI_TCTL_TAHD_Pos                (8)                                               /*!< EBI_T::TCTL: TAHD Position                */
#define EBI_TCTL_TAHD_Msk                (0x7ul << EBI_TCTL_TAHD_Pos)                      /*!< EBI_T::TCTL: TAHD Mask                    */

#define EBI_TCTL_W2X_Pos                 (12)                                              /*!< EBI_T::TCTL: W2X Position                 */
#define EBI_TCTL_W2X_Msk                 (0xful << EBI_TCTL_W2X_Pos)                       /*!< EBI_T::TCTL: W2X Mask                     */

#define EBI_TCTL_R2W_Pos                 (16)                                              /*!< EBI_T::TCTL: R2W Position                 */
#define EBI_TCTL_R2W_Msk                 (0xful << EBI_TCTL_R2W_Pos)                       /*!< EBI_T::TCTL: R2W Mask                     */

#define EBI_TCTL_R2R_Pos                 (24)                                              /*!< EBI_T::TCTL: R2R Position                 */
#define EBI_TCTL_R2R_Msk                 (0xful << EBI_TCTL_R2R_Pos)                       /*!< EBI_T::TCTL: R2R Mask                     */

#define EBI_TCTL_CSEN_Pos                (28)                                              /*!< EBI_T::TCTL: CSEN Position                */
#define EBI_TCTL_CSEN_Msk                (0x1ul << EBI_TCTL_CSEN_Pos)                      /*!< EBI_T::TCTL: CSEN Mask                    */

#define EBI_TCTL_DW16_Pos                (29)                                              /*!< EBI_T::TCTL: DW16 Position                */
#define EBI_TCTL_DW16_Msk                (0x1ul << EBI_TCTL_DW16_Pos)                      /*!< EBI_T::TCTL: DW16 Mask                    */

#define EBI_TCTL_SEPEN_Pos               (30)                                              /*!< EBI_T::TCTL: SEPEN Position               */
#define EBI_TCTL_SEPEN_Msk               (0x1ul << EBI_TCTL_SEPEN_Pos)                     /*!< EBI_T::TCTL: SEPEN Mask                   */

#define EBI_KEY0_KEY_Pos                 (0)                                               /*!< EBI_T::KEY0: KEY Position                 */
#define EBI_KEY0_KEY_Msk                 (0xfffffffful << EBI_KEY0_KEY_Pos)                /*!< EBI_T::KEY0: KEY Mask                     */

#define EBI_KEY1_KEY_Pos                 (0)                                               /*!< EBI_T::KEY1: KEY Position                 */
#define EBI_KEY1_KEY_Msk                 (0xfffffffful << EBI_KEY1_KEY_Pos)                /*!< EBI_T::KEY1: KEY Mask                     */

#define EBI_KEY2_KEY_Pos                 (0)                                               /*!< EBI_T::KEY2: KEY Position                 */
#define EBI_KEY2_KEY_Msk                 (0xfffffffful << EBI_KEY2_KEY_Pos)                /*!< EBI_T::KEY2: KEY Mask                     */

#define EBI_KEY3_KEY_Pos                 (0)                                               /*!< EBI_T::KEY3: KEY Position                 */
#define EBI_KEY3_KEY_Msk                 (0xfffffffful << EBI_KEY3_KEY_Pos)                /*!< EBI_T::KEY3: KEY Mask                     */

/**@}*/ /* EBI_CONST */
/**@}*/ /* end of EBI register group */


/*---------------------- Ethernet MAC Controller -------------------------*/
/**
    @addtogroup EMAC Ethernet MAC Controller(EMAC)
    Memory Mapped Structure for EMAC Controller
@{ */

typedef struct {


    /**
     * CAMCTL
     * ===================================================================================================
     * Offset: 0x00  CAM Comparison Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |AUP       |Accept Unicast Packet
     * |        |          |The AUP controls the unicast packet reception.
     * |        |          |If AUP is enabled, EMAC receives all incoming packet its destination MAC address is a unicast address.
     * |        |          |0 = EMAC receives packet depends on the CAM comparison result.
     * |        |          |1 = EMAC receives all unicast packets.
     * |[1]     |AMP       |Accept Multicast Packet
     * |        |          |The AMP controls the multicast packet reception.
     * |        |          |If AMP is enabled, EMAC receives all incoming packet its destination MAC address is a multicast address.
     * |        |          |0 = EMAC receives packet depends on the CAM comparison result.
     * |        |          |1 = EMAC receives all multicast packets.
     * |[2]     |ABP       |Accept Broadcast Packet
     * |        |          |The ABP controls the broadcast packet reception.
     * |        |          |If ABP is enabled, EMAC receives all incoming packet its destination MAC address is a broadcast address.
     * |        |          |0 = EMAC receives packet depends on the CAM comparison result.
     * |        |          |1 = EMAC receives all broadcast packets.
     * |[3]     |COMPEN    |Complement CAM Comparison Enable
     * |        |          |The COMPEN controls the complement of the CAM comparison result.
     * |        |          |If the CMPEN and COMPEN are both enabled, the incoming packet with specific destination MAC address configured in CAM entry will be dropped.
     * |        |          |And the incoming packet with destination MAC address does not configured in any CAM entry will be received.
     * |        |          |0 = The CAM comparison result does not complement.
     * |        |          |1 = The CAM comparison result complemented.
     * |[4]     |CMPEN     |CAM Compare Enable
     * |        |          |The CMPEN controls the enable of CAM comparison function for destination MAC address recognition.
     * |        |          |If software wants to receive a packet with specific destination MAC address, configures the MAC address into CAM 12~0, then enables that CAM entry and set CMPEN to 1.
     * |        |          |0 = CAM comparison function for destination MAC address recognition disabled.
     * |        |          |1 = CAM comparison function for destination MAC address recognition enabled.
    */
    __IO uint32_t CAMCTL;

    /**
     * CAMEN
     * ===================================================================================================
     * Offset: 0x04  CAM Enable Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |CAMxEN    |CAM Entry X Enable Control
     * |        |          |The CAMxEN controls the validation of CAM entry x.
     * |        |          |The CAM entry 13, 14 and 15 are for PAUSE control frame transmission.
     * |        |          |If software wants to transmit a PAUSE control frame out to network, the enable bits of these three CAM entries all must be enabled first.
     * |        |          |0 = CAM entry x Disabled.
     * |        |          |1 = CAM entry x Enabled.
    */
    __IO uint32_t CAMEN;

    /**
     * CAM0M
     * ===================================================================================================
     * Offset: 0x08  CAM0 Most Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |MACADDR2  |MAC Address Byte 2
     * |[8:15]  |MACADDR3  |MAC Address Byte 3
     * |[16:23] |MACADDR4  |MAC Address Byte 4
     * |[24:31] |MACADDR5  |MAC Address Byte 5
     * |        |          |The CAMxM keeps the bit 47~16 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM0M;

    /**
     * CAM0L
     * ===================================================================================================
     * Offset: 0x0C  CAM0 Least Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:23] |MACADDR0  |MAC Address Byte 0
     * |[24:31] |MACADDR1  |MAC Address Byte 1
     * |        |          |The CAMxL keeps the bit 15~0 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM0L;

    /**
     * CAM1M
     * ===================================================================================================
     * Offset: 0x10  CAM1 Most Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |MACADDR2  |MAC Address Byte 2
     * |[8:15]  |MACADDR3  |MAC Address Byte 3
     * |[16:23] |MACADDR4  |MAC Address Byte 4
     * |[24:31] |MACADDR5  |MAC Address Byte 5
     * |        |          |The CAMxM keeps the bit 47~16 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM1M;

    /**
     * CAM1L
     * ===================================================================================================
     * Offset: 0x14  CAM1 Least Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:23] |MACADDR0  |MAC Address Byte 0
     * |[24:31] |MACADDR1  |MAC Address Byte 1
     * |        |          |The CAMxL keeps the bit 15~0 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM1L;

    /**
     * CAM2M
     * ===================================================================================================
     * Offset: 0x18  CAM2 Most Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |MACADDR2  |MAC Address Byte 2
     * |[8:15]  |MACADDR3  |MAC Address Byte 3
     * |[16:23] |MACADDR4  |MAC Address Byte 4
     * |[24:31] |MACADDR5  |MAC Address Byte 5
     * |        |          |The CAMxM keeps the bit 47~16 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM2M;

    /**
     * CAM2L
     * ===================================================================================================
     * Offset: 0x1C  CAM2 Least Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:23] |MACADDR0  |MAC Address Byte 0
     * |[24:31] |MACADDR1  |MAC Address Byte 1
     * |        |          |The CAMxL keeps the bit 15~0 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM2L;

    /**
     * CAM3M
     * ===================================================================================================
     * Offset: 0x20  CAM3 Most Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |MACADDR2  |MAC Address Byte 2
     * |[8:15]  |MACADDR3  |MAC Address Byte 3
     * |[16:23] |MACADDR4  |MAC Address Byte 4
     * |[24:31] |MACADDR5  |MAC Address Byte 5
     * |        |          |The CAMxM keeps the bit 47~16 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM3M;

    /**
     * CAM3L
     * ===================================================================================================
     * Offset: 0x24  CAM3 Least Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:23] |MACADDR0  |MAC Address Byte 0
     * |[24:31] |MACADDR1  |MAC Address Byte 1
     * |        |          |The CAMxL keeps the bit 15~0 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM3L;

    /**
     * CAM4M
     * ===================================================================================================
     * Offset: 0x28  CAM4 Most Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |MACADDR2  |MAC Address Byte 2
     * |[8:15]  |MACADDR3  |MAC Address Byte 3
     * |[16:23] |MACADDR4  |MAC Address Byte 4
     * |[24:31] |MACADDR5  |MAC Address Byte 5
     * |        |          |The CAMxM keeps the bit 47~16 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM4M;

    /**
     * CAM4L
     * ===================================================================================================
     * Offset: 0x2C  CAM4 Least Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:23] |MACADDR0  |MAC Address Byte 0
     * |[24:31] |MACADDR1  |MAC Address Byte 1
     * |        |          |The CAMxL keeps the bit 15~0 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM4L;

    /**
     * CAM5M
     * ===================================================================================================
     * Offset: 0x30  CAM5 Most Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |MACADDR2  |MAC Address Byte 2
     * |[8:15]  |MACADDR3  |MAC Address Byte 3
     * |[16:23] |MACADDR4  |MAC Address Byte 4
     * |[24:31] |MACADDR5  |MAC Address Byte 5
     * |        |          |The CAMxM keeps the bit 47~16 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM5M;

    /**
     * CAM5L
     * ===================================================================================================
     * Offset: 0x34  CAM5 Least Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:23] |MACADDR0  |MAC Address Byte 0
     * |[24:31] |MACADDR1  |MAC Address Byte 1
     * |        |          |The CAMxL keeps the bit 15~0 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM5L;

    /**
     * CAM6M
     * ===================================================================================================
     * Offset: 0x38  CAM6 Most Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |MACADDR2  |MAC Address Byte 2
     * |[8:15]  |MACADDR3  |MAC Address Byte 3
     * |[16:23] |MACADDR4  |MAC Address Byte 4
     * |[24:31] |MACADDR5  |MAC Address Byte 5
     * |        |          |The CAMxM keeps the bit 47~16 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM6M;

    /**
     * CAM6L
     * ===================================================================================================
     * Offset: 0x3C  CAM6 Least Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:23] |MACADDR0  |MAC Address Byte 0
     * |[24:31] |MACADDR1  |MAC Address Byte 1
     * |        |          |The CAMxL keeps the bit 15~0 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM6L;

    /**
     * CAM7M
     * ===================================================================================================
     * Offset: 0x40  CAM7 Most Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |MACADDR2  |MAC Address Byte 2
     * |[8:15]  |MACADDR3  |MAC Address Byte 3
     * |[16:23] |MACADDR4  |MAC Address Byte 4
     * |[24:31] |MACADDR5  |MAC Address Byte 5
     * |        |          |The CAMxM keeps the bit 47~16 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM7M;

