MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC472JG8AE/mcu.h
    /**
     * CAM7L
     * ===================================================================================================
     * Offset: 0x44  CAM7 Least Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:23] |MACADDR0  |MAC Address Byte 0
     * |[24:31] |MACADDR1  |MAC Address Byte 1
     * |        |          |The CAMxL keeps the bit 15~0 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM7L;

    /**
     * CAM8M
     * ===================================================================================================
     * Offset: 0x48  CAM8 Most Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |MACADDR2  |MAC Address Byte 2
     * |[8:15]  |MACADDR3  |MAC Address Byte 3
     * |[16:23] |MACADDR4  |MAC Address Byte 4
     * |[24:31] |MACADDR5  |MAC Address Byte 5
     * |        |          |The CAMxM keeps the bit 47~16 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM8M;

    /**
     * CAM8L
     * ===================================================================================================
     * Offset: 0x4C  CAM8 Least Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:23] |MACADDR0  |MAC Address Byte 0
     * |[24:31] |MACADDR1  |MAC Address Byte 1
     * |        |          |The CAMxL keeps the bit 15~0 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM8L;

    /**
     * CAM9M
     * ===================================================================================================
     * Offset: 0x50  CAM9 Most Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |MACADDR2  |MAC Address Byte 2
     * |[8:15]  |MACADDR3  |MAC Address Byte 3
     * |[16:23] |MACADDR4  |MAC Address Byte 4
     * |[24:31] |MACADDR5  |MAC Address Byte 5
     * |        |          |The CAMxM keeps the bit 47~16 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM9M;

    /**
     * CAM9L
     * ===================================================================================================
     * Offset: 0x54  CAM9 Least Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:23] |MACADDR0  |MAC Address Byte 0
     * |[24:31] |MACADDR1  |MAC Address Byte 1
     * |        |          |The CAMxL keeps the bit 15~0 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM9L;

    /**
     * CAM10M
     * ===================================================================================================
     * Offset: 0x58  CAM10 Most Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |MACADDR2  |MAC Address Byte 2
     * |[8:15]  |MACADDR3  |MAC Address Byte 3
     * |[16:23] |MACADDR4  |MAC Address Byte 4
     * |[24:31] |MACADDR5  |MAC Address Byte 5
     * |        |          |The CAMxM keeps the bit 47~16 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM10M;

    /**
     * CAM10L
     * ===================================================================================================
     * Offset: 0x5C  CAM10 Least Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:23] |MACADDR0  |MAC Address Byte 0
     * |[24:31] |MACADDR1  |MAC Address Byte 1
     * |        |          |The CAMxL keeps the bit 15~0 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM10L;

    /**
     * CAM11M
     * ===================================================================================================
     * Offset: 0x60  CAM11 Most Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |MACADDR2  |MAC Address Byte 2
     * |[8:15]  |MACADDR3  |MAC Address Byte 3
     * |[16:23] |MACADDR4  |MAC Address Byte 4
     * |[24:31] |MACADDR5  |MAC Address Byte 5
     * |        |          |The CAMxM keeps the bit 47~16 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM11M;

    /**
     * CAM11L
     * ===================================================================================================
     * Offset: 0x64  CAM11 Least Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:23] |MACADDR0  |MAC Address Byte 0
     * |[24:31] |MACADDR1  |MAC Address Byte 1
     * |        |          |The CAMxL keeps the bit 15~0 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM11L;

    /**
     * CAM12M
     * ===================================================================================================
     * Offset: 0x68  CAM12 Most Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |MACADDR2  |MAC Address Byte 2
     * |[8:15]  |MACADDR3  |MAC Address Byte 3
     * |[16:23] |MACADDR4  |MAC Address Byte 4
     * |[24:31] |MACADDR5  |MAC Address Byte 5
     * |        |          |The CAMxM keeps the bit 47~16 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM12M;

    /**
     * CAM12L
     * ===================================================================================================
     * Offset: 0x6C  CAM12 Least Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:23] |MACADDR0  |MAC Address Byte 0
     * |[24:31] |MACADDR1  |MAC Address Byte 1
     * |        |          |The CAMxL keeps the bit 15~0 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM12L;

    /**
     * CAM13M
     * ===================================================================================================
     * Offset: 0x70  CAM13 Most Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |MACADDR2  |MAC Address Byte 2
     * |[8:15]  |MACADDR3  |MAC Address Byte 3
     * |[16:23] |MACADDR4  |MAC Address Byte 4
     * |[24:31] |MACADDR5  |MAC Address Byte 5
     * |        |          |The CAMxM keeps the bit 47~16 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM13M;

    /**
     * CAM13L
     * ===================================================================================================
     * Offset: 0x74  CAM13 Least Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:23] |MACADDR0  |MAC Address Byte 0
     * |[24:31] |MACADDR1  |MAC Address Byte 1
     * |        |          |The CAMxL keeps the bit 15~0 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM13L;

    /**
     * CAM14M
     * ===================================================================================================
     * Offset: 0x78  CAM14 Most Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |MACADDR2  |MAC Address Byte 2
     * |[8:15]  |MACADDR3  |MAC Address Byte 3
     * |[16:23] |MACADDR4  |MAC Address Byte 4
     * |[24:31] |MACADDR5  |MAC Address Byte 5
     * |        |          |The CAMxM keeps the bit 47~16 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM14M;

    /**
     * CAM14L
     * ===================================================================================================
     * Offset: 0x7C  CAM14 Least Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16:23] |MACADDR0  |MAC Address Byte 0
     * |[24:31] |MACADDR1  |MAC Address Byte 1
     * |        |          |The CAMxL keeps the bit 15~0 of MAC address.
     * |        |          |The x can be the 0~14.
     * |        |          |The register pair {EMAC_CAMxMSB, EMAC_CAMxLSB} represents a CAM entry and keeps a MAC address.
     * |        |          |For example, if the MAC address 00-50-BA-33-BA-44 kept in CAM entry 1, the register EMAC_CAM1M is 0x0050_BA33 and EMAC_CAM1L is 0xBA44_0000.
    */
    __IO uint32_t CAM14L;

    /**
     * CAM15MSB
     * ===================================================================================================
     * Offset: 0x80  CAM15 Most Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |OPCODE    |OP Code Field of PAUSE Control Frame
     * |        |          |In the PAUSE control frame, an op code field defined and is 0x0001.
     * |[16:31] |LENGTH    |LENGTH Field of PAUSE Control Frame
     * |        |          |In the PAUSE control frame, a LENGTH field defined and is 0x8808.
    */
    __IO uint32_t CAM15MSB;

    /**
     * CAM15LSB
     * ===================================================================================================
     * Offset: 0x84  CAM15 Least Significant Word Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[24:31] |OPERAND   |Pause Parameter
     * |        |          |In the PAUSE control frame, an OPERAND field defined and controls how much time the destination Ethernet MAC Controller paused.
     * |        |          |The unit of the OPERAND is a slot time, the 512 bits time.
    */
    __IO uint32_t CAM15LSB;

    /**
     * TXDSA
     * ===================================================================================================
     * Offset: 0x88  Transmit Descriptor Link List Start Address Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |TXDSA     |Transmit Descriptor Link-List Start Address
     * |        |          |The TXDSA keeps the start address of transmit descriptor link-list.
     * |        |          |If the software enables the bit TXON (EMAC_CTL[8]), the content of TXDSA will be loaded into the current transmit descriptor start address register (EMAC_CTXDSA).
     * |        |          |The TXDSA does not be up2025-06-10d by EMAC.
     * |        |          |During the operation, EMAC will ignore the bits [1:0] of TXDSA.
     * |        |          |This means that each TX descriptor always must locate at word boundary memory address.
    */
    __IO uint32_t TXDSA;

    /**
     * RXDSA
     * ===================================================================================================
     * Offset: 0x8C  Receive Descriptor Link List Start Address Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |RXDSA     |Receive Descriptor Link-List Start Address
     * |        |          |The RXDSA keeps the start address of receive descriptor link-list.
     * |        |          |If the S/W enables the bit RXON (EMAC_CTL[0]), the content of RXDSA will be loaded into the current receive descriptor start address register (EMAC_CRXDSA).
     * |        |          |The RXDSA does not be up2025-06-10d by EMAC.
     * |        |          |During the operation, EMAC will ignore the bits [1:0] of RXDSA.
     * |        |          |This means that each RX descriptor always must locate at word boundary memory address.
    */
    __IO uint32_t RXDSA;

