MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC472JG8AE/mcu.h
#define EMAC_TSSUBSEC_SUBSEC_Pos         (0)                                               /*!< EMAC_T::TSSUBSEC: SUBSEC Position         */
#define EMAC_TSSUBSEC_SUBSEC_Msk         (0xfffffffful << EMAC_TSSUBSEC_SUBSEC_Pos)        /*!< EMAC_T::TSSUBSEC: SUBSEC Mask             */

#define EMAC_TSINC_CNTINC_Pos            (0)                                               /*!< EMAC_T::TSINC: CNTINC Position            */
#define EMAC_TSINC_CNTINC_Msk            (0xfful << EMAC_TSINC_CNTINC_Pos)                 /*!< EMAC_T::TSINC: CNTINC Mask                */

#define EMAC_TSADDEND_ADDEND_Pos         (0)                                               /*!< EMAC_T::TSADDEND: ADDEND Position         */
#define EMAC_TSADDEND_ADDEND_Msk         (0xfffffffful << EMAC_TSADDEND_ADDEND_Pos)        /*!< EMAC_T::TSADDEND: ADDEND Mask             */

#define EMAC_UPDSEC_SEC_Pos              (0)                                               /*!< EMAC_T::UPDSEC: SEC Position              */
#define EMAC_UPDSEC_SEC_Msk              (0xfffffffful << EMAC_UPDSEC_SEC_Pos)             /*!< EMAC_T::UPDSEC: SEC Mask                  */

#define EMAC_UPDSUBSEC_SUBSEC_Pos        (0)                                               /*!< EMAC_T::UPDSUBSEC: SUBSEC Position        */
#define EMAC_UPDSUBSEC_SUBSEC_Msk        (0xfffffffful << EMAC_UPDSUBSEC_SUBSEC_Pos)       /*!< EMAC_T::UPDSUBSEC: SUBSEC Mask            */

#define EMAC_ALMSEC_SEC_Pos              (0)                                               /*!< EMAC_T::ALMSEC: SEC Position              */
#define EMAC_ALMSEC_SEC_Msk              (0xfffffffful << EMAC_ALMSEC_SEC_Pos)             /*!< EMAC_T::ALMSEC: SEC Mask                  */

#define EMAC_ALMSUBSEC_SUBSEC_Pos        (0)                                               /*!< EMAC_T::ALMSUBSEC: SUBSEC Position        */
#define EMAC_ALMSUBSEC_SUBSEC_Msk        (0xfffffffful << EMAC_ALMSUBSEC_SUBSEC_Pos)       /*!< EMAC_T::ALMSUBSEC: SUBSEC Mask            */

/**@}*/ /* EMAC_CONST */
/**@}*/ /* end of EMAC register group */


/*---------------------- Enhanced PWM Generator -------------------------*/
/**
    @addtogroup EPWM Enhanced PWM Generator(EPWM)
    Memory Mapped Structure for EPWM Controller
@{ */

typedef struct {


    /**
     * CTL
     * ===================================================================================================
     * Offset: 0x00  PWM Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:1]   |MODE      |PWM Mode Selection
     * |        |          |00 = Independent mode.
     * |        |          |01 = Pair/Complementary mode.
     * |        |          |10 = Synchronized mode.
     * |        |          |11 = Reserved.
     * |[2:3]   |CLKDIV    |PWM Clock Pre-Divider Selection
     * |        |          |00 = PWM clock = EPWMx_CLK.
     * |        |          |01 = PWM clock = EPWMx_CLK/2.
     * |        |          |10 = PWM clock = EPWMx_CLK/4.
     * |        |          |11 = PWM clock = EPWMx_CLK/16.
     * |[4]     |PWMIEN    |PWM Interrupt Enable Control
     * |        |          |0 = Disabling flag PIF to trigger PWM interrupt.
     * |        |          |1 = Enabling flag PIF can trigger PWM interrupt.
     * |[5]     |BRKIEN    |Brake0 And Brak1 Interrupt Enable Control
     * |        |          |0 = Disabling flags BFK0 and BFK1 to trigger PWM interrupt.
     * |        |          |1 = Enabling flags BRKIF0 and BRKIF1 can trigger PWM interrupt.
     * |[6]     |LOAD      |Re-Load PWM Period Registers (EPWM_PERIOD) And PWM Duty Registers (PWM0~3) Control
     * |        |          |0 = No action if written with 0.
     * |        |          |The value of PWM period register (EPWM_PERIOD) and PWM duty registers (PWMn_CH0~PWMn_CH3) are not loaded to PWM counter and Comparator registers.
     * |        |          |1 = Hardware will up2025-06-10 the value of PWM period register (EPWM_PERIOD) and PWM duty registers (PWMn_CH0~PWMn_CH3) to PWM Counter and Comparator register at the time of PWM Counter matches PERIOD in edge and central aligned modes or at the time of PWM Counter down counts with underflow in central aligned mode.
     * |        |          |Note1: n=0-1 for PWM unit0-1.
     * |        |          |Note2: This bit is software write, hardware clear and always read zero.
     * |[7]     |CNTEN     |Start CNTEN Control
     * |        |          |0 = The PWM stops running.
     * |        |          |1 = The PWM counter starts running.
     * |[8]     |INTTYPE   |PWM Interrupt Type Selection
     * |        |          |0 = PIF will be set if PWM counter underflow.
     * |        |          |1 = PIF will be set if PWM counter matches EPWM_PERIOD register.
     * |        |          |Note: This bit is effective when PWM in central align mode only.
     * |[9]     |PINV      |Inverse PWM Comparator Output
     * |        |          |When PINV is set to high the PWM comparator output signals will be inversed, therefore the PWM Duty (in percentage) is changed to (1-Duty) before PINV is set to high.
     * |        |          |0 = Not inverse PWM comparator output.
     * |        |          |1 = Inverse PWM comparator output.
     * |[11]    |CNTCLR    |Clear PWM Counter Control
     * |        |          |1 = Clear 16-bit PWM counter to 000H.
     * |        |          |Note: It is automatically cleared by hardware.
     * |[12]    |CNTTYPE   |PWM Aligned Type Selection
     * |        |          |0 = Edge-aligned type.
     * |        |          |1 = Centre-aligned type.
     * |[13]    |GROUPEN   |Group Bit
     * |        |          |0 = The signals timing of EPWM_CMPDAT0, EPWM_CMPDAT2 and EPWM_CMPDAT4 are independent.
     * |        |          |1 = Unify the signals timing of EPWM_CMPDAT0, EPWM_CMPDAT2 and EPWM_CMPDAT4 in the same phase which is controlled by EPWM_CMPDAT0.
     * |[14]    |BRKP0INV  |Inverse BKP0 State
     * |        |          |0 = The state of pin BKPx0 is passed to the negative edge detector.
     * |        |          |1 = The inversed state of pin BKPx0 is passed to the negative edge detector.
     * |[15]    |BRKP1INV  |Inverse BKP1 State
     * |        |          |0 = The state of pin BKPx1 is passed to the negative edge detector.
     * |        |          |1 = The inversed state of pin BKPx1 is passed to the negative edge detector.
     * |[16]    |BRKP0EN   |BKPx0 Pin Trigger Brake Function0 Enable Control
     * |        |          |0 = PWMx Brake Function 0 Disabled.
     * |        |          |1 = PWMx Brake Function 0 Enabled.
     * |        |          |Note: x=0~1 for PWM unit0~1.
     * |[17]    |BRKP1EN   |BKPx1 Pin Trigger Brake Function Enable Control
     * |        |          |0 = PWMx Brake Function 1 Disabled.
     * |        |          |1 = PWMx Brake Function 1 Enabled.
     * |        |          |Note: x=0~1 for PWM unit0~1.
     * |[18:19] |BRK1SEL   |Brake Function 1 Source Selection
     * |        |          |00 = From external pin BKPx1 (x=0~1 for unit0~1).
     * |        |          |01 = From analog comparator 0 output (CPO0).
     * |        |          |10 = From analog comparator 1 output (CPO1).
     * |        |          |11 = From analog comparator 2 output (CPO2).
     * |[20:21] |BRK0NFSEL |Brake 0 (BKPx0 Pin) Edge Detector Filter Clock Selection
     * |        |          |00 = Filter clock = HCLK.
     * |        |          |01 = Filter clock = HCLK/2.
     * |        |          |10 = Filter clock = HCLK/4.
     * |        |          |11 = Filter clock = HCLK/16.
     * |[22:23] |BRK1NFSEL |Brake 1 (BKPx1 Pin) Edge Detector Filter Clock Selection
     * |        |          |00 = Filter clock = HCLK.
     * |        |          |01 =Filter clock = HCLK/2.
     * |        |          |10 = Filter clock = HCLK/4.
     * |        |          |11 = Filter clock = HCLK/16.
     * |[24]    |CPO0BKEN  |CPO0 Digital Output As Brake0 Source Enable Control
     * |        |          |1 = CPO0 as one brake source in Brake 0 Enabled.
     * |        |          |0 = CPO0 as one brake source in Brake 0 Disabled.
     * |[25]    |CPO1BKEN  |CPO1 Digital Output As Brake 0 Source Enable Control
     * |        |          |0 = CPO1 as one brake source in Brake 0 Disabled.
     * |        |          |1 = CPO1 as one brake source in Brake 0 Enabled.
     * |[26]    |CPO2BKEN  |CPO2 Digital Output As Brake 0 Source Enable Control
     * |        |          |0 = CPO2 as one brake source in Brake 0 Disabled.
     * |        |          |1 = CPO2 as one brake source in Brake 0 Enabled.
     * |[27]    |LVDBKEN   |Low-Level Detection Trigger PWM Brake Function 1 Enable Control
     * |        |          |0 = Brake Function 1 triggered by Low-level detection Disabled.
     * |        |          |1 = Brake Function 1 triggered by Low-level detection Enabled.
     * |[28]    |BRK0NFDIS |PWM Brake 0 Noise Filter Disable Control
     * |        |          |0 = Noise filter of PWM Brake 0 Enabled.
     * |        |          |1 = Noise filter of PWM Brake 0 Disabled.
     * |[29]    |BRK1NFDIS |PWM Brake 1 Noise Filter Disable Control
     * |        |          |0 = Noise filter of PWM Brake 1 Enabled.
     * |        |          |1 = Noise filter of PWM Brake 1 Disabled.
     * |[31]    |CTRLD     |Center Reload Mode Enable Control
     * |        |          |0 = EPWM reload duty register at the period point of PWM counter.
     * |        |          |1 = EPWM reload duty register at the center point of PWM counter.
     * |        |          |This bit only work when EPWM operation at center aligned mode.
    */
    __IO uint32_t CTL;

    /**
     * STATUS
     * ===================================================================================================
     * Offset: 0x04  PWM Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |BRKIF0    |PWM Brake0 Flag
     * |        |          |0 = PWM Brake 0 is able to poll falling signal at BKP0 and has not recognized any one.
     * |        |          |1 = When PWM Brake 0 detects a falling signal at BKP0, this flag will be set to high.
     * |        |          |Note: This bit must be cleared by writing 1 to it.
     * |[1]     |BRKIF1    |PWM Brake1 Flag
     * |        |          |0 = PWM Brake 1 is able to poll falling signal at BKP1 and has not recognized any one.
     * |        |          |1 = When PWM Brake 1 detects a falling signal at pin BKP1, this flag will be set to high.
     * |        |          |Note: This bit must be cleared by writing 1 to it.
     * |[2]     |PIF       |PWM Period Flag
     * |        |          |0 = PWM Counter has not up counted to the value of PERIOD or down counted with underflow.
     * |        |          |1 = Hardware will set this flag to high at the time of PWM Counter matches PERIOD in edge and Centre aligned modes or at the time of PWM Counter down counts with underflow in Centre aligned mode.
     * |        |          |Note: This bit must be cleared by writing 1 to it.
     * |[4]     |EIF0      |PWMx0 Edge Flag
     * |        |          |0 = The PWMx0 doesn't toggle.
     * |        |          |1 = Hardware will set this flag to high at the time of PWMx0 rising or falling.
     * |        |          |If EINTTYPE0 = 0, this bit is set when PWMx0 falling is detected.
     * |        |          |If EINTTYPE0 = 1, this bit is set when PWMx0 rising is detected.
     * |        |          |Note: This bit must be cleared by writing 1 to it.
     * |[5]     |EIF2      |PWMx2 Edge Flag
     * |        |          |0 = The PWMx2 doesn't toggle.
     * |        |          |1 = Hardware will set this flag to high at the time of PWMx2 rising or falling.
     * |        |          |If EINTTYPE2 = 0, this bit is set when PWMx2 falling is detected.
     * |        |          |If EINTTYPE2 = 1, this bit is set when PWMx2 rising is detected.
     * |        |          |Note: This bit must be cleared by writing 1 to it.
     * |[6]     |EIF4      |PWMx4 Edge Flag
     * |        |          |0 = The PWMx4 doesn't toggle.
     * |        |          |1 = Hardware will set this flag to high at the time of PWMx4 rising or falling.
     * |        |          |If EINTTYPE4 = 0, this bit is set when PWMx4 falling is detected.
     * |        |          |If EINTTYPE4 = 1, this bit is set when PWMx4 rising is detected.
     * |        |          |Note: This bit must be cleared by writing 1 to it.
     * |[8]     |BRK0LOCK  |PWM Brake0 Locked
     * |        |          |0 = Brake 0 state is released.
     * |        |          |1 = When PWM Brake detects a falling signal at BKP0, this flag will be set to high to indicate the Brake0 state is locked.
     * |        |          |Note: This bit must be cleared by writing 1 to it.
     * |[24]    |BRK0STS   |Brake 0 Status (Read Only)
     * |        |          |0 = PWM had been out of Brake 0 state.
     * |        |          |1 = PWM is in Brake 0 state.
     * |[25]    |BRK1STS   |Brake 1 Status (Read Only)
     * |        |          |0 = PWM had been out of Brake 1 state.
     * |        |          |1 = PWM is in Brake 1 state.
    */
    __IO uint32_t STATUS;

    /**
     * PERIOD
     * ===================================================================================================
     * Offset: 0x08  PWM Period Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |PERIOD    |PWM Period Register
     * |        |          |Edge aligned:
     * |        |          |Period = (PERIOD + 1)* EPWMx_CLK period * pre-scalar.
     * |        |          |Duty = (Duty +1 )* EPWMx_CLK period * pre-scalar.
     * |        |          |Centre aligned:
     * |        |          |Period = (PERIOD * 2)* EPWMx_CLK period * pre-scalar.
     * |        |          |Duty = (Duty *2 + 1) * EPWMx_CLK period * pre-scalar.
    */
    __IO uint32_t PERIOD;

    /**
     * CMPDAT0
     * ===================================================================================================
     * Offset: 0x0C  EPWM_CMPDAT0 Duty Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |CMP       |PWM Duty Register
     * |        |          |Edge aligned:
     * |        |          |Period = (PERIOD + 1)* EPWMx_CLK period * pre-scalar.
     * |        |          |Duty = (Duty +1 )* EPWMx_CLK period * pre-scalar.
     * |        |          |Centre aligned:
     * |        |          |Period = (PERIOD * 2)* EPWMx_CLK period * pre-scalar.
     * |        |          |Duty = (Duty *2 + 1) * EPWMx_CLK period * pre-scalar.
    */
    __IO uint32_t CMPDAT[3];

    /**
     * MSKEN
     * ===================================================================================================
     * Offset: 0x18  PWM Mask Mode Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:5]   |MSKEN     |PWM Mask Enable Control
     * |        |          |The PWM generator signal will be masked when this bit is enabled.
     * |        |          |The corresponding PWMn channel will be output with PMD.n data.
     * |        |          |0 = PWM generator signal is output to next stage.
     * |        |          |1 = PWM generator signal is masked and PMD.n is output to next stage.
     * |        |          |Note: n = 0~5.
    */
    __IO uint32_t MSKEN;

    /**
     * MSK
     * ===================================================================================================
     * Offset: 0x1C  PWM Mask Mode Data Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:5]   |MSKDAT    |PWM Mask Data Bit
     * |        |          |This data bit control the state of PWMn output pin, if the corresponding PME.n = 1.
     * |        |          |0 = Output logic low to PWMn.
     * |        |          |1 = Output logic high to PWMn.
     * |        |          |Note: n = 0~5.
    */
    __IO uint32_t MSK;

    /**
     * ASYMCMP0
     * ===================================================================================================
     * Offset: 0x20  Asymmetric EPWM_CMPDAT0 Duty Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |CMP       |Asymmetric PWM Duty Register
     * |        |          |When the asymmetric PWM function is enabled, this 16-bit field determines the second time compared value after PWM counter has matched with PWM_Duty in the first half PWM cycle.
    */
    __IO uint32_t ASYMCMP0;

    /**
     * ASYMCMP2
     * ===================================================================================================
     * Offset: 0x24  Asymmetric EPWM_CMPDAT2 Duty Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |CMP       |Asymmetric PWM Duty Register
     * |        |          |When the asymmetric PWM function is enabled, this 16-bit field determines the second time compared value after PWM counter has matched with PWM_Duty in the first half PWM cycle.
    */
    __IO uint32_t ASYMCMP2;

    /**
     * ASYMCMP4
     * ===================================================================================================
     * Offset: 0x28  Asymmetric EPWM_CMPDAT4 Duty Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |CMP       |Asymmetric PWM Duty Register
     * |        |          |When the asymmetric PWM function is enabled, this 16-bit field determines the second time compared value after PWM counter has matched with PWM_Duty in the first half PWM cycle.
    */
    __IO uint32_t ASYMCMP4;

    /**
     * DTCTL
     * ===================================================================================================
     * Offset: 0x2C  PWM Dead-time Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:10]  |DTCNT     |Dead-Time Counter
     * |        |          |The dead-time can be calculated from the following formula:
     * |        |          |Dead-time = EPWMx_CLK period * (DTCNT.[10:0]+1).
     * |[16]    |DTEN0     |Dead-Time Insertion Enable Control For PWMx Pair (PWM0, PWM1)
     * |        |          |Dead-time insertion is only active when this pair of complementary PWM is enabled.
     * |        |          |If dead-time insertion is inactive, the outputs of pin pair are complementary without any delay.
     * |        |          |0 = Dead-time insertion Disabled on the pin pair (PWM0, PWM1).
     * |        |          |1 = Dead-time insertion Enabled on the pin pair (PWM0, PWM1).
     * |        |          |Note: x=0~1 for PWM unit0~1.
     * |[17]    |DTEN2     |Dead-Time Insertion Enable Control For PWMx Pair (PWM2, PWM3)
     * |        |          |Dead-time insertion is only active when this pair of complementary PWM is enabled.
     * |        |          |If dead-time insertion is inactive, the outputs of pin pair are complementary without any delay.
     * |        |          |0 = Dead-time insertion Disabled on the pin pair (PWM2, PWM3).
     * |        |          |1 = Dead-time insertion Enabled on the pin pair (PWM2, PWM3).
     * |        |          |Note: x=0~1 for PWM unit0~1.
     * |[18]    |DTEN4     |Dead-Time Insertion Enable Control For PWMx Pair (PWM4, PWM5)
     * |        |          |Dead-time insertion is only active when this pair of complementary PWM is enabled.
     * |        |          |If dead-time insertion is inactive, the outputs of pin pair are complementary without any delay.
     * |        |          |0 = Dead-time insertion Disabled on the pin pair (PWM4, PWM5).
     * |        |          |1 = Dead-time insertion Enabled on the pin pair (PWM4, PWM5).
     * |        |          |Note: x=0~1 for PWM unit0~1.
    */
    __IO uint32_t DTCTL;

    /**
     * BRKOUT
     * ===================================================================================================
     * Offset: 0x30  PWM Brake Output
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:5]   |BRKOUT    |PWM Brake Output
     * |        |          |When PWM Brake is asserted, the PWM0~5 output state before polarity control will follow PWM1 bit0~5 setting, respectively.
     * |        |          |0 = The PWMn output before polarity control is low when Brake is asserted.
     * |        |          |1 = The PWMn output before polarity control is high when Brake is asserted.
     * |        |          |Note: n = 0~5.
    */
    __IO uint32_t BRKOUT;

    /**
     * NPCTL
     * ===================================================================================================
     * Offset: 0x34  PWM Negative Polarity Control
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:5]   |NEGPOLAR  |PWM Negative Polarity Control
     * |        |          |The register bit controls polarity/active state of real PWM output.
     * |        |          |0 = PWMn output is active high.
     * |        |          |1 = PWMn output is active low.
     * |        |          |Note: n = 0~5.
    */
    __IO uint32_t NPCTL;

