MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC472JG8AE/mcu.h
    /**
     * ASYMCTL
     * ===================================================================================================
     * Offset: 0x38  Asymmetric PWM Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ASYMEN    |Asymmetric PWM Enable Control
     * |        |          |0 = Asymmetric PWM function Disabled.
     * |        |          |1 = Asymmetric PWM function Enabled.
     * |        |          |Note: This control bit is only valid when PWM module is set in Centre-aligned mode.
     * |[8:9]   |ASYMMODE0 |Asymmetric PWMx0 Reload Mode Setting
     * |        |          |00 = 1. PWM compare register 0 is reload PWM_Duty (PWMx0[15:0]) at PWM cycle start.
     * |        |          | 2. PWM module compares the PWM counter (PWMCNT) with PWM compare register 0 in up-counting cycle
     * |        |          |3.
     * |        |          |PWM compare output toggles at compare match, in the meanwhile, PWM compare register 0 is reloaded with CMP (ASPWMx0[15:00]).
     * |        |          | 4. PWM module compares the PWM counter (PWMCNT) with PWM compare register 0 in down-counting cycle.
     * |        |          |01 = 1. PWM compare register 0 is reload PWM_Duty (PWMx0[15:0]) at PWM cycle start.
     * |        |          | 2. PWM module compares the PWM counter (PWMCNT) with PWM compare register 0 in up-counting cycle
     * |        |          |3.
     * |        |          |PWM compare output toggles at compare match, in the meanwhile, PWM compare register 0 is reloaded with CMP (ASPWMx0[15:00]).
     * |        |          | 4. PWM module compares the PWM counter (PWMCNT) with PWM compare register 0 in up-counting cycle.
     * |        |          | 5. PWMx0 must be less than ASPWMx0
     * |        |          |10 = 1. PWM compare register 0 is reload PWM_Duty (PWMx0[15:0]) at PWM cycle start.
     * |        |          | 2. PWM module compares the PWM counter (PWMCNT) with PWM compare register 0 in down-counting cycle
     * |        |          |3.
     * |        |          |PWM compare output toggles at compare match, in the meanwhile, PWM compare register 0 is reloaded with CMP (ASPWMx0[15:00]).
     * |        |          | 4. PWM module compares the PWM counter (PWMCNT) with PWM compare register 0 in down-counting cycle.
     * |        |          | 5. PWMx0 must be greater than ASPWMx0.
     * |        |          |11 = Reserved.
     * |        |          |Note1: x=0~1 for PWM unit 0~1.
     * |        |          |Note2: This bit field is available only when ASYMEN=1.
     * |        |          |Note3: The setting will be effected at the condition of LOAD=1 and from the start of next PWM cycle.
     * |[16:17] |ASYMMODE2 |Asymmetric PWMx2 Reload Mode Setting
     * |        |          |00 = 1. PWM compare register 2 is reload PWM_Duty (PWMx2[15:0]) at PWM cycle start.
     * |        |          | 2. PWM module compares the PWM counter (PWMCNT) with PWM compare register 2 in up-counting cycle
     * |        |          |3.
     * |        |          |PWM compare output toggles at compare match, in the meanwhile, PWM compare register 2 is reloaded with CMP (ASPWMx2[15:00]).
     * |        |          | 4. PWM module compares the PWM counter (PWMCNT) with PWM compare register 2 in down-counting cycle.
     * |        |          |01 = 1. PWM compare register 2 is reload PWM_Duty (PWMx2[15:0]) at PWM cycle start.
     * |        |          | 2. PWM module compares the PWM counter (PWMCNT) with PWM compare register 2 in up-counting cycle
     * |        |          |3.
     * |        |          |PWM compare output toggles at compare match, in the meanwhile, PWM compare register2 is reloaded with CMP (ASPWMx2[15:00]).
     * |        |          | 4. PWM module compares the PWM counter (PWMCNT) with PWM compare register 2 in up-counting cycle.
     * |        |          | 5. PWMx2 must be less than ASPWMx2
     * |        |          |10 = 1. PWM compare register 2 is reload PWM_Duty (PWMx2[15:0]) at PWM cycle start.
     * |        |          | 2. PWM module compares the PWM counter (PWMCNT) with PWM compare register 2 in down-counting cycle
     * |        |          |3.
     * |        |          |PWM compare output toggles at compare match, in the meanwhile, PWM compare register 2 is reloaded with CMP (ASPWMx2[15:00]).
     * |        |          | 4. PWM module compares the PWM counter (PWMCNT) with PWM compare register 2 in down-counting cycle.
     * |        |          | 5. PWMx2 must be greater than ASPWMx2.
     * |        |          |11 = Reserved.
     * |        |          |Note1: x=0~1 for PWM unit 0~1.
     * |        |          |Note2: This bit field is available only when ASYMEN=1.
     * |        |          |Note3: The setting will be effected at the condition of LOAD=1 and from the start of next PWM cycle.
     * |[24:25] |ASYMMODE4 |Asymmetric PWMx4 Reload Mode Setting
     * |        |          |00 =  1. PWM compare register 4 is reload PWM_Duty (PWMx4[15:0]) at PWM cycle start.
     * |        |          | 2. PWM module compares the PWM counter (PWMCNT) with PWM compare register 4 in up-counting cycle
     * |        |          |3.
     * |        |          |PWM compare output toggles at compare match, in the meanwhile, PWM compare register 4 is reloaded with CMP (ASPWMx4[15:00]).
     * |        |          | 4. PWM module compares the PWM counter (PWMCNT) with PWM compare register 4 in down-counting cycle.
     * |        |          |01 = 1. PWM compare register 4 is reload PWM_Duty (PWMx4[15:0]) at PWM cycle start.
     * |        |          | 2. PWM module compares the PWM counter (PWMCNT) with PWM compare register 4 in up-counting cycle
     * |        |          |3.
     * |        |          |PWM compare output toggles at compare match, in the meanwhile, PWM compare register 0 is reloaded with CMP (ASPWMx4[15:00]).
     * |        |          | 4. PWM module compares the PWM counter (PWMCNT) with PWM compare register 4 in up-counting cycle.
     * |        |          | 5. PWMx4 must be less than ASPWMx4.
     * |        |          |10 = 1. PWM compare register 4 is reload PWM_Duty (PWMx4[15:0]) at PWM cycle start.
     * |        |          | 2. PWM module compares the PWM counter (PWMCNT) with PWM compare register 4 in down-counting cycle
     * |        |          |3.
     * |        |          |PWM compare output toggles at compare match, in the meanwhile, PWM compare register 4 is reloaded with CMP (ASPWMx4[15:00]).
     * |        |          | 4. PWM module compares the PWM counter (PWMCNT) with PWM compare register 4 in down-counting cycle.
     * |        |          | 5. PWMx4 must be greater than ASPWMx4.
     * |        |          |11= Reserved.
     * |        |          |Note1: x=0~1 for PWM unit 0~1.
     * |        |          |Note2: This bit field is available only when ASYMEN=1.
     * |        |          |Note3: The setting will be effected at the condition of LOAD=1 and from the start of next PWM cycle.
    */
    __IO uint32_t ASYMCTL;

    /**
     * PERIODCNT
     * ===================================================================================================
     * Offset: 0x3C  PIF Compared Counter
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |PERIODCNT |PIF Compared Counter
     * |        |          |The register sets the count number which defines how many times of PWM period occurs to set bit PIF to request the PWM period interrupt.
     * |        |          |PIF will be set in every (1 + PERIODCNT[3:0]) times of PWM period or center point defined by INTTYPE when EPWM_CTL [8] occurred.
    */
    __IO uint32_t PERIODCNT;

    /**
     * EINTCTL
     * ===================================================================================================
     * Offset: 0x40  PWM Edge Interrupt Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |EDGEIEN0  |PWMx0 Edge Interrupt Enable Control
     * |        |          |0 = Disabling flag EIF0 to trigger PWM interrupt.
     * |        |          |1 = Enabling flag EIF0 can trigger PWM interrupt.
     * |[1]     |EDGEIEN2  |PWMx2 Edge Interrupt Enable Control
     * |        |          |0 = Disabling flag EIF2 can trigger PWM interrupt.
     * |        |          |1 = Enabling flag EIF2 can trigger PWM interrupt.
     * |[2]     |EDGEIEN4  |PWMx4 Edge Interrupt Enable Control
     * |        |          |0 = Disable flag EIF4 to trigger PWM interrupt.
     * |        |          |1 = Enabling flag EIF4 can trigger PWM interrupt.
     * |[8]     |EINTTYPE0 |PWMx0 Edge Interrupt Type
     * |        |          |0 = EIF0 will be set if falling edge is detected at PWMx0.
     * |        |          |1 = EIF0 will be set if rising edge is detected at PWMx0.
     * |[9]     |EINTTYPE2 |PWMx2 Edge Interrupt Type
     * |        |          |0 = EIF2 will be set if falling edge is detected at PWMx2.
     * |        |          |1 = EIF2 will be set if rising edge is detected at PWMx2.
     * |[10]    |EINTTYPE4 |PWMx4 Edge Interrupt Type
     * |        |          |0 = EIF4 will be set if falling edge is detected at PWMx4.
     * |        |          |1 = EIF4 will be set if rising edge is detected at PWMx4.
    */
    __IO uint32_t EINTCTL;

    /**
     * OUTEN0
     * ===================================================================================================
     * Offset: 0x44  PWM Output Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |EVENOUTEN |PWM Even Ports Output Enable Control
     * |        |          |0 = PWM even ports output Disabled (PWM even ports at tri-state).
     * |        |          |1 = PWM even ports output Enabled.
     * |[1]     |ODDOUTEN  |PWM Odd Ports Output Enable Control
     * |        |          |0 = PWM odd ports output Disabled (PWM even ports at tri-state).
     * |        |          |1 = PWM odd ports output Enabled.
    */
    __IO uint32_t OUTEN0;

} EPWM_T;

/**
    @addtogroup EPWM_CONST EPWM Bit Field Definition
    Constant Definitions for EPWM Controller
@{ */

#define EPWM_CTL_MODE_Pos                (0)                                               /*!< EPWM_T::CTL: MODE Position                */
#define EPWM_CTL_MODE_Msk                (0x3ul << EPWM_CTL_MODE_Pos)                      /*!< EPWM_T::CTL: MODE Mask                    */

#define EPWM_CTL_CLKDIV_Pos              (2)                                               /*!< EPWM_T::CTL: CLKDIV Position              */
#define EPWM_CTL_CLKDIV_Msk              (0x3ul << EPWM_CTL_CLKDIV_Pos)                    /*!< EPWM_T::CTL: CLKDIV Mask                  */

