MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC472JG8AE/mcu.h
#define EPWM_CTL_PWMIEN_Pos              (4)                                               /*!< EPWM_T::CTL: PWMIEN Position              */
#define EPWM_CTL_PWMIEN_Msk              (0x1ul << EPWM_CTL_PWMIEN_Pos)                    /*!< EPWM_T::CTL: PWMIEN Mask                  */

#define EPWM_CTL_BRKIEN_Pos              (5)                                               /*!< EPWM_T::CTL: BRKIEN Position              */
#define EPWM_CTL_BRKIEN_Msk              (0x1ul << EPWM_CTL_BRKIEN_Pos)                    /*!< EPWM_T::CTL: BRKIEN Mask                  */

#define EPWM_CTL_LOAD_Pos                (6)                                               /*!< EPWM_T::CTL: LOAD Position                */
#define EPWM_CTL_LOAD_Msk                (0x1ul << EPWM_CTL_LOAD_Pos)                      /*!< EPWM_T::CTL: LOAD Mask                    */

#define EPWM_CTL_CNTEN_Pos               (7)                                               /*!< EPWM_T::CTL: CNTEN Position               */
#define EPWM_CTL_CNTEN_Msk               (0x1ul << EPWM_CTL_CNTEN_Pos)                     /*!< EPWM_T::CTL: CNTEN Mask                   */

#define EPWM_CTL_INTTYPE_Pos             (8)                                               /*!< EPWM_T::CTL: INTTYPE Position             */
#define EPWM_CTL_INTTYPE_Msk             (0x1ul << EPWM_CTL_INTTYPE_Pos)                   /*!< EPWM_T::CTL: INTTYPE Mask                 */

#define EPWM_CTL_PINV_Pos                (9)                                               /*!< EPWM_T::CTL: PINV Position                */
#define EPWM_CTL_PINV_Msk                (0x1ul << EPWM_CTL_PINV_Pos)                      /*!< EPWM_T::CTL: PINV Mask                    */

#define EPWM_CTL_CNTCLR_Pos              (11)                                              /*!< EPWM_T::CTL: CNTCLR Position              */
#define EPWM_CTL_CNTCLR_Msk              (0x1ul << EPWM_CTL_CNTCLR_Pos)                    /*!< EPWM_T::CTL: CNTCLR Mask                  */

#define EPWM_CTL_CNTTYPE_Pos             (12)                                              /*!< EPWM_T::CTL: CNTTYPE Position             */
#define EPWM_CTL_CNTTYPE_Msk             (0x1ul << EPWM_CTL_CNTTYPE_Pos)                   /*!< EPWM_T::CTL: CNTTYPE Mask                 */

#define EPWM_CTL_GROUPEN_Pos             (13)                                              /*!< EPWM_T::CTL: GROUPEN Position             */
#define EPWM_CTL_GROUPEN_Msk             (0x1ul << EPWM_CTL_GROUPEN_Pos)                   /*!< EPWM_T::CTL: GROUPEN Mask                 */

#define EPWM_CTL_BRKP0INV_Pos            (14)                                              /*!< EPWM_T::CTL: BRKP0INV Position            */
#define EPWM_CTL_BRKP0INV_Msk            (0x1ul << EPWM_CTL_BRKP0INV_Pos)                  /*!< EPWM_T::CTL: BRKP0INV Mask                */

#define EPWM_CTL_BRKP1INV_Pos            (15)                                              /*!< EPWM_T::CTL: BRKP1INV Position            */
#define EPWM_CTL_BRKP1INV_Msk            (0x1ul << EPWM_CTL_BRKP1INV_Pos)                  /*!< EPWM_T::CTL: BRKP1INV Mask                */

#define EPWM_CTL_BRKP0EN_Pos             (16)                                              /*!< EPWM_T::CTL: BRKP0EN Position             */
#define EPWM_CTL_BRKP0EN_Msk             (0x1ul << EPWM_CTL_BRKP0EN_Pos)                   /*!< EPWM_T::CTL: BRKP0EN Mask                 */

#define EPWM_CTL_BRKP1EN_Pos             (17)                                              /*!< EPWM_T::CTL: BRKP1EN Position             */
#define EPWM_CTL_BRKP1EN_Msk             (0x1ul << EPWM_CTL_BRKP1EN_Pos)                   /*!< EPWM_T::CTL: BRKP1EN Mask                 */

#define EPWM_CTL_BRK1SEL_Pos             (18)                                              /*!< EPWM_T::CTL: BRK1SEL Position             */
#define EPWM_CTL_BRK1SEL_Msk             (0x3ul << EPWM_CTL_BRK1SEL_Pos)                   /*!< EPWM_T::CTL: BRK1SEL Mask                 */

#define EPWM_CTL_BRK0NFSEL_Pos           (20)                                              /*!< EPWM_T::CTL: BRK0NFSEL Position           */
#define EPWM_CTL_BRK0NFSEL_Msk           (0x3ul << EPWM_CTL_BRK0NFSEL_Pos)                 /*!< EPWM_T::CTL: BRK0NFSEL Mask               */

#define EPWM_CTL_BRK1NFSEL_Pos           (22)                                              /*!< EPWM_T::CTL: BRK1NFSEL Position           */
#define EPWM_CTL_BRK1NFSEL_Msk           (0x3ul << EPWM_CTL_BRK1NFSEL_Pos)                 /*!< EPWM_T::CTL: BRK1NFSEL Mask               */

#define EPWM_CTL_CPO0BKEN_Pos            (24)                                              /*!< EPWM_T::CTL: CPO0BKEN Position            */
#define EPWM_CTL_CPO0BKEN_Msk            (0x1ul << EPWM_CTL_CPO0BKEN_Pos)                  /*!< EPWM_T::CTL: CPO0BKEN Mask                */

#define EPWM_CTL_CPO1BKEN_Pos            (25)                                              /*!< EPWM_T::CTL: CPO1BKEN Position            */
#define EPWM_CTL_CPO1BKEN_Msk            (0x1ul << EPWM_CTL_CPO1BKEN_Pos)                  /*!< EPWM_T::CTL: CPO1BKEN Mask                */

#define EPWM_CTL_CPO2BKEN_Pos            (26)                                              /*!< EPWM_T::CTL: CPO2BKEN Position            */
#define EPWM_CTL_CPO2BKEN_Msk            (0x1ul << EPWM_CTL_CPO2BKEN_Pos)                  /*!< EPWM_T::CTL: CPO2BKEN Mask                */

#define EPWM_CTL_LVDBKEN_Pos             (27)                                              /*!< EPWM_T::CTL: LVDBKEN Position             */
#define EPWM_CTL_LVDBKEN_Msk             (0x1ul << EPWM_CTL_LVDBKEN_Pos)                   /*!< EPWM_T::CTL: LVDBKEN Mask                 */

#define EPWM_CTL_BRK0NFDIS_Pos           (28)                                              /*!< EPWM_T::CTL: BRK0NFDIS Position           */
#define EPWM_CTL_BRK0NFDIS_Msk           (0x1ul << EPWM_CTL_BRK0NFDIS_Pos)                 /*!< EPWM_T::CTL: BRK0NFDIS Mask               */

#define EPWM_CTL_BRK1NFDIS_Pos           (29)                                              /*!< EPWM_T::CTL: BRK1NFDIS Position           */
#define EPWM_CTL_BRK1NFDIS_Msk           (0x1ul << EPWM_CTL_BRK1NFDIS_Pos)                 /*!< EPWM_T::CTL: BRK1NFDIS Mask               */

#define EPWM_CTL_CTRLD_Pos               (31)                                              /*!< EPWM_T::CTL: CTRLD Position               */
#define EPWM_CTL_CTRLD_Msk               (0x1ul << EPWM_CTL_CTRLD_Pos)                     /*!< EPWM_T::CTL: CTRLD Mask                   */

#define EPWM_STATUS_BRKIF0_Pos           (0)                                               /*!< EPWM_T::STATUS: BRKIF0 Position           */
#define EPWM_STATUS_BRKIF0_Msk           (0x1ul << EPWM_STATUS_BRKIF0_Pos)                 /*!< EPWM_T::STATUS: BRKIF0 Mask               */

#define EPWM_STATUS_BRKIF1_Pos           (1)                                               /*!< EPWM_T::STATUS: BRKIF1 Position           */
#define EPWM_STATUS_BRKIF1_Msk           (0x1ul << EPWM_STATUS_BRKIF1_Pos)                 /*!< EPWM_T::STATUS: BRKIF1 Mask               */

#define EPWM_STATUS_PIF_Pos              (2)                                               /*!< EPWM_T::STATUS: PIF Position              */
#define EPWM_STATUS_PIF_Msk              (0x1ul << EPWM_STATUS_PIF_Pos)                    /*!< EPWM_T::STATUS: PIF Mask                  */

#define EPWM_STATUS_EIF0_Pos             (4)                                               /*!< EPWM_T::STATUS: EIF0 Position             */
#define EPWM_STATUS_EIF0_Msk             (0x1ul << EPWM_STATUS_EIF0_Pos)                   /*!< EPWM_T::STATUS: EIF0 Mask                 */

