MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC472JG8AE/mcu.h
#define EPWM_STATUS_EIF2_Pos             (5)                                               /*!< EPWM_T::STATUS: EIF2 Position             */
#define EPWM_STATUS_EIF2_Msk             (0x1ul << EPWM_STATUS_EIF2_Pos)                   /*!< EPWM_T::STATUS: EIF2 Mask                 */

#define EPWM_STATUS_EIF4_Pos             (6)                                               /*!< EPWM_T::STATUS: EIF4 Position             */
#define EPWM_STATUS_EIF4_Msk             (0x1ul << EPWM_STATUS_EIF4_Pos)                   /*!< EPWM_T::STATUS: EIF4 Mask                 */

#define EPWM_STATUS_BRK0LOCK_Pos         (8)                                               /*!< EPWM_T::STATUS: BRK0LOCK Position         */
#define EPWM_STATUS_BRK0LOCK_Msk         (0x1ul << EPWM_STATUS_BRK0LOCK_Pos)               /*!< EPWM_T::STATUS: BRK0LOCK Mask             */

#define EPWM_STATUS_BRK0STS_Pos          (24)                                              /*!< EPWM_T::STATUS: BRK0STS Position          */
#define EPWM_STATUS_BRK0STS_Msk          (0x1ul << EPWM_STATUS_BRK0STS_Pos)                /*!< EPWM_T::STATUS: BRK0STS Mask              */

#define EPWM_STATUS_BRK1STS_Pos          (25)                                              /*!< EPWM_T::STATUS: BRK1STS Position          */
#define EPWM_STATUS_BRK1STS_Msk          (0x1ul << EPWM_STATUS_BRK1STS_Pos)                /*!< EPWM_T::STATUS: BRK1STS Mask              */

#define EPWM_PERIOD_PERIOD_Pos           (0)                                               /*!< EPWM_T::PERIOD: PERIOD Position           */
#define EPWM_PERIOD_PERIOD_Msk           (0xfffful << EPWM_PERIOD_PERIOD_Pos)              /*!< EPWM_T::PERIOD: PERIOD Mask               */

#define EPWM_CMPDAT0_CMP_Pos             (0)                                               /*!< EPWM_T::CMPDAT0: CMP Position             */
#define EPWM_CMPDAT0_CMP_Msk             (0xfffful << EPWM_CMPDAT0_CMP_Pos)                /*!< EPWM_T::CMPDAT0: CMP Mask                 */

#define EPWM_CMPDAT2_CMP_Pos             (0)                                               /*!< EPWM_T::CMPDAT2: CMP Position             */
#define EPWM_CMPDAT2_CMP_Msk             (0xfffful << EPWM_CMPDAT2_CMP_Pos)                /*!< EPWM_T::CMPDAT2: CMP Mask                 */

#define EPWM_CMPDAT4_CMP_Pos             (0)                                               /*!< EPWM_T::CMPDAT4: CMP Position             */
#define EPWM_CMPDAT4_CMP_Msk             (0xfffful << EPWM_CMPDAT4_CMP_Pos)                /*!< EPWM_T::CMPDAT4: CMP Mask                 */

#define EPWM_MSKEN_MSKEN_Pos             (0)                                               /*!< EPWM_T::MSKEN: MSKEN Position             */
#define EPWM_MSKEN_MSKEN_Msk             (0x3ful << EPWM_MSKEN_MSKEN_Pos)                  /*!< EPWM_T::MSKEN: MSKEN Mask                 */

#define EPWM_MSK_MSKDAT_Pos              (0)                                               /*!< EPWM_T::MSK: MSKDAT Position              */
#define EPWM_MSK_MSKDAT_Msk              (0x3ful << EPWM_MSK_MSKDAT_Pos)                   /*!< EPWM_T::MSK: MSKDAT Mask                  */

#define EPWM_ASYMCMP0_CMP_Pos            (0)                                               /*!< EPWM_T::ASYMCMP0: CMP Position            */
#define EPWM_ASYMCMP0_CMP_Msk            (0xfffful << EPWM_ASYMCMP0_CMP_Pos)               /*!< EPWM_T::ASYMCMP0: CMP Mask                */

#define EPWM_ASYMCMP2_CMP_Pos            (0)                                               /*!< EPWM_T::ASYMCMP2: CMP Position            */
#define EPWM_ASYMCMP2_CMP_Msk            (0xfffful << EPWM_ASYMCMP2_CMP_Pos)               /*!< EPWM_T::ASYMCMP2: CMP Mask                */

#define EPWM_ASYMCMP4_CMP_Pos            (0)                                               /*!< EPWM_T::ASYMCMP4: CMP Position            */
#define EPWM_ASYMCMP4_CMP_Msk            (0xfffful << EPWM_ASYMCMP4_CMP_Pos)               /*!< EPWM_T::ASYMCMP4: CMP Mask                */

#define EPWM_DTCTL_DTCNT_Pos             (0)                                               /*!< EPWM_T::DTCTL: DTCNT Position             */
#define EPWM_DTCTL_DTCNT_Msk             (0x7fful << EPWM_DTCTL_DTCNT_Pos)                 /*!< EPWM_T::DTCTL: DTCNT Mask                 */

#define EPWM_DTCTL_DTEN0_Pos             (16)                                              /*!< EPWM_T::DTCTL: DTEN0 Position             */
#define EPWM_DTCTL_DTEN0_Msk             (0x1ul << EPWM_DTCTL_DTEN0_Pos)                   /*!< EPWM_T::DTCTL: DTEN0 Mask                 */

#define EPWM_DTCTL_DTEN2_Pos             (17)                                              /*!< EPWM_T::DTCTL: DTEN2 Position             */
#define EPWM_DTCTL_DTEN2_Msk             (0x1ul << EPWM_DTCTL_DTEN2_Pos)                   /*!< EPWM_T::DTCTL: DTEN2 Mask                 */

#define EPWM_DTCTL_DTEN4_Pos             (18)                                              /*!< EPWM_T::DTCTL: DTEN4 Position             */
#define EPWM_DTCTL_DTEN4_Msk             (0x1ul << EPWM_DTCTL_DTEN4_Pos)                   /*!< EPWM_T::DTCTL: DTEN4 Mask                 */

#define EPWM_BRKOUT_BRKOUT_Pos           (0)                                               /*!< EPWM_T::BRKOUT: BRKOUT Position           */
#define EPWM_BRKOUT_BRKOUT_Msk           (0x3ful << EPWM_BRKOUT_BRKOUT_Pos)                /*!< EPWM_T::BRKOUT: BRKOUT Mask               */

#define EPWM_NPCTL_NEGPOLAR_Pos          (0)                                               /*!< EPWM_T::NPCTL: NEGPOLAR Position          */
#define EPWM_NPCTL_NEGPOLAR_Msk          (0x3ful << EPWM_NPCTL_NEGPOLAR_Pos)               /*!< EPWM_T::NPCTL: NEGPOLAR Mask              */

#define EPWM_ASYMCTL_ASYMEN_Pos          (0)                                               /*!< EPWM_T::ASYMCTL: ASYMEN Position          */
#define EPWM_ASYMCTL_ASYMEN_Msk          (0x1ul << EPWM_ASYMCTL_ASYMEN_Pos)                /*!< EPWM_T::ASYMCTL: ASYMEN Mask              */

#define EPWM_ASYMCTL_ASYMMODE0_Pos       (8)                                               /*!< EPWM_T::ASYMCTL: ASYMMODE0 Position       */
#define EPWM_ASYMCTL_ASYMMODE0_Msk       (0x3ul << EPWM_ASYMCTL_ASYMMODE0_Pos)             /*!< EPWM_T::ASYMCTL: ASYMMODE0 Mask           */

#define EPWM_ASYMCTL_ASYMMODE2_Pos       (16)                                              /*!< EPWM_T::ASYMCTL: ASYMMODE2 Position       */
#define EPWM_ASYMCTL_ASYMMODE2_Msk       (0x3ul << EPWM_ASYMCTL_ASYMMODE2_Pos)             /*!< EPWM_T::ASYMCTL: ASYMMODE2 Mask           */

#define EPWM_ASYMCTL_ASYMMODE4_Pos       (24)                                              /*!< EPWM_T::ASYMCTL: ASYMMODE4 Position       */
#define EPWM_ASYMCTL_ASYMMODE4_Msk       (0x3ul << EPWM_ASYMCTL_ASYMMODE4_Pos)             /*!< EPWM_T::ASYMCTL: ASYMMODE4 Mask           */

#define EPWM_PERIODCNT_PERIODCNT_Pos     (0)                                               /*!< EPWM_T::PERIODCNT: PERIODCNT Position     */
#define EPWM_PERIODCNT_PERIODCNT_Msk     (0xful << EPWM_PERIODCNT_PERIODCNT_Pos)           /*!< EPWM_T::PERIODCNT: PERIODCNT Mask         */

#define EPWM_EINTCTL_EDGEIEN0_Pos        (0)                                               /*!< EPWM_T::EINTCTL: EDGEIEN0 Position        */
#define EPWM_EINTCTL_EDGEIEN0_Msk        (0x1ul << EPWM_EINTCTL_EDGEIEN0_Pos)              /*!< EPWM_T::EINTCTL: EDGEIEN0 Mask            */

