MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC472JG8AE/mcu.h
#define EPWM_EINTCTL_EDGEIEN2_Pos        (1)                                               /*!< EPWM_T::EINTCTL: EDGEIEN2 Position        */
#define EPWM_EINTCTL_EDGEIEN2_Msk        (0x1ul << EPWM_EINTCTL_EDGEIEN2_Pos)              /*!< EPWM_T::EINTCTL: EDGEIEN2 Mask            */

#define EPWM_EINTCTL_EDGEIEN4_Pos        (2)                                               /*!< EPWM_T::EINTCTL: EDGEIEN4 Position        */
#define EPWM_EINTCTL_EDGEIEN4_Msk        (0x1ul << EPWM_EINTCTL_EDGEIEN4_Pos)              /*!< EPWM_T::EINTCTL: EDGEIEN4 Mask            */

#define EPWM_EINTCTL_EINTTYPE0_Pos       (8)                                               /*!< EPWM_T::EINTCTL: EINTTYPE0 Position       */
#define EPWM_EINTCTL_EINTTYPE0_Msk       (0x1ul << EPWM_EINTCTL_EINTTYPE0_Pos)             /*!< EPWM_T::EINTCTL: EINTTYPE0 Mask           */

#define EPWM_EINTCTL_EINTTYPE2_Pos       (9)                                               /*!< EPWM_T::EINTCTL: EINTTYPE2 Position       */
#define EPWM_EINTCTL_EINTTYPE2_Msk       (0x1ul << EPWM_EINTCTL_EINTTYPE2_Pos)             /*!< EPWM_T::EINTCTL: EINTTYPE2 Mask           */

#define EPWM_EINTCTL_EINTTYPE4_Pos       (10)                                              /*!< EPWM_T::EINTCTL: EINTTYPE4 Position       */
#define EPWM_EINTCTL_EINTTYPE4_Msk       (0x1ul << EPWM_EINTCTL_EINTTYPE4_Pos)             /*!< EPWM_T::EINTCTL: EINTTYPE4 Mask           */

#define EPWM_OUTEN0_EVENOUTEN_Pos        (0)                                               /*!< EPWM_T::OUTEN0: EVENOUTEN Position        */
#define EPWM_OUTEN0_EVENOUTEN_Msk        (0x1ul << EPWM_OUTEN0_EVENOUTEN_Pos)              /*!< EPWM_T::OUTEN0: EVENOUTEN Mask            */

#define EPWM_OUTEN0_ODDOUTEN_Pos         (1)                                               /*!< EPWM_T::OUTEN0: ODDOUTEN Position         */
#define EPWM_OUTEN0_ODDOUTEN_Msk         (0x1ul << EPWM_OUTEN0_ODDOUTEN_Pos)               /*!< EPWM_T::OUTEN0: ODDOUTEN Mask             */

/**@}*/ /* EPWM_CONST */
/**@}*/ /* end of EPWM register group */


/*---------------------- Flash Memory Controller -------------------------*/
/**
    @addtogroup FMC Flash Memory Controller(FMC)
    Memory Mapped Structure for FMC Controller
@{ */

typedef struct {
    /**
     * ISPCTL
     * ===================================================================================================
     * Offset: 0x00  ISP Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ISPEN     |ISP Enable Control (Write Protect)
     * |        |          |ISP function enable bit. Set this bit to enable ISP function.
     * |        |          |0 = ISP function Disabled.
     * |        |          |1 = ISP function Enabled.
     * |[1]     |BS        |Boot Select (Write Protect)
     * |        |          |Set/clear this bit to select next booting from LDROM/APROM, respectively.
     * |        |          |This bit also functions as chip booting status flag, which can be used to check where chip booted from.
     * |        |          |This bit is initiated with the inversed value of CBS in Config0 after any reset is happened except CPU reset (RSTS_CPU is 1) or system reset (RSTS_SYS) is happened.
     * |        |          |0 = Boot from APROM.
     * |        |          |1 = Boot from LDROM.
     * |[3]     |APUEN     |APROM Up2025-06-10 Enable Control (Write Protect)
     * |        |          |0 = APROM cannot be up2025-06-10d when the chip runs in APROM.
     * |        |          |1 = APROM can be up2025-06-10d when the chip runs in APROM.
     * |[4]     |CFGUEN    |Config-Bits Up2025-06-10 By ISP (Write Protect) Enable Control
     * |        |          |0 = ISP Disabled to up2025-06-10 config-bits.
     * |        |          |1 = ISP Enabled to up2025-06-10 config-bits at KEYMATCH flag active (bit7 of ISPSTS).
     * |        |          |Note: This bit is fixed to 0 in Secure mode.
     * |[5]     |LDUEN     |LDROM Up2025-06-10 Enable Control (Write Protect)
     * |        |          |LDROM up2025-06-10 enable bit.
     * |        |          |0 = LDROM cannot be up2025-06-10d.
     * |        |          |1 = LDROM can be up2025-06-10d at KEYMATCH flag active (bit7 of ISPSTS).
     * |        |          |Note: This bit is fixed to 0 in Secure mode.
     * |[6]     |ISPFF     |ISP Fail Flag (Write Protect)
     * |        |          |This bit is set by hardware when a triggered ISP meets any of the following conditions:
     * |        |          |(1) APROM writes to itself if APUEN is set to 0.
     * |        |          |(2) LDROM writes to itself if LDUEN is set to 0.
     * |        |          |(3) CONFIG is erased/programmed if CFGUEN is set to 0.
     * |        |          |(4) Destination address is illegal, such as over an available range.
     * |        |          |Note: This bit needs to be cleared by writing 1 to it.
    */
    __IO uint32_t ISPCTL;

    /**
     * ISPADDR
     * ===================================================================================================
     * Offset: 0x04  ISP Address Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |ISPADR    |ISP Address
     * |        |          |The NUC442/NUC472 series is equipped with an embedded flash and supports word program only.
     * |        |          |ISPADR[1:0] must be kept 00b for ISP operation.
    */
    __IO uint32_t ISPADDR;

    /**
     * ISPDAT
     * ===================================================================================================
     * Offset: 0x08  ISP Data Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |ISPDAT    |ISP Data
     * |        |          |Write data to this register before ISP program operation.
     * |        |          |Read data from this register after ISP read operation.
    */
    __IO uint32_t ISPDAT;

    /**
     * ISPCMD
     * ===================================================================================================
     * Offset: 0x0C  ISP Command Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:5]   |CMD       |ISP Command
     * |        |          |Please check the table below for ISP commands.
    */
    __IO uint32_t ISPCMD;

    /**
     * ISPTRG
     * ===================================================================================================
     * Offset: 0x10  ISP Trigger Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ISPGO     |ISP Start Trigger
     * |        |          |Write 1 to start ISP operation and this bit will be cleared to 0 by hardware automatically when ISP operation is finished.
     * |        |          |0 = ISP operation is finished.
     * |        |          |1 = ISP is progressed.
     * |        |          |This bit is the protected bit, It means programming this bit needs to write "59h", "16h", "88h" to address 0x4000_0100 to disable register protection.
     * |        |          |Refer to the register REGWRPROT at address GCR_BA+0x100.
    */
    __IO uint32_t ISPTRG;

    /**
     * DFBA
     * ===================================================================================================
     * Offset: 0x14  Data Flash Base Address
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |DFBA      |Data Flash Base Address
     * |        |          |This register indicates data flash start address. It is a read only register.
     * |        |          |The data flash is shared with APROM and data flash size is defined by user configuration and the content of this register is loaded from Config1.
    */
    __I  uint32_t DFBA;

    /**
     * FTCTL
     * ===================================================================================================
     * Offset: 0x18  Flash Access Time Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[4:6]   |FOM       |Frequency Optimization Mode (Write Protect)
     * |        |          |When chip operation frequency is lower, chip can work more efficiently by setting FOM bits
     * |        |          |FOM[2:0]
     * |        |          |Optimized   Frequency (OF)
     * |        |          |001
     * |        |          |0   MHz < OF <= 24 MHz
     * |        |          |010
     * |        |          |24   MHz < OF <= 48 MHz
     * |        |          |011
     * |        |          |48   MHz < OF <= 72 MHz
     * |        |          |others
     * |        |          |Reserved
    */
    __IO uint32_t FTCTL;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE0[9];
    /// @endcond //HIDDEN_SYMBOLS

    /**
     * ISPSTS
     * ===================================================================================================
     * Offset: 0x40  Flash Access Time Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ISPBUSY   |ISP busy flag
     * |        |          |0 = ISP operation is finished.
     * |        |          |1 = ISP is progressed.
     * |[2:1]   |CBS       |Chip boot selection mode
     * |        |          |This CBS field is just a copy of User-Configuration Config0 CBS[7:6].
     * |[6]     |ISPFF     |ISP Fail Flag (Write Protect)
     * |        |          |This bit is set by hardware when a triggered ISP meets any of the following conditions:
     * |        |          |(1) APROM writes to itself if APUEN is set to 0.
     * |        |          |(2) LDROM writes to itself if LDUEN is set to 0.
     * |        |          |(3) CONFIG is erased/programmed if CFGUEN is set to 0.
     * |        |          |(4) Destination address is illegal, such as over an available range.
     * |        |          |Note: This bit needs to be cleared by writing 1 to it.
     * |[20:9]  |VECMAP    |Vector Page Mapping Address (Read Only)
     * |        |          |The current flash address space 0x0000_0000~0x0000_07FF is mapping to
     * |        |          |address {VECMAP[11:2], 0x000} ~ {VECMAP[11:2], 0x7FF}
     * |        |          |VECMAP[1:0] is needed to set 0.
     * |[26]    |CFGCRCF   |User-Configuration CRC Check Flag (Read Only)
     * |        |          |This bit is set by hardware when detecting CONFIG CRC checksum is error
     * |        |          |0 = CONFIG CRC checksum is OK.
     * |        |          |1 = CONFIG CRC checksum error and force chip into LOCK mode.
    */
    __IO uint32_t ISPSTS;

    /**
     * FBWP
     * ===================================================================================================
     * Offset: 0x44  Flash Block Write Protect Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |BWP       |Flash Block Write Protect Control
     * |        |          |If BWP.N bit is set to 0, the APROM memory relative region cannot program and erase by ISP. (N=0~31).
     * |        |          |Bit Block   Protect Region
     * |        |          |BWP0        0x00_0000   ~ 0x00_3FFF
     * |        |          |BWP1        0x00_4000   ~ 0x00_7FFF
     * |        |          |BWP2        0x00_8000   ~ 0x00_BFFF
     * |        |          |BWP3        0x00_C000   ~ 0x00_FFFF
     * |        |          |BWP4        0x01_0000   ~ 0x01_3FFF
     * |        |          |BWP5        0x01_4000   ~ 0x01_7FFF
     * |        |          |BWP6        0x01_8000   ~ 0x01_BFFF
     * |        |          |BWP7        0x01_C000   ~ 0x01_FFFF
     * |        |          |BWP8        0x02_0000   ~ 0x02_3FFF
     * |        |          |BWP9        0x02_4000   ~ 0x02_7FFF
     * |        |          |BWP10       0x02_8000   ~ 0x02_BFFF
     * |        |          |BWP11       0x02_C000   ~ 0x02_FFFF
     * |        |          |BWP12       0x03_0000   ~ 0x03_3FFF
     * |        |          |BWP13       0x03_4000   ~ 0x03_7FFF
     * |        |          |BWP14       0x03_8000   ~ 0x03_BFFF
     * |        |          |BWP15       0x03_C000   ~ 0x03_FFFF
     * |        |          |BWP16       0x04_0000   ~ 0x04_3FFF
     * |        |          |BWP17       0x04_4000   ~ 0x04_7FFF
     * |        |          |BWP18       0x04_8000   ~ 0x04_BFFF
     * |        |          |BWP19       0x04_C000   ~ 0x04_FFFF
     * |        |          |BWP20       0x05_0000   ~ 0x05_3FFF
     * |        |          |BWP21       0x05_4000   ~ 0x05_7FFF
     * |        |          |BWP22       0x05_8000   ~ 0x05_BFFF
     * |        |          |BWP23       0x05_C000   ~ 0x05_FFFF
     * |        |          |BWP24       0x06_0000   ~ 0x06_3FFF
     * |        |          |BWP25       0x06_4000   ~ 0x06_7FFF
     * |        |          |BWP26       0x06_8000   ~ 0x06_BFFF
     * |        |          |BWP27       0x06_C000   ~ 0x06_FFFF
     * |        |          |BWP28       0x07_0000   ~ 0x07_3FFF
     * |        |          |BWP29       0x07_4000   ~ 0x07_7FFF
     * |        |          |BWP30       0x07_8000   ~ 0x07_BFFF
     * |        |          |BWP31       0x07_C000   ~ 0x07_FFFF
     * |        |          |This register is loaded from Config2 when chip is power on.
     * |        |          |It is read only, except the correct Super Key is matched.
     * |        |          |This register is also a protected bit which means programming this bit needs to write "59h", "16h", "88h" to address GCR_BA+0x100 to disable register protection.
     * |        |          |Refer to the register REGWRPROT at address GCR_BA+0x100.
    */
    __IO uint32_t FBWP;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE1[14];
    /// @endcond //HIDDEN_SYMBOLS

    /**
     * MPDAT0
     * ===================================================================================================
     * Offset: 0x80  ISP Data 0 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |ISPDAT0   |ISP Data 0
     * |        |          |This register is the first 32-bit data for 32b/64b/multi-word program,
     * |        |          |and it is also the mirror of FMC_ISPDAT register, both registers keep the same data.
    */
    __IO uint32_t MPDAT0;

    /**
     * MPDAT1
     * ===================================================================================================
     * Offset: 0x84  ISP Data 1 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |ISPDAT1   |ISP Data 1
     * |        |          |This register is the second 32-bit data for 32b/64b/multi-word program.
    */
    __IO uint32_t MPDAT1;

    /**
     * MPDAT2
     * ===================================================================================================
     * Offset: 0x88  ISP Data 2 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |ISPDAT2   |ISP Data 2
     * |        |          |This register is the third 32-bit data for 32b/64b/multi-word program.
    */
    __IO uint32_t MPDAT2;

    /**
     * MPDAT3
     * ===================================================================================================
     * Offset: 0x8C  ISP Data 1 Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |ISPDAT3   |ISP Data 3
     * |        |          |This register is the fourth 32-bit data for 32b/64b/multi-word program.
    */
    __IO uint32_t MPDAT3;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE2[12];
    /// @endcond //HIDDEN_SYMBOLS

    /**
     * MPSTS
     * ===================================================================================================
     * Offset: 0xC0  ISP Multi-Word Program Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |MPBUSY   |ISP Multi-Word Program Busy Flag (Read Only)
     * |        |          |0 = ISP Multi-Word Program operation is aborted or finished.
     * |        |          |1 = ISP Multi-Word Program operation is progressed.
     * |[2]     |ISPFF     |ISP Fail Flag (Read Only)
     * |        |          |This CBS field is just a copy of User-Configuration Config0 CBS[7:6].
     * |[4]     |D0        |ISP DATA 0 Flag (Read Only)
     * |        |          |This bit is set when FMC_MPDAT0 is written and auto-clear to 0
     * |        |          |when the FMC_MPDAT0 is programmed to flash complete.
     * |        |          |0 = FMC_MPDAT0 register is empty, or program to flash complete.
     * |        |          |1 = FMC_MPDAT0 register has been written, and not programmed to flash yet.
     * |[5]     |D1        |ISP DATA 1 Flag (Read Only)
     * |        |          |This bit is set when FMC_MPDAT1 is written and auto-clear to 0
     * |        |          |when the FMC_MPDAT1 is programmed to flash complete.
     * |        |          |0 = FMC_MPDAT1 register is empty, or program to flash complete.
     * |        |          |1 = FMC_MPDAT1 register has been written, and not programmed to flash yet.
     * |[6]     |D2        |ISP DATA 2 Flag (Read Only)
     * |        |          |This bit is set when FMC_MPDAT2 is written and auto-clear to 0
     * |        |          |when the FMC_MPDAT2 is programmed to flash complete.
     * |        |          |0 = FMC_MPDAT2 register is empty, or program to flash complete.
     * |        |          |1 = FMC_MPDAT2 register has been written, and not programmed to flash yet.
     * |[7]     |D3        |ISP DATA 3 Flag (Read Only)
     * |        |          |This bit is set when FMC_MPDAT3 is written and auto-clear to 0
     * |        |          |when the FMC_MPDAT3 is programmed to flash complete.
     * |        |          |0 = FMC_MPDAT3 register is empty, or program to flash complete.
     * |        |          |1 = FMC_MPDAT3 register has been written, and not programmed to flash yet.
    */
    __IO uint32_t MPSTS;

    /**
     * MPADDR
     * ===================================================================================================
     * Offset: 0xC4  ISP Multi-Word Program Address Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |MPADDR    |ISP Multi-Word Program Address Status
     * |        |          |MPADDR is the address of ISP Multi-Word Program operation when
     * |        |          |MPBUSY flag is 1. MPADDR will keep the final address when
     * |        |          |Multi-Word Program is aborted or finished.
    */
    __IO uint32_t MPADDR;

} FMC_T;


/**
    @addtogroup FMC_CONST FMC Bit Field Definition
    Constant Definitions for FMC Controller
@{ */

#define FMC_ISPCTL_ISPEN_Pos             (0)                                               /*!< FMC_T::ISPCTL: ISPEN Position             */
#define FMC_ISPCTL_ISPEN_Msk             (0x1ul << FMC_ISPCTL_ISPEN_Pos)                   /*!< FMC_T::ISPCTL: ISPEN Mask                 */

#define FMC_ISPCTL_BS_Pos                (1)                                               /*!< FMC_T::ISPCTL: BS Position                */
#define FMC_ISPCTL_BS_Msk                (0x1ul << FMC_ISPCTL_BS_Pos)                      /*!< FMC_T::ISPCTL: BS Mask                    */

#define FMC_ISPCTL_APUEN_Pos             (3)                                               /*!< FMC_T::ISPCTL: APUEN Position             */
#define FMC_ISPCTL_APUEN_Msk             (0x1ul << FMC_ISPCTL_APUEN_Pos)                   /*!< FMC_T::ISPCTL: APUEN Mask                 */

