MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC472JG8AE/mcu.h
    /**
     * Px_DATMSK
     * ===================================================================================================
     * Offset: 0x0C  Px Data Output Write Mask
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |DATMSK0   |Port N Bit M Data Output Write Mask
     * |        |          |These bits are used to protect the corresponding register of Px_DOUT[m].
     * |        |          |When set the DATMSK [m] to 1, the writing to Px_DOUT[m] bit is ignored.
     * |        |          |The write to port pin latch is masked.
     * |        |          |0 = Px_DOUT[m] bit writing is valid.
     * |        |          |1 = Px_DOUT[m] bit writing is ignored.
     * |[1]     |DATMSK1   |Port N Bit M Data Output Write Mask
     * |        |          |These bits are used to protect the corresponding register of Px_DOUT[m].
     * |        |          |When set the DATMSK [m] to 1, the writing to Px_DOUT[m] bit is ignored.
     * |        |          |The write to port pin latch is masked.
     * |        |          |0 = Px_DOUT[m] bit writing is valid.
     * |        |          |1 = Px_DOUT[m] bit writing is ignored.
     * |[2]     |DATMSK2   |Port N Bit M Data Output Write Mask
     * |        |          |These bits are used to protect the corresponding register of Px_DOUT[m].
     * |        |          |When set the DATMSK [m] to 1, the writing to Px_DOUT[m] bit is ignored.
     * |        |          |The write to port pin latch is masked.
     * |        |          |0 = Px_DOUT[m] bit writing is valid.
     * |        |          |1 = Px_DOUT[m] bit writing is ignored.
     * |[3]     |DATMSK3   |Port N Bit M Data Output Write Mask
     * |        |          |These bits are used to protect the corresponding register of Px_DOUT[m].
     * |        |          |When set the DATMSK [m] to 1, the writing to Px_DOUT[m] bit is ignored.
     * |        |          |The write to port pin latch is masked.
     * |        |          |0 = Px_DOUT[m] bit writing is valid.
     * |        |          |1 = Px_DOUT[m] bit writing is ignored.
     * |[4]     |DATMSK4   |Port N Bit M Data Output Write Mask
     * |        |          |These bits are used to protect the corresponding register of Px_DOUT[m].
     * |        |          |When set the DATMSK [m] to 1, the writing to Px_DOUT[m] bit is ignored.
     * |        |          |The write to port pin latch is masked.
     * |        |          |0 = Px_DOUT[m] bit writing is valid.
     * |        |          |1 = Px_DOUT[m] bit writing is ignored.
     * |[5]     |DATMSK5   |Port N Bit M Data Output Write Mask
     * |        |          |These bits are used to protect the corresponding register of Px_DOUT[m].
     * |        |          |When set the DATMSK [m] to 1, the writing to Px_DOUT[m] bit is ignored.
     * |        |          |The write to port pin latch is masked.
     * |        |          |0 = Px_DOUT[m] bit writing is valid.
     * |        |          |1 = Px_DOUT[m] bit writing is ignored.
     * |[6]     |DATMSK6   |Port N Bit M Data Output Write Mask
     * |        |          |These bits are used to protect the corresponding register of Px_DOUT[m].
     * |        |          |When set the DATMSK [m] to 1, the writing to Px_DOUT[m] bit is ignored.
     * |        |          |The write to port pin latch is masked.
     * |        |          |0 = Px_DOUT[m] bit writing is valid.
     * |        |          |1 = Px_DOUT[m] bit writing is ignored.
     * |[7]     |DATMSK7   |Port N Bit M Data Output Write Mask
     * |        |          |These bits are used to protect the corresponding register of Px_DOUT[m].
     * |        |          |When set the DATMSK [m] to 1, the writing to Px_DOUT[m] bit is ignored.
     * |        |          |The write to port pin latch is masked.
     * |        |          |0 = Px_DOUT[m] bit writing is valid.
     * |        |          |1 = Px_DOUT[m] bit writing is ignored.
     * |[8]     |DATMSK8   |Port N Bit M Data Output Write Mask
     * |        |          |These bits are used to protect the corresponding register of Px_DOUT[m].
     * |        |          |When set the DATMSK [m] to 1, the writing to Px_DOUT[m] bit is ignored.
     * |        |          |The write to port pin latch is masked.
     * |        |          |0 = Px_DOUT[m] bit writing is valid.
     * |        |          |1 = Px_DOUT[m] bit writing is ignored.
     * |[9]     |DATMSK9   |Port N Bit M Data Output Write Mask
     * |        |          |These bits are used to protect the corresponding register of Px_DOUT[m].
     * |        |          |When set the DATMSK [m] to 1, the writing to Px_DOUT[m] bit is ignored.
     * |        |          |The write to port pin latch is masked.
     * |        |          |0 = Px_DOUT[m] bit writing is valid.
     * |        |          |1 = Px_DOUT[m] bit writing is ignored.
     * |[10]    |DATMSK10  |Port N Bit M Data Output Write Mask
     * |        |          |These bits are used to protect the corresponding register of Px_DOUT[m].
     * |        |          |When set the DATMSK [m] to 1, the writing to Px_DOUT[m] bit is ignored.
     * |        |          |The write to port pin latch is masked.
     * |        |          |0 = Px_DOUT[m] bit writing is valid.
     * |        |          |1 = Px_DOUT[m] bit writing is ignored.
     * |[11]    |DATMSK11  |Port N Bit M Data Output Write Mask
     * |        |          |These bits are used to protect the corresponding register of Px_DOUT[m].
     * |        |          |When set the DATMSK [m] to 1, the writing to Px_DOUT[m] bit is ignored.
     * |        |          |The write to port pin latch is masked.
     * |        |          |0 = Px_DOUT[m] bit writing is valid.
     * |        |          |1 = Px_DOUT[m] bit writing is ignored.
     * |[12]    |DATMSK12  |Port N Bit M Data Output Write Mask
     * |        |          |These bits are used to protect the corresponding register of Px_DOUT[m].
     * |        |          |When set the DATMSK [m] to 1, the writing to Px_DOUT[m] bit is ignored.
     * |        |          |The write to port pin latch is masked.
     * |        |          |0 = Px_DOUT[m] bit writing is valid.
     * |        |          |1 = Px_DOUT[m] bit writing is ignored.
     * |[13]    |DATMSK13  |Port N Bit M Data Output Write Mask
     * |        |          |These bits are used to protect the corresponding register of Px_DOUT[m].
     * |        |          |When set the DATMSK [m] to 1, the writing to Px_DOUT[m] bit is ignored.
     * |        |          |The write to port pin latch is masked.
     * |        |          |0 = Px_DOUT[m] bit writing is valid.
     * |        |          |1 = Px_DOUT[m] bit writing is ignored.
     * |[14]    |DATMSK14  |Port N Bit M Data Output Write Mask
     * |        |          |These bits are used to protect the corresponding register of Px_DOUT[m].
     * |        |          |When set the DATMSK [m] to 1, the writing to Px_DOUT[m] bit is ignored.
     * |        |          |The write to port pin latch is masked.
     * |        |          |0 = Px_DOUT[m] bit writing is valid.
     * |        |          |1 = Px_DOUT[m] bit writing is ignored.
     * |[15]    |DATMSK15  |Port N Bit M Data Output Write Mask
     * |        |          |These bits are used to protect the corresponding register of Px_DOUT[m].
     * |        |          |When set the DATMSK [m] to 1, the writing to Px_DOUT[m] bit is ignored.
     * |        |          |The write to port pin latch is masked.
     * |        |          |0 = Px_DOUT[m] bit writing is valid.
     * |        |          |1 = Px_DOUT[m] bit writing is ignored.
    */
    __IO uint32_t DATMSK;

    /**
     * Px_PIN
     * ===================================================================================================
     * Offset: 0x10  Px Pin Value
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PIN0      |Port N Bit M Pin Value
     * |        |          |Each bit of the register reflects the actual status of the respective port pin.
     * |        |          |If bit is 1, it indicates the corresponding pin status is high, else the pin status is low.
     * |[1]     |PIN1      |Port N Bit M Pin Value
     * |        |          |Each bit of the register reflects the actual status of the respective port pin.
     * |        |          |If bit is 1, it indicates the corresponding pin status is high, else the pin status is low.
     * |[2]     |PIN2      |Port N Bit M Pin Value
     * |        |          |Each bit of the register reflects the actual status of the respective port pin.
     * |        |          |If bit is 1, it indicates the corresponding pin status is high, else the pin status is low.
     * |[3]     |PIN3      |Port N Bit M Pin Value
     * |        |          |Each bit of the register reflects the actual status of the respective port pin.
     * |        |          |If bit is 1, it indicates the corresponding pin status is high, else the pin status is low.
     * |[4]     |PIN4      |Port N Bit M Pin Value
     * |        |          |Each bit of the register reflects the actual status of the respective port pin.
     * |        |          |If bit is 1, it indicates the corresponding pin status is high, else the pin status is low.
     * |[5]     |PIN5      |Port N Bit M Pin Value
     * |        |          |Each bit of the register reflects the actual status of the respective port pin.
     * |        |          |If bit is 1, it indicates the corresponding pin status is high, else the pin status is low.
     * |[6]     |PIN6      |Port N Bit M Pin Value
     * |        |          |Each bit of the register reflects the actual status of the respective port pin.
     * |        |          |If bit is 1, it indicates the corresponding pin status is high, else the pin status is low.
     * |[7]     |PIN7      |Port N Bit M Pin Value
     * |        |          |Each bit of the register reflects the actual status of the respective port pin.
     * |        |          |If bit is 1, it indicates the corresponding pin status is high, else the pin status is low.
     * |[8]     |PIN8      |Port N Bit M Pin Value
     * |        |          |Each bit of the register reflects the actual status of the respective port pin.
     * |        |          |If bit is 1, it indicates the corresponding pin status is high, else the pin status is low.
     * |[9]     |PIN9      |Port N Bit M Pin Value
     * |        |          |Each bit of the register reflects the actual status of the respective port pin.
     * |        |          |If bit is 1, it indicates the corresponding pin status is high, else the pin status is low.
     * |[10]    |PIN10     |Port N Bit M Pin Value
     * |        |          |Each bit of the register reflects the actual status of the respective port pin.
     * |        |          |If bit is 1, it indicates the corresponding pin status is high, else the pin status is low.
     * |[11]    |PIN11     |Port N Bit M Pin Value
     * |        |          |Each bit of the register reflects the actual status of the respective port pin.
     * |        |          |If bit is 1, it indicates the corresponding pin status is high, else the pin status is low.
     * |[12]    |PIN12     |Port N Bit M Pin Value
     * |        |          |Each bit of the register reflects the actual status of the respective port pin.
     * |        |          |If bit is 1, it indicates the corresponding pin status is high, else the pin status is low.
     * |[13]    |PIN13     |Port N Bit M Pin Value
     * |        |          |Each bit of the register reflects the actual status of the respective port pin.
     * |        |          |If bit is 1, it indicates the corresponding pin status is high, else the pin status is low.
     * |[14]    |PIN14     |Port N Bit M Pin Value
     * |        |          |Each bit of the register reflects the actual status of the respective port pin.
     * |        |          |If bit is 1, it indicates the corresponding pin status is high, else the pin status is low.
     * |[15]    |PIN15     |Port N Bit M Pin Value
     * |        |          |Each bit of the register reflects the actual status of the respective port pin.
     * |        |          |If bit is 1, it indicates the corresponding pin status is high, else the pin status is low.
    */
    __I  uint32_t PIN;

