MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC472JG8AE/mcu.h
    /**
     * Px_INTEN
     * ===================================================================================================
     * Offset: 0x1C  Px Interrupt Enable
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |FLIEN0    |Port N Bit M Interrupt Enable For Falling Edge Or Low Level Input
     * |        |          |FLIEN[n] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m low-level or falling edge interrupt Disabled.
     * |        |          |1 = Port n bit m low-level or falling edge interrupt Enabled.
     * |[1]     |FLIEN1    |Port N Bit M Interrupt Enable For Falling Edge Or Low Level Input
     * |        |          |FLIEN[n] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m low-level or falling edge interrupt Disabled.
     * |        |          |1 = Port n bit m low-level or falling edge interrupt Enabled.
     * |[2]     |FLIEN2    |Port N Bit M Interrupt Enable For Falling Edge Or Low Level Input
     * |        |          |FLIEN[n] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m low-level or falling edge interrupt Disabled.
     * |        |          |1 = Port n bit m low-level or falling edge interrupt Enabled.
     * |[3]     |FLIEN3    |Port N Bit M Interrupt Enable For Falling Edge Or Low Level Input
     * |        |          |FLIEN[n] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m low-level or falling edge interrupt Disabled.
     * |        |          |1 = Port n bit m low-level or falling edge interrupt Enabled.
     * |[4]     |FLIEN4    |Port N Bit M Interrupt Enable For Falling Edge Or Low Level Input
     * |        |          |FLIEN[n] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m low-level or falling edge interrupt Disabled.
     * |        |          |1 = Port n bit m low-level or falling edge interrupt Enabled.
     * |[5]     |FLIEN5    |Port N Bit M Interrupt Enable For Falling Edge Or Low Level Input
     * |        |          |FLIEN[n] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m low-level or falling edge interrupt Disabled.
     * |        |          |1 = Port n bit m low-level or falling edge interrupt Enabled.
     * |[6]     |FLIEN6    |Port N Bit M Interrupt Enable For Falling Edge Or Low Level Input
     * |        |          |FLIEN[n] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m low-level or falling edge interrupt Disabled.
     * |        |          |1 = Port n bit m low-level or falling edge interrupt Enabled.
     * |[7]     |FLIEN7    |Port N Bit M Interrupt Enable For Falling Edge Or Low Level Input
     * |        |          |FLIEN[n] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m low-level or falling edge interrupt Disabled.
     * |        |          |1 = Port n bit m low-level or falling edge interrupt Enabled.
     * |[8]     |FLIEN8    |Port N Bit M Interrupt Enable For Falling Edge Or Low Level Input
     * |        |          |FLIEN[n] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m low-level or falling edge interrupt Disabled.
     * |        |          |1 = Port n bit m low-level or falling edge interrupt Enabled.
     * |[9]     |FLIEN9    |Port N Bit M Interrupt Enable For Falling Edge Or Low Level Input
     * |        |          |FLIEN[n] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m low-level or falling edge interrupt Disabled.
     * |        |          |1 = Port n bit m low-level or falling edge interrupt Enabled.
     * |[10]    |FLIEN10   |Port N Bit M Interrupt Enable For Falling Edge Or Low Level Input
     * |        |          |FLIEN[n] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m low-level or falling edge interrupt Disabled.
     * |        |          |1 = Port n bit m low-level or falling edge interrupt Enabled.
     * |[11]    |FLIEN11   |Port N Bit M Interrupt Enable For Falling Edge Or Low Level Input
     * |        |          |FLIEN[n] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m low-level or falling edge interrupt Disabled.
     * |        |          |1 = Port n bit m low-level or falling edge interrupt Enabled.
     * |[12]    |FLIEN12   |Port N Bit M Interrupt Enable For Falling Edge Or Low Level Input
     * |        |          |FLIEN[n] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m low-level or falling edge interrupt Disabled.
     * |        |          |1 = Port n bit m low-level or falling edge interrupt Enabled.
     * |[13]    |FLIEN13   |Port N Bit M Interrupt Enable For Falling Edge Or Low Level Input
     * |        |          |FLIEN[n] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m low-level or falling edge interrupt Disabled.
     * |        |          |1 = Port n bit m low-level or falling edge interrupt Enabled.
     * |[14]    |FLIEN14   |Port N Bit M Interrupt Enable For Falling Edge Or Low Level Input
     * |        |          |FLIEN[n] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m low-level or falling edge interrupt Disabled.
     * |        |          |1 = Port n bit m low-level or falling edge interrupt Enabled.
     * |[15]    |FLIEN15   |Port N Bit M Interrupt Enable For Falling Edge Or Low Level Input
     * |        |          |FLIEN[n] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m low-level or falling edge interrupt Disabled.
     * |        |          |1 = Port n bit m low-level or falling edge interrupt Enabled.
     * |[16]    |RHIEN0    |Port N Bit M Interrupt Enable For Rising Edge Or High Level Input
     * |        |          |RHIEN[m] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m high-level or rising edge interrupt Disabled.
     * |        |          |1 = Port n bit m high-level or rising edge interrupt Enabled.
     * |[17]    |RHIEN1    |Port N Bit M Interrupt Enable For Rising Edge Or High Level Input
     * |        |          |RHIEN[m] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m high-level or rising edge interrupt Disabled.
     * |        |          |1 = Port n bit m high-level or rising edge interrupt Enabled.
     * |[18]    |RHIEN2    |Port N Bit M Interrupt Enable For Rising Edge Or High Level Input
     * |        |          |RHIEN[m] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m high-level or rising edge interrupt Disabled.
     * |        |          |1 = Port n bit m high-level or rising edge interrupt Enabled.
     * |[19]    |RHIEN3    |Port N Bit M Interrupt Enable For Rising Edge Or High Level Input
     * |        |          |RHIEN[m] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m high-level or rising edge interrupt Disabled.
     * |        |          |1 = Port n bit m high-level or rising edge interrupt Enabled.
     * |[20]    |RHIEN4    |Port N Bit M Interrupt Enable For Rising Edge Or High Level Input
     * |        |          |RHIEN[m] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m high-level or rising edge interrupt Disabled.
     * |        |          |1 = Port n bit m high-level or rising edge interrupt Enabled.
     * |[21]    |RHIEN5    |Port N Bit M Interrupt Enable For Rising Edge Or High Level Input
     * |        |          |RHIEN[m] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m high-level or rising edge interrupt Disabled.
     * |        |          |1 = Port n bit m high-level or rising edge interrupt Enabled.
     * |[22]    |RHIEN6    |Port N Bit M Interrupt Enable For Rising Edge Or High Level Input
     * |        |          |RHIEN[m] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m high-level or rising edge interrupt Disabled.
     * |        |          |1 = Port n bit m high-level or rising edge interrupt Enabled.
     * |[23]    |RHIEN7    |Port N Bit M Interrupt Enable For Rising Edge Or High Level Input
     * |        |          |RHIEN[m] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m high-level or rising edge interrupt Disabled.
     * |        |          |1 = Port n bit m high-level or rising edge interrupt Enabled.
     * |[24]    |RHIEN8    |Port N Bit M Interrupt Enable For Rising Edge Or High Level Input
     * |        |          |RHIEN[m] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m high-level or rising edge interrupt Disabled.
     * |        |          |1 = Port n bit m high-level or rising edge interrupt Enabled.
     * |[25]    |RHIEN9    |Port N Bit M Interrupt Enable For Rising Edge Or High Level Input
     * |        |          |RHIEN[m] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m high-level or rising edge interrupt Disabled.
     * |        |          |1 = Port n bit m high-level or rising edge interrupt Enabled.
     * |[26]    |RHIEN10   |Port N Bit M Interrupt Enable For Rising Edge Or High Level Input
     * |        |          |RHIEN[m] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m high-level or rising edge interrupt Disabled.
     * |        |          |1 = Port n bit m high-level or rising edge interrupt Enabled.
     * |[27]    |RHIEN11   |Port N Bit M Interrupt Enable For Rising Edge Or High Level Input
     * |        |          |RHIEN[m] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m high-level or rising edge interrupt Disabled.
     * |        |          |1 = Port n bit m high-level or rising edge interrupt Enabled.
     * |[28]    |RHIEN12   |Port N Bit M Interrupt Enable For Rising Edge Or High Level Input
     * |        |          |RHIEN[m] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m high-level or rising edge interrupt Disabled.
     * |        |          |1 = Port n bit m high-level or rising edge interrupt Enabled.
     * |[29]    |RHIEN13   |Port N Bit M Interrupt Enable For Rising Edge Or High Level Input
     * |        |          |RHIEN[m] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m high-level or rising edge interrupt Disabled.
     * |        |          |1 = Port n bit m high-level or rising edge interrupt Enabled.
     * |[30]    |RHIEN14   |Port N Bit M Interrupt Enable For Rising Edge Or High Level Input
     * |        |          |RHIEN[m] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m high-level or rising edge interrupt Disabled.
     * |        |          |1 = Port n bit m high-level or rising edge interrupt Enabled.
     * |[31]    |RHIEN15   |Port N Bit M Interrupt Enable For Rising Edge Or High Level Input
     * |        |          |RHIEN[m] enables the interrupt for each of the corresponding input of Port n.
     * |        |          |Setting this bit to 1 also enables the pin wake-up function.
     * |        |          |0 = Port n bit m high-level or rising edge interrupt Disabled.
     * |        |          |1 = Port n bit m high-level or rising edge interrupt Enabled.
    */
    __IO uint32_t INTEN;

    /**
     * Px_INTSRC
     * ===================================================================================================
     * Offset: 0x20  Px Interrupt Source Flag
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |INTSRC0   |Port N Bit M Interrupt Trigger Source Indicator
     * |        |          |Read:
     * |        |          |0 = No interrupt at Port n.
     * |        |          |1 = Port n bit m generate an interrupt.
     * |        |          |Write:
     * |        |          |0= No effect.
     * |        |          |1= Clear the correspond pending interrupt.
     * |[1]     |INTSRC1   |Port N Bit M Interrupt Trigger Source Indicator
     * |        |          |Read:
     * |        |          |0 = No interrupt at Port n.
     * |        |          |1 = Port n bit m generate an interrupt.
     * |        |          |Write:
     * |        |          |0= No effect.
     * |        |          |1= Clear the correspond pending interrupt.
     * |[2]     |INTSRC2   |Port N Bit M Interrupt Trigger Source Indicator
     * |        |          |Read:
     * |        |          |0 = No interrupt at Port n.
     * |        |          |1 = Port n bit m generate an interrupt.
     * |        |          |Write:
     * |        |          |0= No effect.
     * |        |          |1= Clear the correspond pending interrupt.
     * |[3]     |INTSRC3   |Port N Bit M Interrupt Trigger Source Indicator
     * |        |          |Read:
     * |        |          |0 = No interrupt at Port n.
     * |        |          |1 = Port n bit m generate an interrupt.
     * |        |          |Write:
     * |        |          |0= No effect.
     * |        |          |1= Clear the correspond pending interrupt.
     * |[4]     |INTSRC4   |Port N Bit M Interrupt Trigger Source Indicator
     * |        |          |Read:
     * |        |          |0 = No interrupt at Port n.
     * |        |          |1 = Port n bit m generate an interrupt.
     * |        |          |Write:
     * |        |          |0= No effect.
     * |        |          |1= Clear the correspond pending interrupt.
     * |[5]     |INTSRC5   |Port N Bit M Interrupt Trigger Source Indicator
     * |        |          |Read:
     * |        |          |0 = No interrupt at Port n.
     * |        |          |1 = Port n bit m generate an interrupt.
     * |        |          |Write:
     * |        |          |0= No effect.
     * |        |          |1= Clear the correspond pending interrupt.
     * |[6]     |INTSRC6   |Port N Bit M Interrupt Trigger Source Indicator
     * |        |          |Read:
     * |        |          |0 = No interrupt at Port n.
     * |        |          |1 = Port n bit m generate an interrupt.
     * |        |          |Write:
     * |        |          |0= No effect.
     * |        |          |1= Clear the correspond pending interrupt.
     * |[7]     |INTSRC7   |Port N Bit M Interrupt Trigger Source Indicator
     * |        |          |Read:
     * |        |          |0 = No interrupt at Port n.
     * |        |          |1 = Port n bit m generate an interrupt.
     * |        |          |Write:
     * |        |          |0= No effect.
     * |        |          |1= Clear the correspond pending interrupt.
     * |[8]     |INTSRC8   |Port N Bit M Interrupt Trigger Source Indicator
     * |        |          |Read:
     * |        |          |0 = No interrupt at Port n.
     * |        |          |1 = Port n bit m generate an interrupt.
     * |        |          |Write:
     * |        |          |0= No effect.
     * |        |          |1= Clear the correspond pending interrupt.
     * |[9]     |INTSRC9   |Port N Bit M Interrupt Trigger Source Indicator
     * |        |          |Read:
     * |        |          |0 = No interrupt at Port n.
     * |        |          |1 = Port n bit m generate an interrupt.
     * |        |          |Write:
     * |        |          |0= No effect.
     * |        |          |1= Clear the correspond pending interrupt.
     * |[10]    |INTSRC10  |Port N Bit M Interrupt Trigger Source Indicator
     * |        |          |Read:
     * |        |          |0 = No interrupt at Port n.
     * |        |          |1 = Port n bit m generate an interrupt.
     * |        |          |Write:
     * |        |          |0= No effect.
     * |        |          |1= Clear the correspond pending interrupt.
     * |[11]    |INTSRC11  |Port N Bit M Interrupt Trigger Source Indicator
     * |        |          |Read:
     * |        |          |0 = No interrupt at Port n.
     * |        |          |1 = Port n bit m generate an interrupt.
     * |        |          |Write:
     * |        |          |0= No effect.
     * |        |          |1= Clear the correspond pending interrupt.
     * |[12]    |INTSRC12  |Port N Bit M Interrupt Trigger Source Indicator
     * |        |          |Read:
     * |        |          |0 = No interrupt at Port n.
     * |        |          |1 = Port n bit m generate an interrupt.
     * |        |          |Write:
     * |        |          |0= No effect.
     * |        |          |1= Clear the correspond pending interrupt.
     * |[13]    |INTSRC13  |Port N Bit M Interrupt Trigger Source Indicator
     * |        |          |Read:
     * |        |          |0 = No interrupt at Port n.
     * |        |          |1 = Port n bit m generate an interrupt.
     * |        |          |Write:
     * |        |          |0= No effect.
     * |        |          |1= Clear the correspond pending interrupt.
     * |[14]    |INTSRC14  |Port N Bit M Interrupt Trigger Source Indicator
     * |        |          |Read:
     * |        |          |0 = No interrupt at Port n.
     * |        |          |1 = Port n bit m generate an interrupt.
     * |        |          |Write:
     * |        |          |0= No effect.
     * |        |          |1= Clear the correspond pending interrupt.
     * |[15]    |INTSRC15  |Port N Bit M Interrupt Trigger Source Indicator
     * |        |          |Read:
     * |        |          |0 = No interrupt at Port n.
     * |        |          |1 = Port n bit m generate an interrupt.
     * |        |          |Write:
     * |        |          |0= No effect.
     * |        |          |1= Clear the correspond pending interrupt.
    */
    __IO uint32_t INTSRC;

