MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC472JG8AE/mcu.h
    /**
     * BRKCTL
     * ===================================================================================================
     * Offset: 0x6C  PWM Brake Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |BRKP0EN   |Brake0 Function Enable Control
     * |        |          |0 = Brake0 detect function Disabled.
     * |        |          |1 = Brake0 detect function Enabled.
     * |[1]     |BRK0NFDIS |PWM Brake 0 Noise Filter Disable Control
     * |        |          |0 = Noise filter of PWM Brake 0 Enabled.
     * |        |          |1 = Noise filter of PWM Brake 0 Disabled.
     * |[2]     |BRK0INV   |Inverse BKP0 State
     * |        |          |0 = The state of pin BKPx0 is passed to the negative edge detector.
     * |        |          |1 = The inversed state of pin BKPx0 is passed to the negative edge detector.
     * |[6:7]   |BRK0NFSEL |Brake 0 (BKPx0 Pin) Edge Detector Filter Clock Selection
     * |        |          |00 = Filter clock = HCLK.
     * |        |          |01 = Filter clock = HCLK/2.
     * |        |          |10 = Filter clock = HCLK/4.
     * |        |          |11 = Filter clock = HCLK/16.
     * |[8]     |BRKP1EN   |Brake1 Function Enable Control
     * |        |          |0 = Brake1 function Disabled.
     * |        |          |1 = Brake1 function Enabled.
     * |[9]     |BRK1NFDIS |PWM Brake 1 Noise Filter Disable Control
     * |        |          |0 = Noise filter of PWM Brake 1 Enabled.
     * |        |          |1 = Noise filter of PWM Brake 1 Disabled.
     * |[10]    |BRK1INV   |Inverse BKP1 State
     * |        |          |0 = The state of pin BKPx1 is passed to the negative edge detector.
     * |        |          |1 = The inversed state of pin BKPx1 is passed to the negative edge detector.
     * |[12:13] |BK1SEL    |Brake Function 1 Source Selection
     * |        |          |00 = From external pin BKP1.
     * |        |          |01 = From analog comparator 0 output (CPO0).
     * |        |          |10 = From analog comparator 1 output (CPO1).
     * |        |          |11 = Reserved.
     * |[14:15] |BRK1NFSEL |Brake 1 (BKPx1 Pin) Edge Detector Filter Clock Selection
     * |        |          |00 = Filter clock = HCLK.
     * |        |          |01 = Filter clock = HCLK/2.
     * |        |          |10 = Filter clock = HCLK/4.
     * |        |          |11 = Filter clock = HCLK/16.
     * |[16]    |CPO0BKEN  |CPO0 Digital Output As Brake0 Source Enable Control
     * |        |          |0 = CPO0 as one brake source in Brake 0 Disabled.
     * |        |          |1 = CPO0 as one brake source in Brake 0 Enabled.
     * |[17]    |CPO1BKEN  |CPO1 Digital Output As Brake 0 Source Enable Control
     * |        |          |0 = CPO1 as one brake source in Brake 0 Disabled.
     * |        |          |1 = CPO1 as one brake source in Brake 0 Enabled.
     * |[18]    |CPO2BKEN  |CPO2 Digital Output As Brake 0 Source Enable Control
     * |        |          |0 = CPO2 as one brake source in Brake 0 Disabled.
     * |        |          |1 = CPO2 as one brake source in Brake 0 Enabled.
     * |[19]    |LVDBKEN   |Low-Level Detection Trigger PWM Brake Function 1 Enable Control
     * |        |          |0 = Brake Function 1 triggered by Low-level detection Disabled.
     * |        |          |1 = Brake Function 1 triggered by Low-level detection Enabled.
     * |[24:29] |BKOD      |PWM Brake Output Data Register
     * |        |          |0 = PWM output low when fault brake conditions asserted.
     * |        |          |1 = PWM output high when fault brake conditions asserted.
     * |        |          |Note: Each bit controls the corresponding PWM channel.
    */
    __IO uint32_t BRKCTL;

    /**
     * INTCTL
     * ===================================================================================================
     * Offset: 0x70  PWM Interrupt Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:5]   |PINTTYPE  |PWM Period Interrupt Type Selection
     * |        |          |0 = PIF[n] will be set if PWM counter underflow.
     * |        |          |1 = PIF[n] will be set if PWM counter matches PWM_PERIODn register.
     * |        |          |Note1: This bit should keep at 0 when PWM counter operating in Edge-aligned type.
     * |        |          |Note2: Each bit controls the corresponding PWM channel.
     * |[8:13]  |DINTTYPE  |PWM Duty Interrupt Type Selection
     * |        |          |0 = DIF[n] will be set if PWM counter matches PWM_CMPDATn register during down counting.
     * |        |          |1 = DIF[n] will be set if PWM counter matches PWM_CMPDATn register during up counting.
     * |        |          |Note1: This bit should keep at 0 when PWM counter operating in Edge-aligned type.
     * |        |          |Note2: Each bit controls the corresponding PWM channel.
    */
    __IO uint32_t INTCTL;

    /**
     * INTEN
     * ===================================================================================================
     * Offset: 0x74  PWM Interrupt Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:5]   |PIEN      |PWM Period Interrupt Enable Control
     * |        |          |0 = Period interrupt Disabled.
     * |        |          |1 = Period interrupt Enabled.
     * |        |          |Note: Each bit controls the corresponding PWM channel.
     * |[6]     |BRKIEN    |Brake0 And Brak1 Interrupt Enable Control
     * |        |          |0 = Disabling flags BFK0 and BFK1 to trigger PWM interrupt.
     * |        |          |1 = Enabling flags BRKIF0 and BRKIF1 can trigger PWM interrupt.
     * |[8:13]  |DIEN      |PWM Duty Interrupt Enable Control
     * |        |          |0 = Duty interrupt Disabled.
     * |        |          |1 = Duty interrupt Enabled.
     * |        |          |Note: Each bit controls the corresponding PWM channel.
     * |[16:21] |RLIEN     |Rising Latch Interrupt Enable Control
     * |        |          |0 = Rising latch interrupt Disabled.
     * |        |          |1 = Rising latch interrupt Enabled.
     * |        |          |Note: Each bit controls the corresponding PWM channel.
     * |[24:29] |FLIEN     |Falling Latch Interrupt Enable Control
     * |        |          |0 = Falling latch interrupt Disabled.
     * |        |          |1 = Falling latch interrupt Enabled.
     * |        |          |Note: Each bit controls the corresponding PWM channel.
    */
    __IO uint32_t INTEN;

    /**
     * INTSTS
     * ===================================================================================================
     * Offset: 0x78  PWM Interrupt Flag Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:5]   |PIF       |PWM Period Interrupt Flag
     * |        |          |This bit is set by hardware when PWM counter reaches the requirement condition of interrupt (depending on PINTTYPE (PWM_INTCTL[n]) ).
     * |        |          |Software can write 1 to clear this bit to 0.
     * |[6]     |BRKIF0    |PWM Brake0 Flag
     * |        |          |0 = PWM Brake 0 is able to poll falling signal at BKP0 and has not recognized any one.
     * |        |          |1 = When PWM Brake 0 detects a falling signal at BKP0, this flag will be set to high.
     * |        |          |Note: This bit must be cleared by writing 1 to it.
     * |[7]     |BRKIF1    |PWM Brake1 Flag
     * |        |          |0 = PWM Brake 1 is able to poll falling signal at BKP1 and has not recognized any one.
     * |        |          |1 = When PWM Brake 1 detects a falling signal at pin BKP1, this flag will be set to high.
     * |        |          |Note: This bit must be cleared by writing 1 to it.
     * |[8:13]  |DIF       |PWM Duty Interrupt Flag
     * |        |          |Flag is set by hardware when channel 0 PWM counter down count and reaches CMP0.
     * |        |          |Software can clear this bit by writing 1 to it.
     * |        |          |Note: If CMP is equal to PERIOD, this flag is not working in edge-aligned type selection.
     * |[14]    |BRKLK0    |PWM Brake0 Locked
     * |        |          |0 = Brake 0 state is released.
     * |        |          |1 = When PWM Brake detects a falling signal at BKP0, this flag will be set to high to indicate the Brake0 state is locked.
     * |        |          |Note: This bit must be cleared by writing 1 to it.
     * |[16:21] |CRLIF     |Capture Rising Latch Interrupt Flag
     * |        |          |0 = No capture rising latch condition happened.
     * |        |          |1 = Capture rising latch condition happened, this flag will be set to high.
     * |        |          |Note: This bit must be cleared by writing 1 to it.
     * |[22]    |BRKSTS0   |Brake 0 Status (Read Only)
     * |        |          |0 = PWM had been out of Brake 0 state.
     * |        |          |1 = PWM is in Brake 0 state.
     * |[23]    |BRKSTS1   |Brake 1 Status (Read Only)
     * |        |          |0 = PWM had been out of Brake 1 state.
     * |        |          |1 = PWM is in Brake 1 state.
     * |[24:29] |CFLIF     |Capture Falling Latch Interrupt Flag
     * |        |          |0 = No capture falling latch condition happened.
     * |        |          |1 = Capture falling latch condition happened, this flag will be set to high.
     * |        |          |Note: This bit must be cleared by writing 1 to it.
    */
    __IO uint32_t INTSTS;

    /**
     * POEN
     * ===================================================================================================
     * Offset: 0x7C  PWM Output Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:5]   |POEN      |PWM Pin Output Enable Control
     * |        |          |0 = PWM pin at tri-state.
     * |        |          |1 = PWM pin in output mode.
     * |        |          |Note: Each bit controls the corresponding PWM channel.
    */
    __IO uint32_t POEN;

    /**
     * CAPCTL
     * ===================================================================================================
     * Offset: 0x80  PWM Capture Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:5]   |CAPEN     |Capture Function Enable Control
     * |        |          |0 = Capture function Disabled. RCAPDAT and FCAPDAT will not be up2025-06-10d.
     * |        |          |1 = Capture function Enabled.
     * |        |          |Capture latched the PWM counter value and saved to RCAPDAT (Rising latch) and FCAPDAT (Falling latch).
     * |        |          |Note: Each bit controls the corresponding PWM channel.
     * |[8:13]  |CAPINV    |Capture Inverter Enable Control
     * |        |          |0 = Capture source inverter Disabled.
     * |        |          |1 = Capture source inverter Enabled. Reverse the input signal from GPIO
     * |        |          |Note: Each bit controls the corresponding PWM channel.
     * |[16:21] |RCRLDEN   |Rising Latch Reload Enable Control
     * |        |          |0 = Rising latch reload counter Enabled.
     * |        |          |1 = Rising latch reload counter Enabled.
     * |[24:29] |FCRLDEN   |Falling Latch Reload Enable Control
     * |        |          |0 = Falling latch reload counter Disabled.
     * |        |          |1 = Falling latch
     * |        |          |reload counter Enabled.
    */
    __IO uint32_t CAPCTL;

    /**
     * CAPINEN
     * ===================================================================================================
     * Offset: 0x84  PWM Capture Input Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:5]   |CAPINEN   |Capture Input Enable Control
     * |        |          |0 = PWM Channel capture input path Disabled.
     * |        |          |The input of PWM channel capture function is always regarded as 0.
     * |        |          |1 = PWM Channel capture input path Enabled.
     * |        |          |The input of PWM channel capture function comes from correlative multifunction pin.
     * |        |          |Note: Each bit controls the corresponding PWM channel.
    */
    __IO uint32_t CAPINEN;

    /**
     * CAPSTS
     * ===================================================================================================
     * Offset: 0x88  PWM Capture Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:5]   |CRIFOV    |Rising Latch Interrupt Flag Overrun Status
     * |        |          |This flag indicates if rising latch happened when the corresponding CRLIF is 1
     * |        |          |Note: This bit will be cleared automatically when user clear corresponding CRLIF.
     * |[8:13]  |FLIFOV    |Falling Latch Interrupt Flag Overrun Status
     * |        |          |This flag indicates if falling latch happened when the corresponding CFLIF is 1
     * |        |          |Note: This bit will be cleared automatically when user clear corresponding CFLIF.
    */
    __I  uint32_t CAPSTS;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE0[1];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * RCAPDAT0
     * ===================================================================================================
     * Offset: 0x90  PWM Capture Rising Latch Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |RCAPDAT   |Capture Rising Latch Register
     * |        |          |Latch the PWM counter when Channel 0/1/2/3/4/5 has rising transition.
    */
    __I  uint32_t RCAPDAT0;

    /**
     * FCAPDAT0
     * ===================================================================================================
     * Offset: 0x94  PWM Capture Falling Latch Register 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |FCAPDAT   |Capture Falling Latch Register
     * |        |          |Latch the PWM counter when Channel 0/1/2/3/4/5 has Falling transition.
    */
    __I  uint32_t FCAPDAT0;

    /**
     * RCAPDAT1
     * ===================================================================================================
     * Offset: 0x98  PWM Capture Rising Latch Register 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |RCAPDAT   |Capture Rising Latch Register
     * |        |          |Latch the PWM counter when Channel 0/1/2/3/4/5 has rising transition.
    */
    __I  uint32_t RCAPDAT1;

    /**
     * FCAPDAT1
     * ===================================================================================================
     * Offset: 0x9C  PWM Capture Falling Latch Register 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |FCAPDAT   |Capture Falling Latch Register
     * |        |          |Latch the PWM counter when Channel 0/1/2/3/4/5 has Falling transition.
    */
    __I  uint32_t FCAPDAT1;

    /**
     * RCAPDAT2
     * ===================================================================================================
     * Offset: 0xA0  PWM Capture Rising Latch Register 2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |RCAPDAT   |Capture Rising Latch Register
     * |        |          |Latch the PWM counter when Channel 0/1/2/3/4/5 has rising transition.
    */
    __I  uint32_t RCAPDAT2;

    /**
     * FCAPDAT2
     * ===================================================================================================
     * Offset: 0xA4  PWM Capture Falling Latch Register 2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |FCAPDAT   |Capture Falling Latch Register
     * |        |          |Latch the PWM counter when Channel 0/1/2/3/4/5 has Falling transition.
    */
    __I  uint32_t FCAPDAT2;

    /**
     * RCAPDAT3
     * ===================================================================================================
     * Offset: 0xA8  PWM Capture Rising Latch Register 3
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |RCAPDAT   |Capture Rising Latch Register
     * |        |          |Latch the PWM counter when Channel 0/1/2/3/4/5 has rising transition.
    */
    __I  uint32_t RCAPDAT3;

    /**
     * FCAPDAT3
     * ===================================================================================================
     * Offset: 0xAC  PWM Capture Falling Latch Register 3
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |FCAPDAT   |Capture Falling Latch Register
     * |        |          |Latch the PWM counter when Channel 0/1/2/3/4/5 has Falling transition.
    */
    __I  uint32_t FCAPDAT3;

    /**
     * RCAPDAT4
     * ===================================================================================================
     * Offset: 0xB0  PWM Capture Rising Latch Register 4
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |RCAPDAT   |Capture Rising Latch Register
     * |        |          |Latch the PWM counter when Channel 0/1/2/3/4/5 has rising transition.
    */
    __I  uint32_t RCAPDAT4;

    /**
     * FCAPDAT4
     * ===================================================================================================
     * Offset: 0xB4  PWM Capture Falling Latch Register 4
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |FCAPDAT   |Capture Falling Latch Register
     * |        |          |Latch the PWM counter when Channel 0/1/2/3/4/5 has Falling transition.
    */
    __I  uint32_t FCAPDAT4;

    /**
     * RCAPDAT5
     * ===================================================================================================
     * Offset: 0xB8  PWM Capture Rising Latch Register 5
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |RCAPDAT   |Capture Rising Latch Register
     * |        |          |Latch the PWM counter when Channel 0/1/2/3/4/5 has rising transition.
    */
    __I  uint32_t RCAPDAT5;

    /**
     * FCAPDAT5
     * ===================================================================================================
     * Offset: 0xBC  PWM Capture Falling Latch Register 5
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |FCAPDAT   |Capture Falling Latch Register
     * |        |          |Latch the PWM counter when Channel 0/1/2/3/4/5 has Falling transition.
    */
    __I  uint32_t FCAPDAT5;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE1[8];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * SBS0
     * ===================================================================================================
     * Offset: 0xE0  PWM0 Synchronous Busy Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |SYNCBUSY  |PWM Synchronous Busy
     * |        |          |When software writes PWM_PERIOD0/PWM_CMPDAT0/PWM_CLKPSC or switch PWM0 counter operation mode CNTMOD (CONR[16]), PWM will have a busy time to up2025-06-10 these values completely because PWM clock may be different from system clock domain.
     * |        |          |Software needs to check this busy status before writes PWM_PERIOD0/PWM_CMPDAT0/ PWM_CLKPSC or switch PWM0 counter operation mode to make sure previous setting has been up2025-06-10 completely.
     * |        |          |This bit will be set when software writes PWM_PERIOD0/PWM_CMPDAT0/PWM_CLKPSC or switch PWM0 operation mode CNTMOD (CONR[16]) and will be cleared by hardware automatically when PWM up2025-06-10 these value completely.
    */
    __I  uint32_t SBS[6];

} PWM_T;

/**
    @addtogroup PWM_CONST PWM Bit Field Definition
    Constant Definitions for PWM Controller
@{ */

#define PWM_CLKPSC_CLKPSC01_Pos          (0)                                               /*!< PWM_T::CLKPSC: CLKPSC01 Position          */
#define PWM_CLKPSC_CLKPSC01_Msk          (0xfful << PWM_CLKPSC_CLKPSC01_Pos)               /*!< PWM_T::CLKPSC: CLKPSC01 Mask              */

