MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC472JG8AE/mcu.h
#define PWM_RCAPDAT1_RCAPDAT_Pos         (0)                                               /*!< PWM_T::RCAPDAT1: RCAPDAT Position         */
#define PWM_RCAPDAT1_RCAPDAT_Msk         (0xfffful << PWM_RCAPDAT1_RCAPDAT_Pos)            /*!< PWM_T::RCAPDAT1: RCAPDAT Mask             */

#define PWM_FCAPDAT1_FCAPDAT_Pos         (0)                                               /*!< PWM_T::FCAPDAT1: FCAPDAT Position         */
#define PWM_FCAPDAT1_FCAPDAT_Msk         (0xfffful << PWM_FCAPDAT1_FCAPDAT_Pos)            /*!< PWM_T::FCAPDAT1: FCAPDAT Mask             */

#define PWM_RCAPDAT2_RCAPDAT_Pos         (0)                                               /*!< PWM_T::RCAPDAT2: RCAPDAT Position         */
#define PWM_RCAPDAT2_RCAPDAT_Msk         (0xfffful << PWM_RCAPDAT2_RCAPDAT_Pos)            /*!< PWM_T::RCAPDAT2: RCAPDAT Mask             */

#define PWM_FCAPDAT2_FCAPDAT_Pos         (0)                                               /*!< PWM_T::FCAPDAT2: FCAPDAT Position         */
#define PWM_FCAPDAT2_FCAPDAT_Msk         (0xfffful << PWM_FCAPDAT2_FCAPDAT_Pos)            /*!< PWM_T::FCAPDAT2: FCAPDAT Mask             */

#define PWM_RCAPDAT3_RCAPDAT_Pos         (0)                                               /*!< PWM_T::RCAPDAT3: RCAPDAT Position         */
#define PWM_RCAPDAT3_RCAPDAT_Msk         (0xfffful << PWM_RCAPDAT3_RCAPDAT_Pos)            /*!< PWM_T::RCAPDAT3: RCAPDAT Mask             */

#define PWM_FCAPDAT3_FCAPDAT_Pos         (0)                                               /*!< PWM_T::FCAPDAT3: FCAPDAT Position         */
#define PWM_FCAPDAT3_FCAPDAT_Msk         (0xfffful << PWM_FCAPDAT3_FCAPDAT_Pos)            /*!< PWM_T::FCAPDAT3: FCAPDAT Mask             */

#define PWM_RCAPDAT4_RCAPDAT_Pos         (0)                                               /*!< PWM_T::RCAPDAT4: RCAPDAT Position         */
#define PWM_RCAPDAT4_RCAPDAT_Msk         (0xfffful << PWM_RCAPDAT4_RCAPDAT_Pos)            /*!< PWM_T::RCAPDAT4: RCAPDAT Mask             */

#define PWM_FCAPDAT4_FCAPDAT_Pos         (0)                                               /*!< PWM_T::FCAPDAT4: FCAPDAT Position         */
#define PWM_FCAPDAT4_FCAPDAT_Msk         (0xfffful << PWM_FCAPDAT4_FCAPDAT_Pos)            /*!< PWM_T::FCAPDAT4: FCAPDAT Mask             */

#define PWM_RCAPDAT5_RCAPDAT_Pos         (0)                                               /*!< PWM_T::RCAPDAT5: RCAPDAT Position         */
#define PWM_RCAPDAT5_RCAPDAT_Msk         (0xfffful << PWM_RCAPDAT5_RCAPDAT_Pos)            /*!< PWM_T::RCAPDAT5: RCAPDAT Mask             */

#define PWM_FCAPDAT5_FCAPDAT_Pos         (0)                                               /*!< PWM_T::FCAPDAT5: FCAPDAT Position         */
#define PWM_FCAPDAT5_FCAPDAT_Msk         (0xfffful << PWM_FCAPDAT5_FCAPDAT_Pos)            /*!< PWM_T::FCAPDAT5: FCAPDAT Mask             */

#define PWM_SBS0_SYNCBUSY_Pos            (0)                                               /*!< PWM_T::SBS: SYNCBUSY Position            */
#define PWM_SBS0_SYNCBUSY_Msk            (0x1ul << PWM_SBS0_SYNCBUSY_Pos)                  /*!< PWM_T::SBS: SYNCBUSY Mask                */

#define PWM_SBS1_SYNCBUSY_Pos            (0)                                               /*!< PWM_T::SBS: SYNCBUSY Position            */
#define PWM_SBS1_SYNCBUSY_Msk            (0x1ul << PWM_SBS1_SYNCBUSY_Pos)                  /*!< PWM_T::SBS: SYNCBUSY Mask                */

#define PWM_SBS2_SYNCBUSY_Pos            (0)                                               /*!< PWM_T::SBS: SYNCBUSY Position            */
#define PWM_SBS2_SYNCBUSY_Msk            (0x1ul << PWM_SBS2_SYNCBUSY_Pos)                  /*!< PWM_T::SBS: SYNCBUSY Mask                */

#define PWM_SBS3_SYNCBUSY_Pos            (0)                                               /*!< PWM_T::SBS: SYNCBUSY Position            */
#define PWM_SBS3_SYNCBUSY_Msk            (0x1ul << PWM_SBS3_SYNCBUSY_Pos)                  /*!< PWM_T::SBS: SYNCBUSY Mask                */

#define PWM_SBS4_SYNCBUSY_Pos            (0)                                               /*!< PWM_T::SBS: SYNCBUSY Position            */
#define PWM_SBS4_SYNCBUSY_Msk            (0x1ul << PWM_SBS4_SYNCBUSY_Pos)                  /*!< PWM_T::SBS: SYNCBUSY Mask                */

#define PWM_SBS5_SYNCBUSY_Pos            (0)                                               /*!< PWM_T::SBS: SYNCBUSY Position            */
#define PWM_SBS5_SYNCBUSY_Msk            (0x1ul << PWM_SBS5_SYNCBUSY_Pos)                  /*!< PWM_T::SBS: SYNCBUSY Mask                */

/**@}*/ /* PWM_CONST */
/**@}*/ /* end of PWM register group */


/*---------------------- Quadrature Encoder Interface -------------------------*/
/**
    @addtogroup QEI Quadrature Encoder Interface(QEI)
    Memory Mapped Structure for QEI Controller
@{ */

typedef struct {


    /**
     * CNT
     * ===================================================================================================
     * Offset: 0x00  QEI Pulse Counter
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |VAL       |Quadrature Encoder Pulse Counter
     * |        |          |A 32-bit up/down counter.
     * |        |          |When an effective phase pulse is detected, this counter is increased by one if the bit DIRF (QEI_STATUS[27]) is one or decreased by one if the bit DIRF is zero.
     * |        |          |This register performs an integrator which count value is proportional to the encoder position.
     * |        |          |The pulse counter may be initialized to a predetermined value by one of three events occurs:.
     * |        |          |1. Software written if QEIEN (QEI_CTR[29]) = 0.
     * |        |          |2. Compare-match event if QEIEN=1 and QEI is in compare-counting mode.
     * |        |          |3. Index signal change if QEIEN=1 and IDXRLDEN (QEI_CTR[27])=1.
    */
    __IO uint32_t CNT;

    /**
     * CNTHOLD
     * ===================================================================================================
     * Offset: 0x04  QEI Pulse Counter Hold Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |VAL       |Quadrature Encoder Pulse Counter Hold Register
     * |        |          |When bit HOLDCNT (QEIx_CTR[24]) goes from low to high, the QEI_CNT value is copied into QEI_CNTHOLD register.
    */
    __IO uint32_t CNTHOLD;

    /**
     * CNTLATCH
     * ===================================================================================================
     * Offset: 0x08  QEI Pulse Counter Index Latch Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |VAL       |Quadrature Encoder Pulse Counter Index Latch
     * |        |          |When the IDXF (QEI_STATUS[18]) bit is set, the QEI_CNT value is copied into QEI_CNTLATCH register.
    */
    __IO uint32_t CNTLATCH;

    /**
     * CNTCMP
     * ===================================================================================================
     * Offset: 0x0C  QEI Pulse Counter Compare Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |VAL       |Quadrature Encoder Pulse Counter Compare
     * |        |          |if the QEI controller is in the compare-counting mode CMPENN (QEI_CTR[28]) =1, when the value of QEI_CNT matches the value of VAL the bit CMPF will be set.
     * |        |          |This register is software writeable.
    */
    __IO uint32_t CNTCMP;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE0[1];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * MAXCNT
     * ===================================================================================================
     * Offset: 0x14  QEI Pre-set Maximum Count Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |VAL       |Quadrature Encoder Preset Maximum Count
     * |        |          |This register value determined by user stores the maximum value which may be the number of the quadrature encoder pulses in a revolution for the QEI controller compare-counting mode
    */
    __IO uint32_t CNTMAX;

    /**
     * CTR
     * ===================================================================================================
     * Offset: 0x18  QEI Controller Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:1]   |NFCLKSEL  |Noise Filter Clock Pre-Divide Selection
     * |        |          |To determine the sampling frequency of the Noise Filter clock .
     * |        |          |00 = QEI_CLK.
     * |        |          |01 = QEI_CLK/2.
     * |        |          |10 = QEI_CLK/4.
     * |        |          |11 = QEI_CLK/16.
     * |[3]     |NFDIS     |QEI Controller Input Noise Filter Disable Control
     * |        |          |0 = The noise filter of QEI controller Enabled.
     * |        |          |1 = The noise filter of QEI controller Disabled.
     * |[4]     |CHAEN     |QEA Input To QEI Controller Enable Control
     * |        |          |0 = QEA input to QEI Controller Disabled.
     * |        |          |1 = QEA input to QEI Controller Enabled.
     * |[5]     |CHBEN     |QEB Input To QEI Controller Enable Control
     * |        |          |0 = QEB input to QEI Controller Disabled.
     * |        |          |1 = QEB input to QEI Controller Enabled.
     * |[6]     |IDXEN     |IDX Input To QEI Controller Enable Control
     * |        |          |0 = IDX input to QEI Controller Disabled.
     * |        |          |1 = IDX input to QEI Controller Enabled.
     * |[8:9]   |MODE      |QEI Counting Mode Selection
     * |        |          |There are four quadrature encoder pulse counter operation modes.
     * |        |          |00 = X4 Free-counting Mode.
     * |        |          |01 = X2 Free-counting Mode.
     * |        |          |10 = X4 Compare-counting Mode.
     * |        |          |11 = X2 Compare-counting Mode.
     * |[12]    |CHAINV    |Inverse QEA Input Polarity
     * |        |          |0 = Not inverse QEA input polarity.
     * |        |          |1 = QEA input polarity is inversed to QEI controller.
     * |[13]    |CHBINV    |Inverse QEB Input Polarity
     * |        |          |0 = Not inverse QEB input polarity.
     * |        |          |1 = QEB input polarity is inversed to QEI controller.
     * |[14]    |IDXINV    |Inverse IDX Input Polarity
     * |        |          |0 = Not inverse IDX input polarity.
     * |        |          |1 = IDX input polarity is inversed to QEI controller.
     * |[16]    |OVUNIEN   |OVUNF Trigger QEI Interrupt Enable Control
     * |        |          |0 = OVUNF can trigger QEI controller interrupt Disabled.
     * |        |          |1 = OVUNF can trigger QEI controller interrupt Enabled.
     * |[17]    |DIRIEN    |DIRCHGF Trigger QEI Interrupt Enable Control
     * |        |          |0 = DIRCHGF can trigger QEI controller interrupt Disabled.
     * |        |          |1 = DIRCHGF can trigger QEI controller interrupt Enabled.
     * |[18]    |CMPIEN    |CMPF Trigger QEI Interrupt Enable Control
     * |        |          |0 = CMPF can trigger QEI controller interrupt Disabled.
     * |        |          |1 = CMPF can trigger QEI controller interrupt Enabled.
     * |[19]    |IDXIEN    |IDXF Trigger QEI Interrupt Enable Control
     * |        |          |0 = The IDXF can trigger QEI interrupt Disabled.
     * |        |          |1 = The IDXF can trigger QEI interrupt Enabled.
     * |[20]    |HOLDTMR0  |Hold QEI_CNT By Timer 0
     * |        |          |0 = TIF (TISR0[0]) has no effect on HOLDCNT.
     * |        |          |1 = A rising edge of bit TIF (TISR0[0]) in timer 0 sets HOLDCNT to 1.
     * |[21]    |HOLDTMR1  |Hold QEI_CNT By Timer 1
     * |        |          |0 = TIF (TISR1[0]) has no effect on HOLDCNT.
     * |        |          |1 = A rising edge of bit TIF (TISR1[0]) in timer 1 sets HOLDCNT to 1.
     * |[22]    |HOLDTMR2  |Hold QEI_CNT By Timer 2
     * |        |          |0 = TIF (TISR2[0]) has no effect on HOLDCNT.
     * |        |          |1 = A rising edge of bit TIF (TISR2[0]) in timer 2 sets HOLDCNT to 1.
     * |[23]    |HOLDTMR3  |Hold QEI_CNT By Timer 3
     * |        |          |0 = TIF (TISR3[0]) has no effect on HOLDCNT.
     * |        |          |1 = A rising edge of bit TIF (TISR3[0]) in timer 3 sets HOLDCNT to 1.
     * |[24]    |HOLDCNT   |Hold QEI_CNT Control
     * |        |          |When this bit is set from low to high, the QEI_CNT value is copied into QEI_CNTHOLD.
     * |        |          |This bit may be set by writing 1 to it or Timer0~Timer3 interrupt flag TIF (TISTRx[0]).
     * |        |          |0 = No operation.
     * |        |          |1 = QEI_CNT content is captured and stored in QEI_CNTHOLD.
     * |        |          |Note: This bit is automatically cleared after QEI_CNTHOLD holds QEI_CNT value.
     * |[25]    |IDXLATEN  |Index Latch QEI_CNT Enable Control
     * |        |          |If this bit is set to high, the QEI_CNT content will be latched into QEI_CNTLATCH at every rising on signal CHX.
     * |        |          |0 = The index signal latch QEI counter function Disabled.
     * |        |          |1 = The index signal latch QEI counter function Enabled.
     * |[27]    |IDXRLDEN  |Index Trigger QEI_CNT Reload Enable Control
     * |        |          |When this bit is high and a rising edge comes on signal CHX, the QEI_CNT will be reset to zero if the counter is in up-counting type (DIRF = 1); while the QEI_CNT will be reloaded with QEI_MAXCNT content if the counter is in down-counting type (DIRF = 0).
     * |        |          |0 = Reload function Disabled.
     * |        |          |1 = QEI_CNT re-initialized by Index signal Enabled.
     * |[28]    |CMPENN    |The Compare Function Enable Control
     * |        |          |The compare function in QEI controller is to compare the dynamic counting QEI_CNT with the compare register QEI_CNTCMP, if QEI_CNT value reaches QEI_CNTCMP, the flag CMPF will be set.
     * |        |          |0 = Compare function Disabled.
     * |        |          |1 = Compare function Enabled.
     * |[29]    |QEIEN     |Quadrature Encoder Interface Controller Enable Control
     * |        |          |0 = QEI controller function Disabled.
     * |        |          |1 = QEI controller function Enabled.
    */
    __IO uint32_t CTR;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE1[4];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * STATUS
     * ===================================================================================================
     * Offset: 0x2C  QEI Controller Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |IDXF      |IDX Detected Flag
     * |        |          |When the QEI controller detects a rising edge on signal CHX it will set flag IDXF to high.
     * |        |          |0 = No rising edge detected on signal CHX.
     * |        |          |1 = A rising edge occurs on signal CHX.
     * |        |          |Note: This bit is only cleared by writing 1 to it.
     * |[1]     |CMPF      |Compare-Match Flag
     * |        |          |If the QEI compare function is enabled, the flag is set by hardware while QEI counter up or down counts and reach to the QEI_CNTCMP value.
     * |        |          |0 = QEI counter does not match with QEI_CNTCMP value.
     * |        |          |1 = QEI counter counts to the same as QEI_CNTCMP value.
     * |        |          |Note: This bit is only cleared by writing 1 to it.
     * |[2]     |OVUNF     |QEI Counter Overflow Or Underflow Flag
     * |        |          |Flag is set by hardware while QEI_CNT overflows from 0xFFFF_FFFF to zero in free-counting mode or from the QEI_MAXCNT value to zero in compare-counting mode.
     * |        |          |Similarly, the flag is set wile QEI counter underflows from zero to 0xFFFF_FFFF or QEI_MAXCNT.
     * |        |          |0 = No overflow or underflow occurs in QEI counter.
     * |        |          |1 = QEI counter occurs counting overflow or underflow.
     * |        |          |Note: This bit is only cleared by writing 1 to it.
     * |[3]     |DIRCHGF   |Direction Change Flag
     * |        |          |Flag is set by hardware while QEI counter counting direction is changed.
     * |        |          |Software can clear this bit by writing 1 to it.
     * |        |          |0 = No change in QEI counter counting direction.
     * |        |          |1 = QEI counter counting direction is changed.
     * |        |          |Note: This bit is only cleared by writing 1 to it.
     * |[8]     |DIRF      |QEI Counter Counting Direction Indication
     * |        |          |0 = QEI Counter is in down-counting.
     * |        |          |1 = QEI Counter is in up-counting.
     * |        |          |Note: This bit is set/reset by hardware according to the phase detection between CHA and CHB.
    */
    __IO uint32_t STATUS;

} QEI_T;

/**
    @addtogroup QEI_CONST QEI Bit Field Definition
    Constant Definitions for QEI Controller
@{ */

#define QEI_CNT_VAL_Pos                  (0)                                               /*!< QEI_T::CNT: VAL Position                  */
#define QEI_CNT_VAL_Msk                  (0xfffffffful << QEI_CNT_VAL_Pos)                 /*!< QEI_T::CNT: VAL Mask                      */

#define QEI_CNTHOLD_VAL_Pos              (0)                                               /*!< QEI_T::CNTHOLD: VAL Position              */
#define QEI_CNTHOLD_VAL_Msk              (0xfffffffful << QEI_CNTHOLD_VAL_Pos)             /*!< QEI_T::CNTHOLD: VAL Mask                  */

#define QEI_CNTLATCH_VAL_Pos             (0)                                               /*!< QEI_T::CNTLATCH: VAL Position             */
#define QEI_CNTLATCH_VAL_Msk             (0xfffffffful << QEI_CNTLATCH_VAL_Pos)            /*!< QEI_T::CNTLATCH: VAL Mask                 */

#define QEI_CNTCMP_VAL_Pos               (0)                                               /*!< QEI_T::CNTCMP: VAL Position               */
#define QEI_CNTCMP_VAL_Msk               (0xfffffffful << QEI_CNTCMP_VAL_Pos)              /*!< QEI_T::CNTCMP: VAL Mask                   */

#define QEI_CNTMAX_VAL_Pos               (0)                                               /*!< QEI_T::CNTMAX: VAL Position               */
#define QEI_CNTMAX_VAL_Msk               (0xfffffffful << QEI_CNTMAX_VAL_Pos)              /*!< QEI_T::CNTMAX: VAL Mask                   */

#define QEI_CTR_NFCLKSEL_Pos             (0)                                               /*!< QEI_T::CTR: NFCLKSEL Position             */
#define QEI_CTR_NFCLKSEL_Msk             (0x3ul << QEI_CTR_NFCLKSEL_Pos)                   /*!< QEI_T::CTR: NFCLKSEL Mask                 */

#define QEI_CTR_NFDIS_Pos                (3)                                               /*!< QEI_T::CTR: NFDIS Position                */
#define QEI_CTR_NFDIS_Msk                (0x1ul << QEI_CTR_NFDIS_Pos)                      /*!< QEI_T::CTR: NFDIS Mask                    */

#define QEI_CTR_CHAEN_Pos                (4)                                               /*!< QEI_T::CTR: CHAEN Position                */
#define QEI_CTR_CHAEN_Msk                (0x1ul << QEI_CTR_CHAEN_Pos)                      /*!< QEI_T::CTR: CHAEN Mask                    */

#define QEI_CTR_CHBEN_Pos                (5)                                               /*!< QEI_T::CTR: CHBEN Position                */
#define QEI_CTR_CHBEN_Msk                (0x1ul << QEI_CTR_CHBEN_Pos)                      /*!< QEI_T::CTR: CHBEN Mask                    */

#define QEI_CTR_IDXEN_Pos                (6)                                               /*!< QEI_T::CTR: IDXEN Position                */
#define QEI_CTR_IDXEN_Msk                (0x1ul << QEI_CTR_IDXEN_Pos)                      /*!< QEI_T::CTR: IDXEN Mask                    */

#define QEI_CTR_MODE_Pos                 (8)                                               /*!< QEI_T::CTR: MODE Position                 */
#define QEI_CTR_MODE_Msk                 (0x3ul << QEI_CTR_MODE_Pos)                       /*!< QEI_T::CTR: MODE Mask                     */

